[
    "To view this email as a web page, go here. Dear Trojan Family, We are excited to start a new academic year and welcome our new and returning students, faculty, staff, and alumni to campus. It's a wonderful time to renew and create new relationships, explore something different, and set fresh goals. We have a very busy term ahead, with new academic programs, events around joining the Big Ten, marquee student performances, research breakthroughs, and so much more. We hope you had a refreshing summer and look forward to seeing you. Over the summer we tightened and expanded our rules and processes designed to ensure our campus is safe and welcoming for everyone. A list of links to this critical information is included below. One thing you’ll notice immediately is the improved process of accessing campus. We hope the new system will make it faster and easier. Last Spring's Challenges: The events of last spring were particularly challenging for campuses nationwide. USC has seen peaceful protests, vigils, and marches for years, including more than 130 last year alone. However, the spring semester brought incidents that tested our values, disregarded our policies, sparked fears, and required unprecedented safety measures. While many in our community were not directly involved in the protests, we recognize the genuine pain and frustration driving them. This suffering and passion did not disappear over the summer. We hope by making our policies, guidelines, and rules clearer, we can make USC welcoming and safe for all, no matter what issues or conflicts arise. Free Expression and Academic Freedom: The ability to express oneself, to assert beliefs, and to dissent is fundamental to our university and our democracy. We each share a responsibility to foster an environment where divergent ideas can be discussed, examined, and challenged without infringing on others’ rights and safety. As we transition to the fall semester, we remain committed to ensuring your rights to free speech, academic freedom, and peaceful protest in accordance with state and federal law. We expect you to follow the university’s rules and policies designed to support your rights and prevent disruption of university functions. We also are required by law to maintain a safe and bias-free environment in our classrooms, hospitals, events, and campuses. These values are essential to the Trojan community and do not conflict with free speech or academic freedom. The links below explain free expression and academic freedom, along with legal responsibilities and limitations. Time, Place, and Manner Rules for Free Expression at USC: USC has long-standing rules, guided by federal and state law, to ensure that everyone can participate fully in a bias-free, free speech academic and on-campus residential environment. These “time, place, and manner” limitations balance your right to express yourselves with the university’s responsibility to ensure the rights of all. These include long-standing rules banning encampments, damaging property, blocking access to campus and classrooms, doxing, harassment, and bullying (online or in person), as well as clear guidelines for protests of all sorts. Over the summer, we reviewed and clarified these policies. You should become familiar with this material, and the Student Commitment which all students were required to read and acknowledge before enrolling. The university will continue to enforce these rules fairly, consistently, and expeditiously, acting quickly to protect campus health and safety. It always has been a Trojan Family value to be patient and respectful even in heated debates. By adhering to our highest standards, we will continue to maintain a culture of respect and dignity toward others. University Statements, Communication, and Accountability: Universities and their leaders often are asked to take sides on political, social, and moral issues. Yet, such statements can silence people, be seen as speaking for everyone, and lead to unintended consequences and seeming orthodoxies that stifle people’s rights of free speech. This runs counter to our responsibility to support viewpoint diversity, open and impartial debate, free speech, and safety in all aspects of university life. This understanding drove the Unifying Values written and adopted by the USC community in 2020, which include “fostering a community in which we solicit, embrace, and share diverse viewpoints.” In line with these ideas, going forward as individual leaders or on behalf of the university, we will not post statements or take sides in political or social debates unless it pertains directly to our institutional mission and operations. This posture, sometimes referred to as “institutional restraint or neutrality,” has been widely adopted by both public and private universities across America. Trojans Care for Trojans: Global conflicts, along with social and political unrest or transition, always prompt strong reactions and feelings at universities. We embrace our societal role and encourage Trojans to safely and freely express themselves. At the same time, we call on you to care for your fellow Trojans even if you strongly disagree on issues. Let’s embrace the expression “Trojans Care for Trojans.” By working together, we can create a university home for our Trojan Family that values differing opinions, cultivates open dialogue, supports one another, and seeks common ground in a complex world. We look forward to a great year with you. Fight On! Carol L. Folt President Robert C. Packard President's Chair Andrew Guzman Provost and Senior Vice President for Academic Affairs Steven Shapiro Senior Vice President for Health Affairs Links to USC Resources Accessing campus Free speech Free expression FAQs including time, place, and manner USC policies – prohibited discrimination, harassment, and retaliation Academic freedom (also see Faculty Handbook) Campus safety Care for our Community Addressing hate speech Addressing antisemitism USC Integrity and Accountability Code USC Student Commitment Unifying Values UNIVERSITY OF SOUTHERN CALIFORNIA University Park • Los Angeles, CA 90089 If you wish to be removed from this group's mailing list, click here",
    "Care for our Community - We Are SC Skip to main content Go to usc.edu homepage USC Monogram We Are SC MenuAn icon that consists of three parallel horizontal lines suggestive of a list. We Are SC Stories Happening NowShow submenu for Happening Now Trojan Welcome Experience Heritage Months at USC ONE USC Safety USC Frontiers of Computing Campus ResourcesShow submenu for Campus Resources Student Resources Faculty and Staff Resources Care for our Community Alumni Health and SafetyShow submenu for Health and Safety Campus Safety COVID-19 Daily Digest COVID-19 Resource Center Emergency Safety Mobile App Student Health Commitment to ChangeShow submenu for Commitment to Change USC Culture Journey Human Resources Design for the Future Public Safety Community Advisory Board Addressing AntisemitismShow submenu for Addressing Antisemitism Messages Frequently Asked Questions Advisory Committee on Jewish Life at USC Advisory Committee on Muslim Life at USC University Messages More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Care for our Community USC offers several support centers to help students, faculty and staff navigate difficult times. They are available for members of the university seeking help for themselves, as well as where members can request help for others who need support. STUDENT SUPPORT Counseling & Mental Health Services Counseling & Mental Health Services of USC Student Health provides clinical mental health services to students, including embedded counselors at SEIP cultural centers and academic schools. For connection to counseling, advice nurse, confidential advocates, and help with other urgent health matters call our 24/7 number: 213-740-9355 (WELL). Campus Support and Intervention Campus Support and Intervention connects with members of the USC community when they need support in achieving their academic, professional, and/or personal goals. They can provide consultation, in person, by Zoom, or over the phone, to learn more about your individual situation so they can provide guidance and help you connect with relevant campus and community resources. Trojans Care 4 Trojans (TC4T) USC Trojans Care 4 Trojans (TC4T) is an initiative within the Office of Campus Wellbeing and Crisis Intervention that empowers USC students, faculty and staff to take action when they are concerned about a fellow Trojan challenged with personal difficulties. This private and anonymous request form provides an opportunity for Trojans to help a member of our Trojan Family. FACULTY AND STAFF SUPPORT WorkWell Center The USC WorkWell Center provides programs, resources, and services to USC benefits-eligible faculty, staff, and their dependents, as well as post-docs and retirees, that help them thrive in all areas of work-life wellness. Campus Support and Intervention Campus Support and Intervention connects with members of the USC community when they need support in achieving their academic, professional, and/or personal goals. They can provide consultation, in person, by Zoom, or over the phone, to learn more about your individual situation so they can provide guidance and help you connect with relevant campus and community resources. Trojans Care 4 Trojans (TC4T) USC Trojans Care 4 Trojans (TC4T) is an initiative within the Office of Campus Wellbeing and Crisis Intervention that empowers USC students, faculty and staff to take action when they are concerned about a fellow Trojan challenged with personal difficulties. This private and anonymous request form provides an opportunity for Trojans to help a member of our Trojan Family. Care for the Caregiver Care for the Caregiver is a comprehensive program designed to ease potential work environment stress for our dedicated healthcare staff and faculty at Keck Medicine of USC. The goal of the program is to create work environments that align with our values and to return to our employees the same level of comfort and care they supply to our patients and their loved ones. Healthcare staff and faculty can contact Care for the Caregiver at 323-865-9897 or CareForTheCaregiver@med.usc.edu. University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility",
    "Special Celebrations – USC Commencement Skip to content USC Website Toggle search interface Search Search Site Close search interface Menu Toggle extended navigation USC Commencement Ceremonies & CelebrationsToggle \"Ceremonies & Celebrations\" dropdown Academic School Ceremonies Special Celebrations Full Schedule Photo Gallery For GraduatesToggle \"For Graduates\" dropdown Ticketing Information Celebration Kits Caps and Gowns (Regalia) Commemorative Items Alumni Association For GuestsToggle \"For Guests\" dropdown Transit and Parking Accessibility Information Dining FAQ for Class of 2024 AboutToggle \"About\" dropdown Important Updates University Marshal More Menu Toggle extended navigation HomeCeremonies & CelebrationsSpecial Celebrations Special Celebrations Trojan Family Graduate Celebration Special guests and surprise performances will create an electric atmosphere at the Los Angeles Memorial Coliseum as graduating students and their families gather for a graduation celebration Southern California-style. Count on drone shows, fireworks, the Trojan Marching Band, and a special gift for members of the Class of 2024. This is a ticketed event available to graduating students and 5 plus-ones per grad (6 tickets total). Check back for more information.For more information, visit LA Coliseum event page Baccalaureate As we adjust our commencement ceremonies to focus on our 23 schools’ celebrations, this year’s in-person Baccalaureate Ceremony has been changed to an in-person blessing for our graduates at the Trojan Family Graduate Celebration at the Los Angeles Memorial Coliseum on Wednesday at 5:00 PM. Also, USC will host an online interfaith blessing for all graduating students and their families. Ph.D. Hooding Ceremonies USC Viterbi School of Engineering Wednesday, May 14, 2024, 8:30 a.m.Location: Bovard Auditorium USC Marshall School of Business Wednesday, May 14, 2024, 9:00 a.m.Location: Davidson Conference Center, Vineyard Room USC Dornsife College of Letters, Arts and Sciences Wednesday, May 14, 2024, 8:30 a.m.Location: Epstein Family Plaza (E-Quad) USC Rossier School of Education Wednesday, May 14, 2024, 1:00 p.m.Location: Epstein Family Plaza (E-Quad) USC Annenberg School for Communications and Journalism Wednesday, May 14, 2024, 11:30 a.m.Location: Annenberg Hall Cultural Celebrations Asian & Pacific Islander Graduate Celebration Hosted by Asian Pacific American Student Services, Student LifeThursday, May 9, 2024, 1:00 p.m.Location: Epstein Family Plaza (E-Quad)For information and to RSVP, visit the APASS website. Black Graduate Celebration Hosted by the Center for Black Cultural and Student Affairs, Student LifeWednesday, May 14, 2024, 6:30 p.m.Location: McCarthy QuadFor information and to RSVP, contact: cbcsa@usc.edu, 213-740-8257 Latinx/e Graduate Celebration Hosted by La CASA, Student LifeThursday, May 15, 2024, 2:30 p.m.Location: McCarthy QuadFor information and to RSVP, contact: lacasa@usc.edu, 213-740-1480 Lavender Graduate Celebration Hosted by the LGBTQ+ Student Center, Student LifeThursday, May 15, 2024, 10:30 a.m.Location: Ronald Tutor Campus Center BallroomFor more information and to RSVP, visit the Lavender Celebration event page. Military and Veteran Celebrations Veteran & Military-Affiliated Graduate Celebration Hosted by the Veterans Resource Center.Wednesday, May 14, 2024, 11:30 a.m. Location: Ronald Tutor Campus Center BallroomFor more information and to RSVP, contact vrc@usc.edu or (213) 740-8605. ROTC Ceremonies The ROTC Joint Commencement ceremony occurs alongside the Veteran & Military-Affiliated Graduate Celebration on Wednesday, May 14, 2024, at 11:30 a.m. at the Ronald Tutor Campus Center Ballroom. Additional Scheduled Events Phi Kappa Phi Initiation Ceremony Check back for more information.An invitation-only ceremony honoring new Phi Kappa Phi honor society faculty and student initiates; hosted by the Phi Kappa Phi Society. Contact: pkp@usc.edu USC Athletics Graduate Celebration Thursday, May 15, 2024, 1:00 p.m., Galen CenterAn invitation-only ceremony for graduating athletes; hosted by USC Athletics Campus Activities Events Glow’duation Carnival (Carnival Night) Check back for more information. The last social program of the academic year. Come play carnival games or casino table games. A ferris wheel will also be present for that final ferris wheel ride at USC. Two photo booths will be available to capture your memories with friends. Enjoy activities including, caricature artist, airbrush painting, wax hands, and tarot card readings. Students can turn in tickets to be entered to win prizes. Snacks will be provided. Grad Brunch Check back for more information. It’s the last day of class, and we’re hosting breakfast! Come enjoy Fight On Waffles, fruit, parfaits, and more before your last day of classes. UNIVERSITY OF SOUTHERN CALIFORNIA University Park CampusLos Angeles, CA 90007 CONTACT US acevents@usc.edu University of Southern California Privacy Notice Notice of Non-Discrimination Digital Accessibility Close Menu Search Search Site Ceremonies & CelebrationsToggle \"Ceremonies & Celebrations\" submenu Academic School Ceremonies Special Celebrations Full Schedule Photo Gallery For GraduatesToggle \"For Graduates\" submenu Ticketing Information Celebration Kits Caps and Gowns (Regalia) Commemorative Items Alumni Association For GuestsToggle \"For Guests\" submenu Transit and Parking Accessibility Information Dining FAQ for Class of 2024 AboutToggle \"About\" submenu Important Updates University Marshal",
    "USC Counseling & Mental Health Services – School affiliation, if applicable Skip to content USC Website Toggle search interface Search Search Site Close search interface Menu Toggle extended navigation USC Counseling & Mental Health Services Start Here First Steps Costs and Fees Understanding Insurance Care Coordination Confidentiality Meet the Team ServicesToggle \"Services\" dropdown What’s the difference…? One Time AppointmentsToggle \"One Time Appointments\" dropdown let’s talk solution sessions CounselingToggle \"Counseling\" dropdown Your Initial Assessment Group Therapy Embedded Counselors Therapy for Substance Use Topics Insurance-Based Telehealth Behavioral Health Workshops Community Education Therapy+Toggle \"Therapy+\" dropdown Oasis Chat UWill Nod Crisis SupportToggle \"Crisis Support\" dropdown Suicide Prevention Lifeline Sexual Assault Survivor Support Crisis Text Line Help for Cultural Communities (BIPOC, LGBTQ+)Toggle \"Cultural Communities (BIPOC, LGBTQ+)\" dropdown it isn’t just you. Meet your BIPOC and Lived Experience Clinicians Make an Appointment MySHR Screenshot Guide Academic Communities Parents Faculty and Staff Mental Health Professionals CMH Resources FAQ Therapy Glossary Reading Room Self Assessment Tool: My Mental Health Other Resources Array Behavioral Health (SHIP/Aetna) Mindfulness Trusted Resources (external) Events Campus Resources More Menu Toggle extended navigation Get the right kind of help.Right when you need it.Delivered the right way. Start here. How to get in touchand what to expect Services How we support USC students Urgent Help Crisis support,24/7 Therapy+ is a suite of extension services to support USC students selected by Counseling and Mental Health (CMH) in USC Student Health. These services are provided for through the USC Student Health Fee (SHF). UWill provides connections to external therapist services for students. Features: Connect to therapist services, available within 48 hours Select therapist based on cultural experience and expertise Choose from text, video, or phone connections Available to USC students participating in the Student Health Fee (SHF) who are not currently being seen as CMH clients; activated through MySHR request to CMH care coordination team learn more ABOUT UWILL Oasis Chat provides text-based connection to a trained responder, for warmline support right from your phone. Features: Connect right away to a trained responder Available when you need it Activated through USC student email learn more ABOUT OASIS CHAT Nod is the friendly app that helps you approach new people on campus. Features: Tips for following up and connecting Setting low-key, achievable social goals Conversation starters to break the ice Activated through USC student email learn more ABOUT THE NOD APP Close MySHR MySHR is your resource to book a workshop (under workshops) sign up for a therapy group (under appointments), Book \"Let's Talk\" or request a therapist appointment by a culture experience specific to you (under appointments). Need assistance? Call 213-740-9355 (WELL) CONTACT Location and Hours(213) 740-9355 (WELL)studenthealth@usc.eduTell Us What You Think SOCIAL Instagram Facebook TikTok OUR SITES Counseling and Mental Health • Sex and Health • Confidential Advocacy, Resources, and Education — Support Center • Cultural Communities & Lived Experiences • Athletic Medicine • Staying Well New Student • Insurance (SHIP) ABOUT US Mission, Values, and Vision Annual Report 2022-2023 LEADERS & PROVIDERS Leadership Meet the Providers JOIN OUR TEAM Employment Opportunities Training for College Mental Health Professionals Student Jobs INTRANET Intranet (Log-in required) POLICIES / INFORMATION Patient Privacy and Confidentiality Patient Rights and Responsibilities Medical Policies and Forms A-Z site map FEES Fees and Deadlines List For Online Students INTERPRETER SERVICES Available upon request UPDATES Staying Well at USC COVID-19 Daily Notifications (login required) Patient Materials HEALTHY CAMPUS AND WELLBEING PARTNERS Newsletter Wellbeing Collective ONE Safety USC Guides for Faculty Student Health Advisory Committee Meet the Health Promotion Strategy Team Counseling &Mental Health Services Counseling and Mental Health programs include individual therapy, group therapy, crisis support, psychiatric services and specialties for gender-based harm. CMH Training Clinical training across disciplines, including our APA-accredited psychology internship program, post-doctoral fellowship program, postgraduate fellowship program, advanced practicum program, and social work internship program. All mental health care providers are clinical faculty of the Dept. of Psychiatry and the Behavioral Sciences., Keck School of Medicine of USC. All programs are provided for through participation in the USC Student Health Fee (SHF). University of Southern California Privacy Notice Notice of Non-Discrimination Digital Accessibility Close Menu Search Search Site Start HereToggle \"Start Here\" submenu First Steps Costs and Fees Understanding Insurance Care Coordination Confidentiality Meet the Team ServicesToggle \"Services\" submenu What’s the difference…? One Time Appointments Counseling Workshops Community Education Therapy+Toggle \"Therapy+\" submenu Oasis Chat UWill Nod Crisis SupportToggle \"Crisis Support\" submenu Suicide Prevention Lifeline Sexual Assault Survivor Support Crisis Text Line Help forToggle \"Help for\" submenu Cultural Communities (BIPOC, LGBTQ+) Academic Communities Parents Faculty and Staff Mental Health Professionals CMH ResourcesToggle \"CMH Resources\" submenu FAQ Therapy Glossary Reading Room Self Assessment Tool: My Mental Health Other ResourcesToggle \"Other Resources\" submenu Array Behavioral Health (SHIP/Aetna) Mindfulness Trusted Resources (external) Events Campus Resources",
    "Share Your Input – Department of Public Safety Community Advisory Board Skip to content USC Website Toggle search interface Search Search Site Close search interface Menu Toggle extended navigation Department of Public Safety Community Advisory Board Home Community Advisory Board Members CAB Report and Recommendations Implementation Dashboard Share Your Input Messages Contact More Menu Toggle extended navigation HomeShare Your Input Share Your Input ﻿﻿﻿Loading… University of Southern California Privacy Notice Notice of Non-Discrimination Digital Accessibility Close Menu Search Search Site Home Community Advisory Board Members CAB Report and Recommendations Implementation Dashboard Share Your Input Messages Contact",
    "Programs & Initiatives – USC University Relations Skip to content USC Website Toggle search interface Search Search Site Close search interface Menu Toggle extended navigation USC University Relations Home Programs & InitiativesToggle \"Programs & Initiatives\" dropdown Education Initiatives Community Partnerships Government Relations Classical California USC Votes About UsToggle \"About Us\" dropdown Quick Facts Contact UsToggle \"Contact Us\" dropdown University Relations Directory Subscribe to Our Newsletter More Menu Toggle extended navigation HomePrograms & Initiatives Programs & Initiatives Our community programs involve lasting, meaningful collaboration with our neighbors, with the goal of having tangible, positive impacts for local residents — from offering free tuition for low-income families earning less than $80,000 a year to supporting local small businesses through grants and mentorships Education Initiatives Community Partnerships Government Relations Classical California USC University Relationsuniversityrelations@usc.eduSign up for the USC community newsletter RELATED LINKS Community Resources Digital Accessibility Good Neighbors Campaign Trojan Shop Local Do Business with USC USC Today University of Southern California Privacy Notice Notice of Non-Discrimination Digital Accessibility Close Menu Search Search Site Home Programs & InitiativesToggle \"Programs & Initiatives\" submenu Education Initiatives Community Partnerships Government Relations Classical California USC Votes About UsToggle \"About Us\" submenu Quick Facts Contact UsToggle \"Contact Us\" submenu University Relations Directory Subscribe to Our Newsletter",
    "Daily Crime and Fire Log (DCFL) - Department of Public Safety Skip to main contentSkip to secondary content Go to usc.edu homepage USC Monogram Department of Public Safety MenuAn icon that consists of three parallel horizontal lines suggestive of a list. AboutShow submenu for About Chief’s Message Executive Staff Types of Officers Frequently Asked Questions ServicesShow submenu for Services After Hours Visitor Registration LAX Airport Shuttle Reservation Alarms Bicycle, Scooter, and Skateboard Registration CCTV Video Request Automated License Plate Recognition System (ALPR) Emergency Blue Light Phones Health & Wellness Resources Lost and Found LiveSafe Mobile Safety App Patrol Areas Property Identification Engraving Request Report Copy Safety Training Secure Parking During Semester Breaks TrojansAlert USC Events Permit Application Security Assessment Self-defense Classes Safety TipsShow submenu for Safety Tips Be Aware of Scams Getting Around Campus Safely Hosting Social Events Jogging Safety Moving Out and Traveling Sexual Assault and Violence Suspicious Activity & ConfrontationsShow submenu for Suspicious Activity & Confrontations What to Do During a Robbery Panhandling Theft PreventionShow submenu for Theft Prevention Laptop Theft Prevention and Recovery Clery & Crime AlertsShow submenu for Clery & Crime Alerts Campus Security Authorities Clery RequirementsShow submenu for Clery Requirements Clery On-Campus Map Clery Crimes and Definitions Alerts Daily Crime & Fire Log Annual Security Report Community OutreachShow submenu for Community Outreach Cadet Program Safety Presentations ContactShow submenu for Contact Give Feedback Report a Crime Join DPS Get Connected More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. HomeClery & Crime AlertsDaily Crime and Fire Log (DCFL) Daily Crime and Fire Log (DCFL) The Daily Crime & Fire Log includes all calls or reports of crimes that are submitted to DPS. The log lists reports – including anonymous reports – as received, and does not reflect any assessment of whether a report is credible, whether a crime has been committed or whether a formal investigation will be opened. An entry in the log is intended only to provide timely, transparent information to the campus community about reported incidents on or near campus so that community members can make informed safety decisions. It is important to note that, in some cases, there may be a gap between when an event occurred and when it was reported to DPS. It takes time to investigate these reports thoroughly and fairly, and we urge the USC community to respect legal and university processes. Do not target or threaten an individual or groups of individuals based on an incident summary or association with locations where a reported incident may have occurred. Finally, if you have or think you have pertinent information related to something you see in one of the Daily Crime & Fire Log entries, please contact DPS. Likewise, if you feel threatened or retaliated against because of something in a log entry, please contact DPS. Current Crime & Fire Log 60 Day Crime & Fire Log Daily Crime and Fire Log (DCFL) Clery Requirements Clery On-Campus Map Clery Crimes and Definitions Annual Security Report RELATED WEBSITES USC SafetyFire Safety and Emergency PlanningEnvironmental Health & SafetyParking Tickets (USC Transportation)Diversity at USCDPS EmploymentCampus Events Permit USC EMERGENCY INFORMATION Current Status EMERGENCY PHONE NUMBERS For 24 hour emergency assistance or to report a crime:UPC: 213-740-4321HSC: 323-442-1000 NON-EMERGENCY PHONE NUMBERS For 24 hour non-emergency assistance or information:UPC: 213-740-6000HSC: 323-442-1200 University of Southern CaliforniaContent managed by Department of Public SafetyPrivacy Notice Notice of Non-Discrimination Digital Accessibility X (Formerly Twitter)XThe logo for the social media platform X. FacebookFacebookThe logo for the social media platform Facebook. InstagramInstagramThe logo for the social media platform Instagram.",
    "A Message from President Folt - We Are SC Skip to main content Go to usc.edu homepage USC Monogram We Are SC MenuAn icon that consists of three parallel horizontal lines suggestive of a list. We Are SC Stories Happening NowShow submenu for Happening Now Trojan Welcome Experience Heritage Months at USC ONE USC Safety USC Frontiers of Computing Campus ResourcesShow submenu for Campus Resources Student Resources Faculty and Staff Resources Care for our Community Alumni Health and SafetyShow submenu for Health and Safety Campus Safety COVID-19 Daily Digest COVID-19 Resource Center Emergency Safety Mobile App Student Health Commitment to ChangeShow submenu for Commitment to Change USC Culture Journey Human Resources Design for the Future Public Safety Community Advisory Board Addressing AntisemitismShow submenu for Addressing Antisemitism Messages Frequently Asked Questions Advisory Committee on Jewish Life at USC Advisory Committee on Muslim Life at USC University Messages More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. A Message from President Folt October 16, 2023 I want to welcome our students back from fall break. Even a couple of days off can be restorative. These past few weeks have been incredibly difficult for many members of our community. I hope you found time for yourselves and were able to get some much-needed rest. With classes back in full session, our campuses again are brimming with people and activity. Yet, like many of you, I realize that I am passing students, staff, faculty, and visitors who have family members and friends being directly impacted by violence taking place in several regions of the world. Our hearts go out to them. For many, the pain and fear for loved ones make concentrating very hard, and concerns about their own safety and fears of retaliation are ever present. More than ever, a gentle and kind approach to each other is needed – a recognition of the humanity we all share and the ties that bind us. Showing our compassion and being aware that none of us knows the full extent of what others are experiencing or feeling is a big step we each can take. In the coming days, we will continue to provide service and support systems for everyone. We continue to supplement our mental health and public safety teams. USC is a unique and extraordinary community. With close to 80,000 Trojans on our campuses, hospitals, and clinics, and more than 480,000 alumni – Trojans come from every state, more than 150 countries, and from virtually every culture, religion, walk of life, and perspective. Our diverse and beautiful community is our most special gift. We learn from and are enriched by each other; our bonds are lifelong and worldwide. As we have in the past, by drawing upon our extraordinary family and our humanity, we can make USC a respite of compassion and kindness. Trojans always care for Trojans. I wish each of you a safe and successful second half of the semester. Sincerely, President Folt CommunityEmployeesFacultyLatestPresidentProvostStudents University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility",
    "A Message to the Trojan Community - Office of the President Skip to main content Go to usc.edu homepage USC Monogram Office of the President MenuAn icon that consists of three parallel horizontal lines suggestive of a list. Home Biography From the PresidentShow submenu for From the President Community Messages Speeches Conversations Contact Presidential Working GroupsShow submenu for Presidential Working Groups Racial Equity, Diversity, and Inclusion (REDI) Presidential Working Group on Sustainability in Education, Research, and Operations Student-Athlete Experience Task Force Department of Public Safety Community Advisory Board (CAB) Interfraternity Council Culture, Prevention, and Accountability More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. A Message to the Trojan Community April 26, 2024 Dear Trojan Community, These past few weeks have been incredibly difficult for all of us. As your president, my responsibility is to uphold our Trojan values so that everyone who lives, learns, and works here can have safe places to live, learn, and speak.This week, Alumni Park became unsafe. No one wants to have people arrested on their campus. Ever. But, when long-standing safety policies are flagrantly violated, buildings vandalized, DPS directives repeatedly ignored, threatening language shouted, people assaulted, and access to critical academic buildings blocked, we must act immediately to protect our community.USC has long-standing protocols that allow for peaceful protesting, and we have been working successfully with our community to ensure these rules have been followed at gatherings, protests, and vigils taking place all year. USC also has firm rules regarding harassment and bullying that we will uphold. If you have a concern, please report it here. I assure you we will launch an inquiry and take action to protect all USC students, faculty, and staff – no matter their views.The current pressures and polarization have taken a toll in ways that break my heart. I know Trojans will do what they have always done: share points of view, listen, search for common ground – and find ways to support each other. As students prepare for finals and our graduates look forward to celebrating their achievements at commencement – which we will do in just two weeks – we remain focused on what commencement means for all our graduates. This is especially true for our seniors who did not have a high school graduation and spent their first university year online. Many of you have been on this journey together – from new student convocation to USC’s 141st commencement – for four years. Still others, like many of our graduate students, have shared even more years together. Many more faculty and staff have been working side-by-side with their colleagues throughout decades of service to our university.We are working around the clock to infuse this special day with new activities, surprises, and celebrations, while upholding traditions that are uniquely USC.I know every Trojan will continue to bring their best selves to meet this moment. Sincerely, Carol L. FoltPresident USC Office of the President Los Angeles, CA 90089-0012 (213) 740-2111 president@usc.edu University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility InstagramInstagramThe logo for the social media platform Instagram. XXThe logo for the social media platform X.",
    "President Folt’s statement regarding situation in Israel and Gaza (10/10 update) - We Are SC Skip to main content Go to usc.edu homepage USC Monogram We Are SC MenuAn icon that consists of three parallel horizontal lines suggestive of a list. We Are SC Stories Happening NowShow submenu for Happening Now Trojan Welcome Experience Heritage Months at USC ONE USC Safety USC Frontiers of Computing Campus ResourcesShow submenu for Campus Resources Student Resources Faculty and Staff Resources Care for our Community Alumni Health and SafetyShow submenu for Health and Safety Campus Safety COVID-19 Daily Digest COVID-19 Resource Center Emergency Safety Mobile App Student Health Commitment to ChangeShow submenu for Commitment to Change USC Culture Journey Human Resources Design for the Future Public Safety Community Advisory Board Addressing AntisemitismShow submenu for Addressing Antisemitism Messages Frequently Asked Questions Advisory Committee on Jewish Life at USC Advisory Committee on Muslim Life at USC University Messages More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. President Folt’s statement regarding situation in Israel and Gaza (10/10 update) Over the past several days, I have been in touch with many members of the Trojan Family who voiced their pain and despair in the wake of the unprecedented terrorist attacks in Israel. We mourn the shocking loss of life. We condemn the terrorist attacks by Hamas and their brutal threats to execute kidnapped civilians and commit other atrocities. As the horror in Israel and Gaza continues to unfold before our eyes, many of you have asked about how we are addressing the safety and well-being of our Trojan Family at USC. We immediately strengthened security protocols on our campuses and at places of worship. We just launched a new online source for accessing all available support services and updates. University resources and support will be open and operational throughout the fall break. The provost is working with faculty in all schools to provide academic accommodations for students who are struggling. Campus Support and Intervention and the Student Health Center continue to provide outreach and counseling services. We will provide additional support as needed. I have seen our Trojan community pull together with grace and humanity in these deeply disturbing times. During the dark days ahead, we need the light and compassion of our university community more than ever. Statement from 9:34 a.m. Sunday, Oct. 8: USC President Carol L. Folt released the following statement on Sunday: The grave events and the tragic loss of life taking place right now in Israel and Gaza fill us with such sadness. Our hearts go out to the millions of people there and to our own Trojan students, staff, faculty, families and alumni hurting and in fear for loved ones. We must — by working together with empathy and compassion — keep this anger and fear from harming and overwhelming our own community. Let’s hold each other close and do all we can to support each other. Our university already is doubling down on providing support, resources and enhanced safety measures for our students, staff, faculty and members of our Trojan community. Campus Support and Intervention as well as campus counseling and mental health services are here and ready to help. CommunityEmployeesFacultyLatestPresidentStudents University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility",
    "University of Southern California Skip to Content Open Site Navigation / Menu Search We Are USC Back to Main Menu The University Back to The University The University USC is a constellation of schools, centers and institutes where some of the brightest minds are leading the way to the future of education. Leadership Faculty Values Facts and Stats Traditions Our History We Are Southern California Back to We Are Southern California We Are Southern California USC, L.A. and California's southland are inextricably linked. Our passion as a great private research university serves the public good across the city and throughout SoCal — advancing society and improving lives. Our Communities We Are Trojans We Are Connectors We Are Advancing Health We Are Global Back to We Are Global We Are Global Magnify your worldview and craft solutions to today's most complex global problems. USC is your launchpad to gain international perspective and grow global networks — both essential for modern careers. Global Engagement Global Presence Educating Global Leaders Academics Back to Main Menu Schools & Academic Units Back to Schools & Academic Units Letters, Arts and Sciences Accounting Advanced Computing Architecture Art and Design Arts, Technology, Business of Innovation Business Cinematic Arts Communication and Journalism Dance Dentistry Dramatic Arts Education Engineering Gerontology Law Medicine Music Occupational Therapy Pharmacy Physical Therapy Professional Studies Public Policy Social Work Explore Our Programs Back to Explore Our Programs Explore Our Programs Discover the academic programs at USC that match your passion and interests. With 23 schools and academic divisions, we offer a range of undergraduate, graduate and professional majors. Majors & Minors Graduate & Professional Postdoctoral Programs Pre-College Programs Undergraduate Study Back to Undergraduate Study Undergraduate Study At USC, one of the best colleges in the U.S., you'll work with leading experts and supportive faculty to build your path to success. Tap into USC's dynamic, global community as you embark on your world-class undergraduate study. Your First-Year Experience Interdisciplinary Freedom Global Experiences Advising & Support Graduate & Professional Study USC International Academy USC Online High School Summer Programs Libraries Academic Calendar Schedule of Classes Life at USC Back to Main Menu Living in L.A. Campus Life Back to Campus Life Campus Life USC offers an endless variety of activities and events for students to get involved in. From student-run clubs and organizations to exclusive film screenings and outdoor yoga, there is something for everyone on campus. Housing & Dining Student Organizations and Clubs Community Service USC Village Campus Safety Health and Well-being Research & Creativity Back to Main Menu Research & Innovation Back to Research & Innovation Research & Innovation USC engages in forward-looking, collaborative research with industries around the world to find unprecedented and much-needed solutions for some of the most complex issues facing humanity today. Student Research Faculty Research Research Resources Innovation Office of Research & Innovation Creative Expression Our Impact Back to Our Impact Our Impact At USC, we are defining conversations, influencing policy and creating a healthier and more sustainable future for all. Our students, faculty and alumni are making an impact in Los Angeles and around the world. Inventing Solutions Exploring Medical Frontiers Creating New Knowledge Admission & Aid Back to Main Menu Undergraduate Admission Graduate Admission Financial Aid Visit USC USC Athletics USC Patient Care MyUSC News Events Visit Apply Giving Employees Students Faculty Alumni Families Directories What are you looking for? Search: Search Suggested Searches Majors & Minors A Home for Computing’s Future USC celebrated the official opening of Dr. Allen and Charlotte Ginsburg Human-Centered Computation Hall last week. The new building is home to USC Viterbi’s Thomas Lord Department of Computer Science and the new USC School of Advanced Computing, and is central to USC President Carol Folt’s historic Frontiers of Computing “moonshot.” Story and photos in USC News Show more Information USC Photo/Steve Cohn Top Headlines Visit USC News Science/Technology Groundbreaking symposium explores the impact of AI on the arts A talk by renowned contemporary artist Cai Guo-Qiang and lunch cooked by robots were among the highlights of the provocative event at USC. Sep 19, 2024 Health Keck Hospital of USC named a 2024 top performer in leading quality and accountability study The hospital received a five-star rating — the highest possible — from Vizient Inc. for excellence in delivering high-quality care. Sep 18, 2024 University USC’s Latinx/e Heritage Month: A time to celebrate ‘agents of change’ Students and faculty share thoughts on this year’s theme and their hopes for the future. Sep 17, 2024 University New Trojans explore USC’s Student Equity and Inclusion Programs spaces A joint open house provides students with the opportunity to make new connections at start of their USC journey. Sep 9, 2024 University Updates Welcome Back Letter Greetings, guidance and policy updates. USC Resources Visit USC’s Resources page. Celebrating the New USC School of Architecture Dean Brett Steele, a former Bruin who led the UCLA School of the Arts and Architecture, receives an official Trojan welcome. Story and photos in USC News Celebrating 25 Years of the USC Institute for Creative Technologies Since its founding in 1999, the USC Institute for Creative Technologies has been at the forefront of research and development in AI, computer graphics, geospatial sciences, human performance, learning sciences, modeling, simulation and gaming, mixed reality, medical VR and more. An integral part of USC’s Frontiers of Computing initiative, ICT’s labs and groups are pushing the boundaries of what’s possible in computing, embodying the spirit of USC’s commitment to pioneering the future of technology. STORY AND VIDEO IN USC NEWS USC FRONTIERS OF COMPUTING Major Science and Technology Groups at ICT Select option to display slide Virtual Humans Affective Computing Vision and Graphics Simulation Mixed Reality Integration Environments Learning Sciences Body Computing Virtual Humans The ICT Virtual Human Toolkit is a set of tools and resources designed to help researchers and developers create realistic and engaging digital characters. Since 2009, this toolkit has been the foundation for all research at ICT on conversational AIs — computer programs that can interact with people like a human would. It has been used in various projects, including ELITE SHARP trainers and VITA. ICT Virtual Human Toolkit Affective Computing The Affective Computing Group focuses on understanding how emotions affect both human interactions and interactions between humans and machines. This includes studying how to automatically recognize emotions from different signals, creating computer models of how emotions develop and influence thinking, and applying these methods to improve teamwork between humans and machines, train people in social skills and expand knowledge about human emotions. Affective Computing Group Vision and Graphics Virtual characters are digital humans that can talk, move and interact, and they are important for entertainment, training and education. The main goal of the ICT Vision & Graphics Lab is to make these characters look as realistic as possible, including lighting them in a way that looks natural. To achieve this, the Vision & Graphics Lab uses its award-winning “Light Stage” technology, developed at ICT, to create high-quality visual details. The lab also works with major film companies like Sony Pictures Imageworks and WETA Digital. ICT Vision & Graphics Lab Simulation The Modeling and Simulation Group creates interactive and educational experiences to help train and support military personnel. They bring together researchers, experts, writers and game designers to make these experiences both interesting and useful. They’ve successfully handed over several of their advanced training tools to the U.S. Department of Defense, including a disaster simulation program and various strategic training games for the Naval Postgraduate School. Modeling and Simulation Group Mixed Reality A cognitive architecture is a proposed model of how a mind works, whether in people or machines. It focuses on the basic structures needed to create intelligent behavior and how these structures work with knowledge and skills to handle various complex situations. The aim of this project is to create a smart system that can support virtual humans and possibly intelligent robots, and ideally, help us better understand human thinking. Cognitive Architecture Integration Environments Rapid Integration & Development Environment is a key research and development platform that speeds up the development of simulation technologies for the Department of Defense. It quickly creates and tests new ideas for the Army’s Synthetic Training Environment and is now also used for various Navy and Air Force projects. Rapid Integration & Development Environment offers a shared space where researchers and developers can experiment with real-time modeling and simulation to see what’s possible. Rapid Integration & Development Environment Learning Sciences The ICT Learning Sciences group studies how AI can improve learning and help students achieve their goals. Its mission is to research and apply effective AI methods to make education better and fairer. It also focuses on creating tools that help teachers and content creators use AI to develop and adjust educational materials. It drives innovation through its research projects and two centers: the AI Research Center of Excellence for Education and the USC Center for Generative AI and Society. ICT Learning Sciences Group Body Computing The Body Computing & Human Performance Lab is a research center focused on improving health, wellness and human performance using digital tools and data. It aims to create better health resources for both service members and the general public. The lab brings together experts in human performance, digital technology and healthcare, including sensor and app developers, strategists and designers. They work together to test and develop new technologies that enhance health and performance. Body Computing & Human Performance Lab We’re Thinking B1G Sept. 1 marked the start of USC’s first football season as a member of the Big Ten Conference. It’s a change that reaches far beyond athletics, bringing new opportunities in the research lab, the classroom, the libraries and more. Our new video looks at what USC brings to the conference — and why this is going to be big. In Focus: USC’s Art Schools Select option to display slide USC Kaufman School of Dance USC Roski School of Art and Design USC School of Architecture USC School of Cinematic Arts USC School of Dramatic Arts USC Thornton School of Music USC Kaufman School of Dance Established in 2012, the USC Kaufman School of Dance embodies the power of artistic innovation and dedication. Through its cutting-edge research and innovative dance education, the school cultivates a profound passion for dance while preparing the next generation of dancers, choreographers and leaders in the industry. By fostering a spirit of interdisciplinary learning and collaboration with renowned artists, the program propels its students toward success and empowers them to make a lasting impact on the dance world. Learn more USC Roski School of Art and Design The mission of USC Roski School of Art and Design is to enrich the dynamic research and creative communities of USC, Los Angeles and beyond. By providing an immersive studio curriculum rooted in historical and critical discourse, the USC Roski School aims to foster creativity and cultivate the analytical thinking skills necessary for artists and designers in the 21st century. Programs are designed to challenge students to illuminate, question and reshape how we perceive ourselves and the world around us. Faculty and students collaborate to explore innovative hybrid forms of art, design and critical studies, collaboratively envisioning and shaping the future. Learn more USC School of Architecture The USC School of Architecture is a dynamic hub dedicated to educating and motivating future architects to confront challenges and create design solutions that envision a brighter built environment. USC architecture faculty and alumni have pushed the limits to introduce groundbreaking practices for over a century. Located in Los Angeles and connected to worldwide concerns, USC architects and academics work with communities to gain understanding and become adept and bold professionals who generate innovative solutions. Learn more USC School of Cinematic Arts For almost a century, the USC School of Cinematic Arts has been a launching pad for visionary talent in cinema, television and new media. Since its founding in 1929, the school has combined cinematic theory with hands-on practice, preparing graduates for success in the entertainment industry. Our programs attract creative minds worldwide, providing a unique opportunity to explore and expand artistic potential in Los Angeles — the world’s entertainment capital. Taught by industry leaders and academic experts, the USC School of Cinematic Arts curriculum challenges students to refine their vision and contribute to a lasting artistic tradition. Learn more USC School of Dramatic Arts The USC School of Dramatic Arts believes in empowering artist-scholars to redefine the future of entertainment. Its dedicated faculty from the industry and exceptional production opportunities in Los Angeles equip our students with hands-on experience to forge successful careers. Our unwavering commitment to professional growth and programs such as the Institute for Theatre & Social Change cultivate empathetic and innovative storytellers prepared to confront the world’s obstacles. Learn more USC Thornton School of Music Established in 1884, the USC Thornton School of Music inspires musical excellence and collaboration, blending the rigorous training of a conservatory with the depth of a top research university. Our world-class faculty and diverse programs, including early music, popular music, orchestral performance, screen scoring, jazz, composition and the music industry, provide students with the tools to pursue their passions. USC Thornton opens doors to exceptional career-building opportunities, nurturing the next generation of musical talent. Learn more Around the University economics research Capitalism, Dreams and Nightmares: ﻿Have Economists Broken the World? Nobel Laureate Angus Deaton is a USC Presidential Scholar-in-Residence, a Distinguished Scholar at the USC Schaeffer Institute for Public Policy & Government Service and a Presidential Professor of Economics at USC Dornsife. The seminar will explore how flaws in modern capitalism impact society, including rising mortality rates, despair and economic inequality. Deaton is a leading voice in economics whose research has helped shape our understanding of social determinants of health, poverty and inequality in the U.S. and worldwide. Hosted by the USC Schaeffer Center for Health Policy & Economics in partnership with the USC Dornsife Department of Economics. Tuesday, Sept. 24, 2-3:30 p.m. annual traditions Trojan Family Weekend This annual celebration offers families the chance to visit their students and experience firsthand how the campus community excels in teaching, research, academics, athletics, the arts and public service. Trojan Family Weekend features over 200 unique programs, including lectures by award-winning faculty, open houses showcasing USC’s exceptional resources, and a pre-game pep rally with the USC Trojan Marching Band. There’s something special for every family member to enjoy. The event begins Thursday morning with an opening ceremony, followed by activities, programs, tours, workshops and lectures that continue throughout the weekend. The celebration concludes on Saturday with the Trojan Family Weekend tailgate before the USC-Wisconsin football game, with final sessions wrapping up on Sunday. Sept. 26-29 View this post on Instagram A post shared by USC Marshall School of Business (@uscmarshall) USC Event Calendar Thinking about USC? Explore Our Programs Visit USC University Park Campus (Map) 213-740-2311 Health Sciences Campus (Map) 323-442-2000 Tommy Cam Hecuba Cam About USC Office of the President Office of the Provost Policies and Core Documents Sustainability Economic Impact Patient Care USC Student Health Keck Medicine of USC Request an Appointment Medical Services and Programs Find a Provider Hospital and Clinic Locations Quick Links Campus Events Campus Safety Careers at USC Commitment to Change How to Access Campus Pressroom Privacy Notice Notice of Non-Discrimination Digital Accessibility Smoke-Free Policy Copyright © 2024 University of Southern California",
    "Safety at USC Skip to content USC Website Toggle search interface Search Search Site Close search interface Menu Toggle extended navigation ONE USC Safety AboutToggle \"About\" dropdown Informational Reports Safety TipsToggle \"Safety Tips\" dropdown Safety Tips Consejos de seguridad 安全贴士Toggle \"安全贴士\" dropdown 夜间安全 Protecting Your Privacy Scooters, Skateboards, and Bikes Beware of Scams Mobile App Support ResourcesToggle \"Support Resources\" dropdown Support Resources: Students and Employees Drugs and Naloxone Student Mental Health & Crisis Intervention Hospitalizations for Mental Health Care For Faculty: Supporting Students MHART Emergency PreparednessToggle \"Emergency Preparedness\" dropdown City-wide alerts Earthquake Alerts Hands-only CPR: Trojan “Heart Heroes” Active Shooter Protocols: What Should I Do? ServicesToggle \"Services\" dropdown USC Lyft Ride Program USC TrojansAlert News & Events Contact Leadership More Menu Toggle extended navigation Updates Regional Advisory: Dengue FeverThe Los Angeles County Department of Public Health has confirmed 3 cases of locally acquired dengue. These residents had no history of travel to places where dengue is common prior to their symptoms. The risk of widespread transmission in LA County remains low, but Public Health is closely monitoring the situation. Cases of locally acquired dengue are very rare in LA County. The best way to prevent getting dengue is to avoid mosquito bites. Learn more from LA County Dept. of Public Health. …Continue Reading Regional Advisory: Dengue Fever Digital Scams: We Are SC—Scam ConsciousThere are many scams that criminals use to cheat people or gain control over their lives. Often this might start with a phone call, text/chat message, or email. It might even start with a simple “wrong number” message, to get you to respond. If someone pressures or threatens you with demands to send immediate payment — wire transfer, cryptocurrency, gift cards — this is a sign of a scam. …Continue Reading Digital Scams: We Are SC—Scam Conscious Protecting your privacy, and increasing your safety knowledge against scamsLearn about how to avoid fraud via gift card scams, phishing scams, and even doxxing with helpful TrojanSecure…Continue Reading Protecting your privacy, and increasing your safety knowledge against scams Who to Call 24 hour assistance or to report a crime UPC: 213-740-4321 HSC: 323-442-1000 Updates on emergencies Emergency.usc.edu Emergency infoline: 213-740-9233 Mobile Safety App ONE Safety Offices on Campus USC Environmental Health and Safety USC Fire Safety and Emergency Planning USC Department of Public Safety Resource Offices on Campus Campus Support and Intervention A non-emergency resource office that includes Trojans Care for Trojans (if you have a concern for a USC friend or colleague); threat assessment; management of health-related leaves of absence. Available during business hours, 213-740-0411, uscsupport@usc.edu. Confidential Advocates for Students Through USC Student Health, 24/7 access to confidential advocates (for students who have experienced sexual assault, stalking, intimate partner violence, or any sexual/gender-based harm). Call 24/7, 213-740-9355 (WELL) to reach a confidential advocate, counselor, or advice nurse. Counseling and Mental Health for Students Through USC Student Health, 247/ access to a counselor. Call 24/7, 213-740-9355 (WELL) to reach a confidential advocate, counselor, or advice nurse. The nation 9-8-8 hotline number is also a resource for anyone experiencing emotional crisis or thoughts of self-harm, as is the Crisis Text Line. Erroll Southers on Safety at USC Leading on Safety Dr. Erroll G. Southers is an internationally recognized expert on counterterrorism, public safety, infrastructure protection, and homeland security. He is the University of Southern California Associate Senior Vice President of Safety and Risk Assurance. He is also a member of the Los Angeles Board of Police Commissioners, as well as the California Commission on the State of Hate. Connect View this profile on Instagram USC Dept of Public Safety (@uscdps) • Instagram photos and videos Learn Scooter Safety We all need to take Scooter Safety seriously on campus walkways, on sidewalks, and navigating side streets. Follow a few simple tips when using a scooter and enjoy the ride! The ONE USC Safety Vision imagines a USC where everyone feels safe, respected and protected from crime, while recognizing that this can be achieved only by addressing the diverse experiences and needs of all USC students, faculty, staff and neighbors. University of Southern California Privacy Notice Notice of Non-Discrimination Digital Accessibility Close Menu Search Search Site AboutToggle \"About\" submenu Informational Reports Safety TipsToggle \"Safety Tips\" submenu Safety Tips Consejos de seguridad 安全贴士 Protecting Your Privacy Scooters, Skateboards, and Bikes Beware of Scams Mobile App Support ResourcesToggle \"Support Resources\" submenu Support Resources: Students and Employees Drugs and Naloxone Student Mental Health & Crisis Intervention Hospitalizations for Mental Health Care For Faculty: Supporting Students MHART Emergency PreparednessToggle \"Emergency Preparedness\" submenu City-wide alerts Earthquake Alerts Hands-only CPR: Trojan “Heart Heroes” Active Shooter Protocols: What Should I Do? ServicesToggle \"Services\" submenu USC Lyft Ride Program USC TrojansAlert News & Events Contact Leadership",
    "Campus Update - Office of the President Skip to main content Go to usc.edu homepage USC Monogram Office of the President MenuAn icon that consists of three parallel horizontal lines suggestive of a list. Home Biography From the PresidentShow submenu for From the President Community Messages Speeches Conversations Contact Presidential Working GroupsShow submenu for Presidential Working Groups Racial Equity, Diversity, and Inclusion (REDI) Presidential Working Group on Sustainability in Education, Research, and Operations Student-Athlete Experience Task Force Department of Public Safety Community Advisory Board (CAB) Interfraternity Council Culture, Prevention, and Accountability More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Campus Update May 5, 2024 Dear Trojan Family, I am writing to let you know that early this morning DPS, with the assistance of the LAPD, removed the occupiers who had rebuilt their illegal encampment in Alumni Park. The operation was peaceful. Campus is opening, students are returning to prepare for finals, and commencement set-up is in full swing. Over the last few weeks, the university exercised patience and restraint as we worked to de-escalate a volatile situation. We’ve spoken to the occupiers daily, issued repeated warnings, and offered opportunities and locations for them to protest lawfully. We’ve supported their right to express strong opinions and passions for their cause, as always. Yet when free speech protests devolve into illegal occupations, violating the rights of others, we must draw a line. The occupiers repeatedly chose to ignore university policies designed to benefit everyone, and to break the law. We needed to act quickly to protect the rights of our 80,000 students, staff, and faculty. We are in the critical period from the end-of-term quiet study week, through finals and our commencement ceremonies. Despite our efforts to de-escalate, the occupation was spiraling in a dangerous direction over the last several days. Areas of campus were blocked, people walking down Trousdale, our main thoroughfare, were harassed, and iconic Trojan symbols were defaced. In addition, university property was stolen, and commencement structures were dismantled. Residence halls, campus throughfares, and libraries had become places of confrontation. Some finals were disrupted with noise and chanting during mandated quiet periods. Yesterday afternoon, outside agitators jumped the perimeter fencing and assaulted our officers. This had to stop. With no resolution in sight, I requested the LAPD to assist DPS in removing the encampment as peacefully and safely as possible. At 4:10 a.m., an order to disperse was issued, providing the trespassers one last opportunity to leave voluntarily. In 64 minutes, the encampment was abandoned and cleared. The operation was peaceful with no arrests. We will not tolerate illegal encampments of any kind at USC. Over the last week, we methodically and carefully executed on our strategy. My goals were to prioritize safety and return our campus and our surrounding community to normalcy. We were determined to ensure our students could finish their exams without further disruption and that USC could host the commencement celebrations our graduates have worked hard to earn. As I shared with the Trojan Family last Friday, freedom of speech is central to who we are as a university and is at the core of our democratic society. USC is home to 47,000 students with many different perspectives, and our policies are designed in a manner that allows people to express those opinions. In closing, I thank DPS and the LAPD for their swift action, professionalism, and concern for our students. I also thank the Trojan community and our neighbors for your patience as we navigate these challenging times. Respectfully yours, Carol L. FoltPresident USC Office of the President Los Angeles, CA 90089-0012 (213) 740-2111 president@usc.edu University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility InstagramInstagramThe logo for the social media platform Instagram. XXThe logo for the social media platform X.",
    "Alerts Archives - Department of Public Safety Skip to main contentSkip to secondary content Go to usc.edu homepage USC Monogram Department of Public Safety MenuAn icon that consists of three parallel horizontal lines suggestive of a list. AboutShow submenu for About Chief’s Message Executive Staff Types of Officers Frequently Asked Questions ServicesShow submenu for Services After Hours Visitor Registration LAX Airport Shuttle Reservation Alarms Bicycle, Scooter, and Skateboard Registration CCTV Video Request Automated License Plate Recognition System (ALPR) Emergency Blue Light Phones Health & Wellness Resources Lost and Found LiveSafe Mobile Safety App Patrol Areas Property Identification Engraving Request Report Copy Safety Training Secure Parking During Semester Breaks TrojansAlert USC Events Permit Application Security Assessment Self-defense Classes Safety TipsShow submenu for Safety Tips Be Aware of Scams Getting Around Campus Safely Hosting Social Events Jogging Safety Moving Out and Traveling Sexual Assault and Violence Suspicious Activity & ConfrontationsShow submenu for Suspicious Activity & Confrontations What to Do During a Robbery Panhandling Theft PreventionShow submenu for Theft Prevention Laptop Theft Prevention and Recovery Clery & Crime AlertsShow submenu for Clery & Crime Alerts Campus Security Authorities Clery RequirementsShow submenu for Clery Requirements Clery On-Campus Map Clery Crimes and Definitions Alerts Daily Crime & Fire Log Annual Security Report Community OutreachShow submenu for Community Outreach Cadet Program Safety Presentations ContactShow submenu for Contact Give Feedback Report a Crime Join DPS Get Connected More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Category: Alerts Sexual Battery/Fondling Published September 4, 2024 Last Updated September 4, 2024, 8:12 am Incident Description: The two victims were walking on the sidewalk of West 37th Place. The suspect approached from behind them and grabbed the buttocks of both victims. The suspect then ran away eastbound on 37th Place. The victims lost sight of him in the area of 37th Place and Catalina Street. Content warning: this warning addresses… Robbery Published August 22, 2024 Last Updated August 22, 2024, 5:35 pm Incident Description: The victim was walking on the sidewalk when the suspect drove past and yelled at him. The suspect then stopped, exited his vehicle and approached the victim. The suspect placed his hand in his waistband, simulating a weapon. The suspect demanded the victim’s neck chain, then attempted to pull it off the victim’s neck.… Battery Published August 19, 2024 Last Updated August 19, 2024, 6:58 pm Incident Description: The victim was walking in the hallway on an upper floor of her apartment complex. The suspect, who did not appear to be a resident of the complex, grabbed the victim by her shoulder and her wrist. He began yelling at the victim in a foreign language, possibly Spanish. A witness assisted the victim… Robbery Published August 5, 2024 Last Updated August 5, 2024, 7:18 pm Incident Description: Three victims were on the south sidewalk of Jefferson Boulevard at Royal Street. The two suspects approached the victims and demanded their property. The suspects then attempted to take the property by force. A struggle resulted and the suspects were able to take several items of property. The suspects ran back to the suspect… Robbery Published August 2, 2024 Last Updated August 2, 2024, 8:21 am Incident Description: The victim was walking on the sidewalk when the suspect confronted him and demanded his Airpods. The victim gave him the Airpods. The victim continued walking and the suspect followed him. When the victim arrived at his residence, the suspect asked him if he had anything else. The victim got the suspect a bag… Lewd Conduct Published July 22, 2024 Last Updated July 22, 2024, 9:23 am Incident Description: The victim was walking on the sidewalk when she noticed the suspect standing in the front yard of a residence. The suspect reached into his pants and began masturbating. The victim left and contacted a nearby witness. The victim and the witness returned to the area of the crime and saw the suspect leaving… Burglary Published July 17, 2024 Last Updated July 17, 2024, 5:56 pm Incident Description: The suspect entered a private residence and stole an E scooter. The suspect was last seen leaving the residence toward the alley. Reported Offense: Burglary Date & Time of Occurrence: 07/15/2024 12:27 AM Location: 700 block, West 28th Street Report Number: 2402488 Vehicle Description: The E scooter is described as a Ninebot, gray with orange high lights on the… Aggravated Assault Published June 25, 2024 Last Updated June 25, 2024, 7:27 am Incident Description: The victim was waiting on the Metro platform when the suspect walked past her swinging his arms. He stopped and punched her in the face without provocation. The suspect was last seen walking southbound on Vermont Avenue from Exposition Boulevard. Reported Offense: Aggravated Assault Date & Time of Occurrence: 06/24/2024 2:20 PM Location: Exposition Boulevard and Vermont… Burglary Published June 23, 2024 Last Updated June 23, 2024, 10:12 pm Incident Description: The suspect entered the victims’ home through an unlocked door or window while the victims were inside. The suspect left the location without taking any property. The suspect was last seen heading southbound towards the alley behind the Row. Students and community members are encouraged to lock their doors and windows to prevent such… Robbery Published June 1, 2024 Last Updated June 1, 2024, 10:49 pm Incident Description: The victim attempted to stop the suspect that had just stolen a box of Modelo beer. The suspect sprayed the victim in the face with pepper spray. The suspect was last seen going northbound on Hoover Street. Reported Offense: Robbery Date & Time of Occurrence: 06/01/2024 7:48 p.m. Location: Target Express located at 3131 Hoover Street Report… Posts navigation Older posts RELATED WEBSITES USC SafetyFire Safety and Emergency PlanningEnvironmental Health & SafetyParking Tickets (USC Transportation)Diversity at USCDPS EmploymentCampus Events Permit USC EMERGENCY INFORMATION Current Status EMERGENCY PHONE NUMBERS For 24 hour emergency assistance or to report a crime:UPC: 213-740-4321HSC: 323-442-1000 NON-EMERGENCY PHONE NUMBERS For 24 hour non-emergency assistance or information:UPC: 213-740-6000HSC: 323-442-1200 University of Southern CaliforniaContent managed by Department of Public SafetyPrivacy Notice Notice of Non-Discrimination Digital Accessibility X (Formerly Twitter)XThe logo for the social media platform X. FacebookFacebookThe logo for the social media platform Facebook. InstagramInstagramThe logo for the social media platform Instagram.",
    "Western Region Summit on Antisemitism in Higher Education - Office of the President Skip to main content Go to usc.edu homepage USC Monogram Office of the President MenuAn icon that consists of three parallel horizontal lines suggestive of a list. Home Biography From the PresidentShow submenu for From the President Community Messages Speeches Conversations Contact Presidential Working GroupsShow submenu for Presidential Working Groups Racial Equity, Diversity, and Inclusion (REDI) Presidential Working Group on Sustainability in Education, Research, and Operations Student-Athlete Experience Task Force Department of Public Safety Community Advisory Board (CAB) Interfraternity Council Culture, Prevention, and Accountability More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Western Region Summit on Antisemitism in Higher Education November 6, 2023 Thank you – and welcome, everyone. It’s a privilege to greet you on behalf of USC to the Western Region Summit on Antisemitism in Higher Education. Tomorrow marks one month since the horrific October 7 terrorist attacks by Hamas in Israel. I ask that we take a moment to remember family and loved ones who have been killed – and hold close all who have suffered, are still suffering, and are being held hostage right now. *** I’m sure you remember the moment when you first learned of these horrendous terrorist attacks. For me, it was Saturday morning, after I had just celebrated a beautiful Shabbat dinner with Rabbi Dov Wagner, his wife Runya, and hundreds of students and their families. The shock was profound, and from that moment, like so many of you, all I could think of was how shattering it was to so many people. As president of USC, I immediately wanted to reach out to our community and campus leaders, to increase safety, ensure support for grieving and terrified students, faculty, and staff, and get everyone ready for what might be ahead. My team felt the same. We quickly activated and enhanced our special religious security forces, and began reaching out to our students, working with deans and faculty, increasing mental health services, talking to our boards and our legislative officials. And from that moment, we have not, nor will we, let up. We meet every day to prepare, share notes, improve, adjust, and do our best to help our community. And we want – indeed must – do even more. Being together with all of you to discuss antisemitism on our nation’s campuses could not come at a more critical time. This summit is a beacon to help us face these profound issues with the urgency we feel, and at the very moment we need it most. *** I have many thank yous: starting with Hillel International, and the Jewish Federation for organizing us. Thank you to Adam Lehman, president and CEO of Hillel International; and to Rabbi Noah Farkas, president and CEO of the Jewish Federation of Greater Los Angeles. I also want to thank the many Jewish leaders in LA and around the world who’ve offered their counsel and support. And my special thanks to USC’s Dean of Religious Life, Varun Soni, and Dave Cohn, executive director of USC Hillel, for helping to create and shape this important summit. *** In 2022, NYU hosted its Summit on Antisemitism. And USC was honored when asked to host this year’s conference. Even then, we were seeing a troubling and unacceptable rise in antisemitism. And these incidences may have surged as much as 400 percent across the country (and on some college campuses) since the horrific terrorist attacks. The Anti-Defamation League (ADL) has reported that one-third of Jewish students experience antisemitism on their college campus each year. Clearly, we’re facing a crisis. *** I speak regularly with our students and community members about their grief, anger, and fear. Please let me be clear: USC unequivocally denounces acts of antisemitism, discrimination, hate, and violence. But our communities want more than words, they want action. While much of the turmoil being reported elsewhere is not occurring at USC, we must work tirelessly to keep it that way. As an American university, the freedom to speak, to disagree, and even to peaceably protest is at the core of our academic mission. But freedom of expression should never be used as an excuse for sacrificing student safety. Academic freedom, safety, and well-being are not mutually exclusive. And it’s up to all of us to foster learning environments where free inquiry and expression are protected, while at the same time being very clear as a community about our expectations for civil and respectful discourse. We have doubled down on our safety protocols – and work closely with our threat office and law enforcement. We’re also working around the clock to listen to students and community members about their experiences. You’re here because you, too, have been listening to your communities. *** In early 2022, I met with students at USC Hillel in the aftermath of several hateful social media posts rocking our community. They shared with me how they often experience expressions of anti-Zionism as antisemitism. We had a wonderful conversation about how USC could better support our Jewish students, and I took their advice. I convened our first Advisory Committee on Jewish Life, bringing together students, faculty, staff, Dave Cohn, Rabbi Dov, and many community members, including the Anti-Defamation League (ADL), the Jewish Federation of LA, the American Jewish Committee (AJC) and Academic Engagement Network (AEN), and of course, Hillel International, among others – all led by Dean Soni. I embraced all their recommendations, and work to complete them is underway. These are so powerful that I urge other universities to adopt them as well: To start, we added examples of antisemitism specifically to our required anti-discrimination training for new faculty, students, and staff. We also established a standing advisory committee to address emerging issues of antisemitism and support Jewish life. We’re making accommodations for Jewish holidays, adding Kosher food, assessing our policies for political speech, and much more. *** My many visits with our Jewish community have taught me something I think many of you already know: how well our campuses persevere in challenging times is largely determined in the weeks, months, or even years before traumatic events like we’re now experiencing. Trust is determined by a legacy of support and listening, by making services available, and by taking action. While certainly not perfect, USC has a long history of taking action, and I’d like to take a minute to point out a few that might be relevant to the conversations ahead. First, USC has a strong, vibrant community of more than 4,000 Jewish students and importantly, a 50-year history of excellent academic programs in Jewish studies. And we just signed an agreement with Hebrew Union College for another 25 years of shared education in Jewish history, culture, and traditions. Second, our students also have incredible support through the Office of Religious and Spiritual Life, and in Hillel and Chabad. Just a few weeks ago, Rabbi Dov and Runya hosted “Shabbat 1000.” It began back in 2007 as “Shabbat 300” – with the goal of hosting 300 students. As you can guess, more than 1,200 students attended the most recent dinner – it’s so well-attended now, they have to hold it outside on Severance Street, just a few blocks from UPC! Third, USC supports vitally important global research centers in Jewish history and contemporary culture, including: The Shoah Foundation, under Director Rob Williams, which joined the USC community almost 20 years ago and catalogues approximately 55,000 Holocaust testimonies. The Casden Institute for the Study of the Jewish Role in American Life, founded in 1998, under Director and Distinguished Professor Steve Ross. And the Center for Advanced Genocide Research, established in 2014, under its founding director, Dr. Wolf Gruner. And fourth, we also have a recent history of acting to correct wrongs, like when we removed the names of Rufus von KleinSmid from an iconic USC building, and Dean Cromwell from our Track & Field facility, because of their history of antisemitism and racial prejudice. *** I believe the world needs its great universities to reject antisemitism, foster understanding, and reject hate, intolerance, and all forms of prejudice. And we need our educators to communicate values – and act on them – to ensure our students, faculty, and staff are safe, welcomed, and supported. Antisemitism is a global crisis. We must work together to combat it. It’s my honor to be here, and I thank you for entrusting USC to host this important event. *** Finally, I would like to invite you to take a photo of the QR code you see behind me. This will lead you to USC’s “Network of Informational and Support Resources in Times of Conflict.” Here, you’ll find the most up-to-date resources, reassurances, and answers – with the aim to help you navigate life on our campuses during these times. USC Office of the President Los Angeles, CA 90089-0012 (213) 740-2111 president@usc.edu University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility InstagramInstagramThe logo for the social media platform Instagram. XXThe logo for the social media platform X.",
    "Addressing Antisemitism - We Are SC Skip to main content Go to usc.edu homepage USC Monogram We Are SC MenuAn icon that consists of three parallel horizontal lines suggestive of a list. We Are SC Stories Happening NowShow submenu for Happening Now Trojan Welcome Experience Heritage Months at USC ONE USC Safety USC Frontiers of Computing Campus ResourcesShow submenu for Campus Resources Student Resources Faculty and Staff Resources Care for our Community Alumni Health and SafetyShow submenu for Health and Safety Campus Safety COVID-19 Daily Digest COVID-19 Resource Center Emergency Safety Mobile App Student Health Commitment to ChangeShow submenu for Commitment to Change USC Culture Journey Human Resources Design for the Future Public Safety Community Advisory Board Addressing AntisemitismShow submenu for Addressing Antisemitism Messages Frequently Asked Questions Advisory Committee on Jewish Life at USC Advisory Committee on Muslim Life at USC University Messages More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. HomeAddressing Antisemitism Addressing Antisemitism President Folt and the USC Board of Trustees have publicly and unequivocally denounced antisemitism in all its forms and are committed to creating an environment which is safe for our Jewish community. The university is actively working to strengthen the Jewish community at USC and to ensure that our campus is free of hate speech, including antisemitism and all forms of anti-Jewish hate. “USC unequivocally condemns calls for the genocide of Jews and any other peoples. These are antithetical to our values. We investigate any threat, harassment, or incitements of violence as a violation of our policies.” 12/11/2023 This site serves as a one-source guide for messages, FAQs, resources and links related to the university’s efforts to combat antisemitism. Messages Frequently Asked Questions Advisory Committee on Jewish Life at USC Federal Actions to Address Antisemitism and Islamophobia on University Campuses Resources University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility",
    "News & Announcements - USC Transportation Search Box Submit search-form-66f5836b07182 FAQ Feedback Contact Show navigation Hide navigation About Us News & Information Campus Access Student Transportation Fee Hours & Maps USC Gas Station Partners & Discounts Advertise With Us Report a Maintenance Issue Driving Defensively Sustainability Website Hot Links Contact Us Getting Around USC Lyft Navigating with a Disability DART Zipcar Enterprise Car Rentals Commuting & Transit Traveler Commuter Cost Calculator USC Employee Transit Subsidy Guaranteed Ride Home USC Student U-Pass Program Metrolink Student Pass Amtrak San Joaquins USC Bike Program USC Buses Map & Schedules Track a Bus Bus Rules Bus Rentals Download the App Parking Access My Account Department Reservations Internal Services Delivery (ISD) Permit Parking Daily and Hourly Parking Parking Rates EV Program Carpool Rules Citations Pay Online Appeal a Citation Existing Appeal Status Parking Violations Rules Connect With Us Contact Facebook Feedback search for: Search Submit Button About Us News & Information Campus Access Student Transportation Fee Hours & Maps USC Gas Station Partners & Discounts Advertise With Us Report a Maintenance Issue Driving Defensively Sustainability Website Hot Links Contact Us Getting Around USC Lyft Navigating with a Disability DART Zipcar Enterprise Car Rentals Commuting & Transit Traveler Commuter Cost Calculator USC Employee Transit Subsidy Guaranteed Ride Home USC Student U-Pass Program Metrolink Student Pass Amtrak San Joaquins USC Bike Program USC Buses Map & Schedules Track a Bus Bus Rules Bus Rentals Download the App Parking Access My Account Department Reservations Internal Services Delivery (ISD) Permit Parking Daily and Hourly Parking Parking Rates EV Program Carpool Rules Citations Pay Online Appeal a Citation Existing Appeal Status Parking Violations Rules Connect With Us Contact Facebook Feedback FAQ Feedback Contact permits-and-reservations About UsNews & InformationCampus AccessStudent Transportation FeeHours & MapsUSC Gas StationPartners & DiscountsAdvertise With UsReport a Maintenance IssueDriving DefensivelySustainabilityWebsite Hot LinksContact Us News & Announcements Please read on for the latest news and announcements from USC Transportation: NEW! Downey Vehicle Entrance Closure (posted 9/13/2024) Due to set-up and tear down for the ceremony celebrating the grand opening of Ginsburg Hall, the Downey Way Vehicle Entrance will be closed to all vehicular traffic on Monday 9/16 starting at 10:00am. Pedestrian access will remain open during the operational hours 6:00AM – 8:00PM /Mon-Fri The Ginsburg Hall Ribbon Cutting Ceremony is scheduled at 11:00AM on Tuesday 9/17/2024. The vehicle entrance will remain closed all day on Tuesday, and reopen to all vehicle traffic on Wednesday 9/18/2024. Please use the Watt Way or McClintock Ave. Vehicle Entrances Monday after 10:00am and all day Tuesday during this closure. Thank you. Labor Day Reminders (posted 8/23/2024) Monday, September 2 is an official USC Holiday in observance of Labor Day. Please note the following service announcements for Monday: Both the UPC (McCarthy Structure) and HSC (KAM-120) customer service centers will be closed on Monday. They will reopen at their normal hours on Tuesday, September 3. Office hours and locations are posted online here: https://transnet.usc.edu/index.php/contact-us/ All USC bus services will be inoperative on Monday, and will return to service on Tuesday, September 3. The Fall Bus schedule is now posted online here: https://transnet.usc.edu/index.php/bus-map-schedules/ As a reminder, campus vehicle Entrances other than McCarthy and McClintock are closed on weekends and Holidays. All pedestrian access points remain available 24/7 for USC faculty, staff and students (with USCID), registered guests (with QR code), or unregistered visitors (with government-issued photo ID). Pedestrian access points can be found on the Campus Access Map here: https://transnet.usc.edu/wp-content/uploads/2024/08/Fall-2024-Access-map.pdf The USC Lyft program is not impacted in any way by the holiday. Students who have not yet registered for the program can read all about it and apply online here: https://transnet.usc.edu/index.php/how-to-use-lyft/ Fall 2024 Services Announcements (posted 8/16/2024) USC LYFT RIDES PROGRAM The USC Lyft Rides program returns this Fall, with no changes from last Spring. Invitations to join the Fall program will be emailed to all students beginning Tuesday, August 20. Do not share your invitation with others, doing so will deactivate your account. If you do not receive an invitation, please request one here after the 20th. IMPORTANT REMINDERS: The USC Lyft Rides program runs on credits that automatically renew every month. USC does not pay cancellations fees, tips or PrimeTime upcharges. If your ride starts and ends within the appropriate campus geofence and in all other ways qualifies for the program, it will say “FREE” in the fare quote box. Complete program details are available here. Hours of operation: UPC: 6:00pm – 2:00am, seven days a week NOTE: These hours may change due to home football games and other special events. Changes will be announced via email and on our News & Announcements page. HSC: 5:00pm – 2:00am, Monday – Friday Boundaries: The UPC program covers rides within the area east of Normandie Ave, south of Washington Blvd, west of Main St, and north of Martin Luther King Blvd. Rides that start or end outside of those strict boundaries are NOT covered by the USC Lyft program and are NOT free. FALL PARKING PERMITS AVAILABLE ONLINE Students can still purchase available parking permits on the USC Transportation website. Click the “Access my Account” link under the “Parking” header and follow the prompts. NOTE: All interested students need to purchase a new permit. Do not choose the “Renew” option, click “Get Permit” instead. If the location you want is not listed, it is sold out or otherwise unavailable; please select from the location options listed. U-PASS PROGRAM USC students have the opportunity to ride all Metro buses, trains, and partner agencies through the U-Pass program! Visit the U-Pass page to learn all about the pass and apply for it through our Purchase Portal. NOTE: Due to USC 2FA processes, please create a new account if you do not already have one (don’t register as a guest); the instructions posted online assume you are creating an account for both current and future use. USC BUSES FALL SCHEDULE NOW AVAILABLE The Fall USC Bus schedule will be available online on August 20. Please visit our Bus Map & Schedules page for details and a printable schedule. FOOTBALL GAME DAYS PARKING REMINDER We anticipate a very busy and exciting football season ahead! You can use your USC parking permit on game days but access to your usual facility is not guaranteed; you may be re-directed to an alternate location, depending on structure availability at the time. Review the “Where Can I Park?” guide to double check where your permit is valid on game days. Please plan to arrive early or leave your car at home and take Metro! McClintock Entrance FULL CLOSURE / Downey Entrance reopening (posted 8/2) The McClintock Entrance will be COMPLETELY closed, to both vehicles and pedestrians, on Monday, August 12, between 5:00am-5:00pm due to construction. Please use alternate campus entrances at Downey Way and Watt Way for vehicles, and at Watt Way/Jefferson Blvd. for pedestrians. The Watt Way pedestrian entrance will be open from 6:00am-7:00pm. Please see this pdf for the construction/closure notice. As mentioned above, the Downey Entrance is expected to be completely re-opened to vehicle and pedestrian traffic from 6:00am-8:00pm, M-F, starting on Friday, August 9, and will be fully operational during the McClintock one-day closure on August 12. Thank you for your patience during construction of Ginsburg Hall; please let us know if you have any questions. Independence Day Reminders (posted 6/26) Thursday and Friday, July 4-5 are official USC Holidays in observance of Independence Day. Please note the following service changes for both days: All customer service centers will close at 3:00pm on Wednesday, July 3, and remain closed on Thursday and Friday. They will reopen at their normal hours on Monday, July 8. All USC bus services will be inoperative on Thursday and Friday, and will return to service on Monday, July 8. As a reminder, the Watt Way Entrance is not available on weekends or Holidays. As such, it will not be available for campus ingress or egress on Thursday or Friday, but will return to normal hours on Monday, July 8. The McCarthy and McClintock Entrances remain open 24/7. The USC Lyft program is not impacted in any way by the holiday. Memorial Day Reminders (posted 5/20) Monday, May 27 is Memorial Day, an official USC Holiday. Please note the following service changes for that day: All customer service centers will close at 2:00pm on Friday, May 24, all day on Monday, and will reopen at their normal hours on Tuesday, May 28. All USC bus services will be inoperative on Monday, and will return to service on Tuesday, May 28. As a reminder, the Watt Way Entrance is only available M-F, and is not available on weekends or Holidays. As such, it will not be available for campus ingress or egress on Monday, but will return to normal hours on Tuesday, May 28th. McCarthy and McClintock Entrances are open 24/7. Campus Access Update (posted 5/16) To view the latest announcement from USC Senior Administration regarding campus access, please click here. Summary: If you are arriving by car, public transit, or on foot, please note access at the following entrances: McCarthy Way & Figueroa St. – vehicles and pedestrians (open 24/7) McClintock St. and Jefferson Blvd. – vehicles and pedestrians (open 24/7) Watt Way & Exposition Blvd. – vehicles and pedestrians (open 6 a.m.-7 p.m., Monday-Friday. Please note that 37th St. is closed due to construction.) Student, staff, and faculty ID cards will continue to be scanned, either as you drive or walk on to campus. As with the previous two weeks, your belongings may be subject to search as you enter campus. Individuals wearing face coverings will be asked to pull them down briefly for ID verification. Campus Access Update (posted 5/13) This announcement is to summarize two different emails from our office and Senior Administration yesterday, as there has been significant confusion. Vehicle and Pedestrian Access to UPC campus is currently limited to TWO entrance points, the McCarthy and McClintock Entrances, both of which are available 24/7. The vehicle/pedestrian Entrance at Watt Way is NOT open, although we may use it or other points as alternate exits as needed to relieve vehicle congestion. There is a separate, temporary, interior perimeter fence (for pedestrians only), which can be accessed at THREE entrance points: McCarthy Way @ the quad, Watt Way @ 34th Street (the north end of Watt Way), and McClintock Ave @ Childs Way. USCIDs will still be required for all students and employees to enter campus or access the interior fence; pre-registered guests must show their QR code from the visitor.usc.edu website in addition to a government issued ID. Please continue to monitor the Trojan Alerts system for the most up-to-date information. Campus Access Update (posted 4/28) According to the most recent Trojans Alert from DPS, campus access the week of April 29-May 5 will be through two entrances only – the McClintock and McCarthy Entrances. The Jefferson Entrance will also be maintained for permit holders and registered Engemann/Ostrow patients ONLY – no general guest parking allowed. As an easier-to-access alternate during this time, we invite permit holders to use any of the off-campus parking structures (Figueroa, Flower, Grand, USC Shrine) – no additional action is required to use any of these alternate locations. USCIDs will still be required for all students and employees to enter campus; pre-registered guests must show their QR code from the visitor.usc.edu website in addition to a government issued ID. Please continue to monitor the Trojan Alerts system for the most up-to-date information. Downey Entrance Intermittent Closures (posted 4/19) As the Ginsburg Hall construction process enters its final phases, the Downey Entrance will be subject to intermittent availability, in accordance with the schedule detailed below. Please take note of when the entrance will be available, and in what capacity. Pedestrian access will NOT be affected during these intermittent vehicle lane closures. 4/22 – 5/5 Partial closure between the LA Times Festival of Books and USC Commencement. The Downey vehicle entrance from Vermont Avenue will be open ONLY for entry into the Downey parking structure. The structure exit onto Downey Way will NOT be available. The only exit from the structure will be the McClintock Exit (the McClintock Entrance side is also available for entry), and from there to the McClintock campus Exit or the Watt Way campus Exit. 5/6 – 5/12 Re-open Downey Way for access through to McClintock (same as it currently is). 5/13 – 6/28 Close Downey Entrance completely to install new parking booth and demolish the old one. Complete hardscape repairs without jeopardizing building delivery access. 7/1 Target date to re-open Downey Entrance, both lanes, and new booth. UPC 34th St. Closure March 28 / AQMD Survey Reminder (posted 3/21) UPC 34th STREET CLOSURE MARCH 28 The new Dramatic Arts Building (DAB) is having a grand opening celebration on Thursday, March 28; this event includes a full closure of 34th Street west of Trousdale Parkway in front of DAB (formerly the United University Church building). Due to this closure, the following USC Bus routes/stops will be relocated on Thursday, March 28: C-Route will not service 34th Instead, it will start and end the route at the University Village bus stop on McClintock and Jefferson. Parking Center will not service 34th Instead, after the CAL stop, it will enter campus on McClintock and service a temporary stop at Lyon Center before continuing on the normal route. SC Tower will not service Kings Stoops Hall. Instead, it will start and end the route at the Michelson bus stop. Once the closure is removed, we will return to normal operations. Please subscribe to our Twitter/X account, @USCmoves, for live updates from USC Buses, including street closures/openings, delays, and more. ANNUAL AQMD SURVEY It’s time to complete USC’s annual AQMD survey! This mandatory annual survey is required by the South Coast Air Quality Management District (SC-AQMD); we cannot submit the University’s results until participation thresholds are reached, so please reply to the email as soon as possible. The online survey will ask how you got to work each day during the week of March 25-29, and includes additional USC Sustainability questions that assist with USC green air initiatives and reporting. Thank you in advance for your time in completing the survey! Project impacting Jefferson Blvd. undercrossing @ 110 Fwy (posted 3/15) USC ITS will be working on repairing cables providing service for the DPS Emergency phone located under the 110 Freeway overpass near Jefferson and Hope St. This work has been coordinated with the help of CDF and permitted with LADOT. Date: Thursday, March 21, 2024 Time: 8:30 a.m.-3:00 p.m.(PST) Location: Jefferson and Hope St.- ITS will be working in TMH (Telecom Maintenance Hole) Traffic impacts Northbound Hope St. to Westbound Jefferson will be reduced to one lane. Eastbound traffic on Jefferson approaching Grand and Hope St. will experience significant congestion. Use alternate routes. Westbound traffic on Jefferson approaching Hope St. and Grand Ave. will experience significant congestion. Use alternate routes. Kindly exercise the 5 C’s- Care, Caution, Consideration, Common Sense and Courtesy Eliminate distractions and don’t use your phone while driving. Allow extra time to get where you need to go. Slow down and watch your speed. UPC Entrance and area street closures during Spring Break (posted 3/7) Downey Entrance Closure USC Facilities Planning & Management (FPM) has advised that starting Saturday, March 9 at 6:00am, and continuing through Sunday, March 17 at midnight (the entirety of Spring Break), the Downey Way Entrance will be completely closed due to ongoing construction in Ginsburg Hall and the surrounding area. Please see this handout for a detailed description of the closure. The Downey Parking Structure will remain available at all times, but will only be accessible through the McClintock (east side) entrance. Pedestrian access to Vermont will be maintained, but ONLY on the north (Kapraelian Hall) side of the street. NAACP Event at Shrine The annual NAACP Image Awards are being held at the Shrine Auditorium at 5:00pm on Saturday, March 16. There will be sidewalk and curb lane/street closures in the days preceding the event and on Saturday; the most impacted area is expected to be 32nd Street on the north side of the USC Shrine Structure",
    "between Hoover and Figueroa, which will be completely unavailable. If you need to access the Shrine Structure via 32nd Street on Saturday, please do so from the Figueroa Street side. Please see this handout for complete details. Full Street Closures Impacting USC Shrine Structure on SATURDAY, FEB. 24 (posted 2/21) Since last week, preparations have been ongoing for the upcoming Screen Actors Guild (SAG) Awards, being held at the Shrine Auditorium on Saturday, February 24. Intermittent traffic lane and sidewalk closures will continue to increase on both 32nd Street and Jefferson Blvd. as the event gets closer (see attachment). Please be prepared for additional traffic and congestion in the area for the rest of this week. The culmination of these preparations will be full sidewalk and street closures of both 32nd St. and Jefferson Blvd. between Hoover and Figueroa ALL DAY on Saturday, February 24. These closures will impact access to the USC Shrine Parking Structure and Royal Structures; Shrine permit holders and USC Village employees will only be able to access the Structure on 32nd Street from Figueroa Street on Saturday – please be prepared to identify yourself as a permit holder/Village employee to LADOT officers managing the street closure. To access the Royal Structure on Saturday, permit holders need to enter the campus at the McClintock Entrance, then make a left and go to the end of 34th Street to get into the Royal Structure. This will be the only way out on Saturday as well due to the Jefferson Blvd. closure. Please let us know if you have any questions. President’s Day Service Announcements (posted 2/7) Monday, February 19 is President’s Day, an official University Holiday. Please make note of the following USC Transportation Service Announcements for that day: All Customer service centers will be closed on Monday, and will reopen at their normal times on Tuesday, February 20 All USC Bus services will not operate on Monday, and will resume service at their normal times on Tuesday, February 20 The USC Lyft program is not impacted by the holiday, service will continue as normal Overnight Full Freeway Closures Scheduled for I-110 (posted 1/18) The California Department of Transportation (Caltrans) is planning multiple overnight closures on Interstate 110 (I-110) between I-10 and Exposition Boulevard beginning Friday, Jan. 26, and ending Sunday, Jan. 28. The schedule includes a complete closure of the freeway in both directions of travel from late Saturday night through early Sunday morning. From Friday night to Saturday morning, the interstate will be reduced to one lane only in the southbound direction. These closures will allow crews to safely demolish the defunct pedestrian bridge over I-110 at 21st Street. The closure schedule is as follows: Friday, Jan. 26 Southbound I-110 reduced to one lane between I-10 and Exposition Boulevard 11 p.m. – 7 a.m. Saturday Crews to begin closing all on-ramps to southbound I-110 as well as the eastbound and westbound connectors from I-10 as early as 9 p.m. Southbound off-ramp to Adams Boulevard closed 7 p.m. – 10 a.m. Saturday Saturday, Jan. 27 Southbound I-110 between I-10 and Exposition Boulevard and northbound I-110 between Adams Boulevard and Washington Boulevard: FULL CLOSURE 11 p.m. – 8 a.m. Sunday Crews to begin closing on-ramps and connectors as early as 9 p.m. Southbound off-ramp to Adams Boulevard closed 7 p.m. – 10 a.m. Sunday Motorists are advised to avoid the area by taking an alternate route or by using public transit. Southbound traffic will be detoured to exit the interstate at the I-10 interchange and re-enter the freeway at either Exposition Boulevard or Martin Luther King Jr. Boulevard. Northbound traffic will be detoured to exit at Adams Boulevard and either re-enter the freeway at Washington Boulevard or access I-10 via Hoover Street. MLK Holiday Announcements (posted 1/5/2024) Monday, January 15th is Martin Luther King, Jr. Day, a USC Holiday. USC Transportation customer service centers at both campuses will be closed on Monday, and bus service will not be operating. All services will resume on their normal hours/schedules on Tuesday, January 16th. Multiple Events and Traffic Impacts on Saturday, Dec. 16 (posted 12/8) On Saturday, Dec. 16th, there will be numerous athletic and cultural events in venues surrounding the UPC campus. As a result, we anticipate increased congestion and traffic in the areas surrounding campus all day long, as well as some area street closures. If you plan to come to campus, whether attending one of the events listed below or not, please use extra caution in the areas surrounding campus, and give yourself more time for both ingress and egress. Thank you in advance for your patience and cooperation. LA MEMORIAL COLISEUM Mexico vs. Colombia Soccer Match Lots Open – 12:00pm Gates Open – 2:00pm Game time – 3:30pm-6:15pm (approximate) Attendance – 60,000 (expected) USC GALEN CENTER Chosen 1’s Naismith Basketball Hall of Fame Classic Doors open: 2:00pm Total of 4 games: 3:00pm – St. Vincent-St. Mary (Akron, OH) vs. Fairmont Prep (Anaheim, CA) 4:30pm – St. Vincent-St. Mary (Akron, OH) vs. Fairfax (Los Angeles, CA) 6:00pm – Sierra Canyon (Chatsworth, CA) vs. Paul VI (Fairfax, VA) 8:00pm – Sierra Canyon (Chatsworth, CA) vs. Coronado (Las Vegas, NV) Total attendance – 6,000 (expected) across all 4 games BMO STADIUM John Summit Concert Lots Open – 4:00pm Gates Open – 5:00pm Attendance – 21,000 (expected) SHRINE AUDITORIUM Scientology Year-End Event Times TBD – expected to arrive between 3:00pm-8:00pm Attendance – 7,000 (expected) STREET CLOSURES The street closures below will be in effect beginning around 5:00pm (exact time TBD by LADOT), impacting all events listed above. Please make note of the following closures: Exposition Blvd. Closing Eastbound lanes between Vermont Blvd. and Figueroa Street Figueroa Street BOTH directions between 39th Street and Exposition Blvd. 39th Street BOTH directions between Hill Street and Figueroa Street Flower Street Southbound lanes between 37th Street and 38th Street Flower Street Southbound lanes between Jefferson Blvd. and Exposition Blvd. 32nd Street between Royal Street and Hoover Street Holidays Service Reminders and Announcements (posted 11/17) USC TRANSPORTATION ANNOUNCEMENTS Please read on for important USC Transportation office closures and service reminders for Thanksgiving Break and Winter Recess. OFFICE CLOSURES For Thanksgiving Break, our Customer Service Centers at both UPC (in the McCarthy Structure) and HSC (in KAM-120) will close at 2:00pm on Wednesday, November 22, and remain closed through the break. Both offices will reopen at their normal times on Monday, November 27. For Winter Recess, both offices will close at 2:00pm on Wednesday, December 20, and remain closed through the recess. Both offices will reopen at their normal times on Wednesday, January 3, 2024. USC BUS SCHEDULE IMPACTS For Thanksgiving Break, USC Buses will not be in service Thursday-Sunday, November 23-26, including the weekend intercampus shuttle (ICS). USC Buses will return to their normal posted schedules on Monday, November 27. For Winter Recess: At UPC, there will be no bus service from December 21, 2023 through January 2, 2024 At HSC, there will be no bus service from December 23, 2023 through January 1, 2024 There will be limited Union Station/HSC bus service at HSC on the following days: 12/21/23, 12/22/23, and 1/2/2024 USC Buses will return to their normal posted schedules on Wednesday, January 3, 2024. METROLINK SERVICE CLOSURE REMINDER Metrolink commuter trains will be completely out of service system-wide for four days, from December 26-29, for annual maintenance and cleaning. OPERATION GIFT PROGRAM REMINDER Operation GIFT (the Group Initiative For Theft prevention) offers free parking at the UPC Grand Avenue Parking Structure (UPX) and HSC Valley Parking Lot (VPL). If you are leaving town and plan to leave your vehicle parked on or near the USC campus during the holidays, Operation GIFT can make your holiday experience a little easier by providing you with free off-street parking and a ride to LAX from UPC. Free Parking Free parking will extend from 2:00pm on November 20 through 12:00pm, January 8, 2024. Reservations for Thanksgiving Break and Winter Recess GIFT parking must be requested online at https://dps.usc.edu/services/parking/. LAX Shuttle Service USC Transportation is offering free bus service to LAX for Thanksgiving Break and Winter Recess. Reservations for this service must be requested online; shuttles will depart from the Widney Alumni House at UPC on Nov 21-22 and Dec 12-15. For reservations and more information, visit: https://dps.usc.edu/services/shuttles/. 10 Freeway Section Closure (posted 11/12) Due to a massive storage yard fire below the 10 freeway on Saturday that caused damage to the supporting structure, the 10 freeway will be FULLY CLOSED until further notice between the East LA Connector and Alameda Street (see map below). While there is no direct impact to campus or our bus routes, the closure of this section of freeway will increase congestion and cause traffic delays on all surface streets in the area of the closure as motorists navigate the closed section of freeway. We anticipate the heaviest impacts will be on the 110 North and South and the 101 East and West, as this is the alternate freeway route, and on surface streets in the East Los Angeles area south of Union Station. Please avoid the impacted area and plan for delays due to congestion. If possible for your commute, this might be a great time to try Metro; the light rail can take you from points all over Los Angeles to the University Park Campus using connectors that get you to the Expo (E) Line, and three campus-adjacent stations. Visit the trip planner online at www.metro.net to learn more. Please be sure to save and submit any public transit receipts to tsubsidy@usc.edu for 50% reimbursement under USC’s Transit Subsidy program. Please contact USC Transportation via email at auxtrans@usc.edu if you have any questions regarding this closure. https://transnet.usc.edu/wp-content/uploads/2023/11/CALTRANS-announcement.jpg UPC Area Congestion on Tuesday, November 7 (posted (11/3) On Tuesday, November 7, a crane lift in Exposition Park related to the Endeavor project is anticipated to draw media and spectator congestion to the City streets and areas surrounding the Coliseum between the hours of 7:00am-noon. Please anticipate increased congestion and traffic in the area and plan accordingly. If you are interested in seeing the crane lift activity, the area in green on this map (on the top level of the parking structure on site) has been identified as the best public viewing area. Please let us know if you have any questions of concerns. Fall Services Announcement/Reminders (posted 8/10/2023) CONGESTION/TRAFFIC ALERT USC students are back! Campus move-in for new undergraduates in USC Housing is August 12 – 16 (through August 17 for University Gateway residents). We expect elevated levels of traffic and congestion at all campus entrances during this time, as well as in the parking structures. Please note that there will be vehicles traveling/parking in areas where they are not normally found (Childs Way, Hellman Way, the campus Bus entrance on 34th Street) and use extra caution in those areas. Please consider using public transportation to get to campus – LA Metro has an online trip planner that can help. USC LYFT RIDES PROGRAM The USC Lyft Rides program returns this Fall, with no changes from last Spring. Invitations to join the Fall program will be emailed to all students beginning Friday, August 18. Do not share your invitation with others, doing so will deactivate your account. If you do not receive an invitation, please request one here. IMPORTANT REMINDERS:The USC Lyft Rides program runs on credits that automatically renew every month. USC does not pay cancellations fees, tips or PrimeTime upcharges. If your ride starts and ends within the appropriate campus geofence and in all other ways qualifies for the program, it will say “FREE” in the fare quote box. Complete program details are available here. Hours of operation: UPC: 6:00pm – 2:00am, seven days a week NOTE: These hours may change due to home football games and other special events. Changes will be announced via email and on our News & Announcements page. HSC: 5:00pm – 12:00am, Monday – Friday FALL PARKING PERMITS AVAILABLE ONLINE Students can purchase parking permits on the USC Transportation website. Click the “Access my Account” link under the “Parking” header and follow the prompts. NOTE: All interested students need to purchase a new permit. Do not choose the “Renew” option, click “Get Permit” instead. If the location you want is not listed, it is sold out or otherwise unavailable; please select from the location options listed. EXPANDED STUDENT U-PASS PROGRAM Our partnership program with LA Metro has expanded this semester to include all USC students for the first time! Visit the U-Pass page to learn all about the pass and apply for it through the Purchase Portal. USC BUSES FALL SCHEDULE NOW AVAILABLE The Fall USC Bus schedule is now available online. Please visit our Bus Map & Schedules page for details and a printable schedule. NEW GPS BUS TRACKING MOBILE APP We have a new GPS Bus Tracking Mobile App that gives up-to-the-minute information about USC Bus locations and estimated arrival times now available on Google Play Store and the App Store. For more information and instructions on how to download and use the app, please visit our Bus Map & Schedules page. FOOTBALL GAME DAYS PARKING REMINDER We anticipate a very busy and exciting football season ahead! You can use your USC parking permit on game days but access to your usual facility is not guaranteed; you may be re-directed to an alternate location, depending on structure availability at the time. Review the “Where Can I Park?” guide to double check where your permit is valid on game days. Please plan to arrive early or leave your car at home and take Metro! USC Buses Changing GPS Tracking Vendor (posted 6/26/2023) We are currently in the process of changing our GPS tracking vendor for the USC Bus system. Due to this change, our tracking system will be down temporarily. Due to some technical issues, the launch of the new system is delayed until about the second week of August. Once the new system is in place, we will have a new website as well as a mobile app for our riders to use to track our buses. We will have messaging on our buses as well as on our Map & Schedules page with details of the mobile app. Thank you for your patience during this process. Independence Day Service Announcements (posted 6/22/2023) Tuesday, July 4 is Independence Day; Monday July 3rd and Tuesday July 4th are both University Holidays. Please note the following USC Transportation service hours on those days: Customer Service Centers Our Customer Service Centers at both UPC (McCarthy Structure) and HSC (KAM-120) will be closed on Monday and Tuesday. Both will reopen at their normal hours on Wednesday July 5th. USC Buses USC Buses will not operate at all on Monday and Tuesday. USC Buses resume their normal schedules on Wednesday July 5th, following the summer schedule posted online here. USC Lyft The USC Lyft program will follow its normal schedule on Monday and Tuesday. Please let us know if you have any questions by emailing auxtrans@usc.edu. Thank you. Construction, Commencement, and Summer Announcements (posted 5/3/2023) CONSTRUCTION NOTIFICATION Starting May 2, you may have noticed construction equipment on Figueroa Street near Davidson Continuing Education Center. This city-approved project is to install a new electrical vault and will be completed in approximately 3-4 weeks. During construction, only one southbound traffic lane will be available on Figueroa St. in this area. This is expected to cause significant congestion at the intersection, and related traffic delays. Please avoid the area as much as possible until the construction is complete. NOTE: USC has confirmed that there will be no construction activity in this area on May 12, USC’s Commencement Day. All traffic lanes will be accessible. COMMENCEMENT DAY On May 12, USC will host their main Commencement Day ceremony. Parking will be available for free on University Park Campus and we expect to welcome thousands of Trojan family members celebrating their loved ones’ achievements. Congratulations, graduates! Area traffic and congestion are expected to be heavy all day, especially in the morning prior to the main ceremony. If you plan to visit University Park Campus on May 12, please plan to arrive early",
    "or use public transit. A parking space in your normal, permitted location is not guaranteed. We will distribute campus parking spaces as needed, based on demand. The special USC Bus schedule for Commencement Day is posted online here. SUMMER BUS SCHEDULE The Summer USC Bus Schedule is posted online here. HOLIDAY CLOSURES May 29 is Memorial Day, an official USC Holiday. Please note the following changes to our services on that day: Customer Service Centers Our Customer Service Centers at UPC (McCarthy Structure) and HSC (KAM-120) will both close at 3:00pm on Friday, May 26, and will be completely closed on May 29. Both will reopen at their normal times on May 30. USC Buses USC Buses will not operate at all on May 29. USC Buses resume their normal schedules on May 30, following the summer schedule, which is linked above. Free Metrolink rides on Earth Day & Photo Contest (posted 4/14) As you may be aware, Earth Day is right around the corner, and Metrolink will be offering free rides again on Saturday, April 22! If you have ever considered Metrolink as a way to navigate Los Angeles, Earth Day is a great opportunity to check it out at no cost! Metrolink is also promoting a new photo contest – their A Picture is Worth a Thousand Rides photo contest encourages riders to share their photos from their journey or at their favorite destination they go to via Metrolink for a chance to be one of three lucky winners to receive free monthly passes for a year! More information about the contest and campaign can be found at www.metrolinktrains.com/earthday. Summer/Fall Parking Permit Sales Dates/Processes (posted 4/3) Permit Renewals for Next Academic Year If you were a commuter student and had an active parking permit in the ‘22-‘23 (current) Academic year, you may be eligible to renew your permit online for Academic year ‘23-‘24. If eligible, you will receive an email by April 15, 2023 from our department that includes a permit renewal link. Simply select “yes” or “no,” select the vehicle you want associated with the permit, and that’s it! NOTE: Permits that have already expired cannot be renewed, and online renewal is only available for selected, active commuter permits. If you do not receive an email by April 15, your permit type was not eligible for online renewal. Summer 2023 Permit Sale Summer is a third, separate semester at USC that requires a separate permit. The Summer Student permit sale will begin on May 8, 2023 and will feature two new commuter permits. The Summer 2-week Permit will feature a user-selectable start date with a 14-day fixed end date, and the All Summer Permit will feature a user-selectable start date and a fixed end date of August 8, 2023. Both permits will allow you to add up to seven parking structure locations to your permit. Academic Year 23-24 Waiting List Process The waiting list process (aka “lottery” process) for Academic Year 23-24 will begin on May 1, 2023; the cutoff date for applications is May 16, 2023. After the cutoff date, we will run the waiting list lottery, randomly select winners, notify them that they have won the opportunity to make their permit purchase, and issue permits accordingly. If your name is NOT selected via the random lottery, you will be assigned a ranking order, and remain on the waiting list for your selected location. While waiting for an opening in your requested facility, we recommend you explore other parking/transit arrangements. NOTE: All HSC Structures and Lots and certain UPC high-demand Locations require this preference lottery; permits for lower-demand locations at UPC can be purchased directly, see below. Academic Year 23-24 Direct Sales Annual two-semester permits (Fa23/Sp24) will be available for direct sales starting on May 25, 2023 (NOTE: this date MAY change; please monitor our News & Announcements page online here for updates). All locations with availability will be available for sale online; if a desired location does not appear in your parking portal, it means that location is already sold out, or is otherwise unavailable. If you have questions or require assistance, please email us at auxtrans@usc.edu. Fall 2023 Transportation Fee FAQs (posted 3/6) Beginning in the Fall 2023 semester, qualifying students will be automatically charged a Transportation Fee through the USC student fee bill system. This fee is being assessed to offset the rising costs of providing transportation services to the USC community and to provide new benefits. This FAQ sheet was designed to answer what we anticipate will be the most common questions. If your concern is not addressed on the sheet, please contact us directly at auxtrans@usc.edu. Spring Break Announcements (posted 3/3) Please make note of the following service changes and other announcements related to USC Spring Break (March 12-19) USC BUS SERVICE There are no changes to the posted weekday schedule for Spring during Spring Break. The Weekend ICS (Intercampus Shuttle) WILL operate on March 11-12, but WILL NOT be in operation March 18-19. Please make alternate arrangements if you need to travel between campuses on the affected dates. LYFT PROGRAM HOURS There are no changes to the USC Lyft program hours due to Spring Break. The UPC hours remain 6:00pm-2:00am (7 days) and the HSC hours remain 5:00pm-12:00am (M-F). G.I.F.T. PROGRAM As DPS announced via email on Feb. 27, Operation GIFT is again offering free parking during the 2023 Spring Break for students, faculty, and staff who need a secure place to leave a vehicle if they will be out of town. GIFT parking begins on Thursday, March 9, 2023, after 7 a.m. and ends on Monday, March 20, 2023, at 2 p.m. Registration is required, at the link above. UPC CAMPUS TRAFFIC LANE IMPACTS USC ITS will be conducting network infrastructure discovery sessions in (3) Telecom Maintenance Holes on UPC’s campus from Tuesday, March 14 through Sunday, March 19. See below for details: Date: Tuesday, March 14 and Wednesday, March 15 Time: 6:00a.m. – 5:00p.m. (PST) Location: TMH066- In front of KDC Traffic impact: Both eastbound and westbound traffic off of 34th St. will experience slowdowns and brief stoppages. Date: Thursday, March 16 and Friday, March 17 Time: 6:00a.m. – 5:00p.m. (PST) Location: TMH050- McClintock Entrance to UPC campus Traffic impact: Entering and exiting UPC campus will experience brief slowdowns Date: Saturday, March 18 and Sunday, March 19 Time: 6:00a.m. – 5:00p.m. (PST) Location: TMH040- Intersection of McClintock and 34th St. Traffic impact: Entering and exiting UPC campus through 34th St. will experience brief slowdowns To protect USC ITS staff, please exercise the 5 C’s- Care, Caution, Consideration, Common Sense and Courtesy if you will be in the area affected. Eliminate distractions and don’t use your phone while driving. Allow extra time to get where you need to go. Slow down and watch your speed. Enjoy Spring Break 2023, and please let us know if you have any questions. President’s Day Weekend Service changes (posted 2/6) Please note the following service changes for the USC Holiday on President’s Day (Monday, Feb. 20) OFFICE CLOSURES The Customer Service Centers in McCarthy Structure (UPC) and KAM-120 (HSC) will be closed on February 20 in observance of the holiday. Both locations will reopen on February 21. USC BUS SERVICE SUSPENDED USC Buses will not operate on February 20 in observance of the holiday. Service will resume according to the Spring schedule on February 21. LYFT PROGRAM HOURS There are no changes to the USC Lyft program hours due to the holiday. The UPC hours will be 6:00pm-2:00am and the HSC hours will be 5:00pm-12:00am. February Service Announcements (posted 2/2) Please note the following changes in USC Transportation’s February service schedule: LYFT PROGRAM HOURS CHANGE ON FEB. 5 Due to a NASCAR event at the Los Angeles Memorial Coliseum on Sunday, February 5, the USC Lyft program hours will change. The program will operate on Sunday Feb. 5 from 9:00pm-2:00am. Please make note of the change – the later start time is in effect whether you plan to attend the NASCAR event or not. Martin Luther King Jr. Holiday Reminders (posted 1/13) As a reminder, all USC Transportation services are closed on official USC Holidays. Monday, January 16 is Martin Luther King Jr. Day; as a result, our customer service centers will be closed, and bus services are completely suspended for the day. We will resume all normal operations on Tuesday, January 17. Service Announcements for Spring 2023 Semester (posted 1/3) Please note these USC Transportation service announcements and changes which begin in the Spring 2023 semester. PARKING PERMIT CANCELLATIONS All student parking permits, other than Evening or specific FALL ONLY permits, renew automatically from Fall semester to Spring semester. If you DO NOT NEED your parking permit in the Spring, for any reason (no longer have a vehicle, are studying abroad, graduated in December, etc.), you must return the permit to one of our offices so that we can cancel it. Our offices are open normal business hours starting Tuesday, January 3 (UPC – McCarthy Structure, 8:30am-5:00pm, M-F; HSC – KAM-120, 7:30am-4:00pm, M-F) If you cannot come in to one of our offices, please mail your permit to: PERMIT CANCELLATION ATTN: Noel Aguilar USC Transportation 620 USC McCarthy Way Los Angeles, CA 90089 OFFICE HOURS The Customer Service Centers in the McCarthy Structure (for UPC) and in KAM-120 (for HSC) will re-open for Spring on Tuesday, January 3. To better serve the HSC community, our HSC office hours are changing. Starting January 3, that location will be open from 7:30am-4:00pm, M-F (closed 12-12:30 daily). The hours at UPC will remain 8:30am-5:00pm, M-F. Appointments are not necessary for service at either location. PARKING PERMIT & GRADUATE U-PASS SALES A limited number of Spring parking permits are now available for purchase online. at www.usc.edu/transportation. Start by selecting the “Access my Account” link under the “Parking” header, then follow the prompts to “Permits” and “Get Permit.” If a given location is not listed as one of your purchase options, that location is currently sold out. USC graduate students also have the option to purchase a Metro U-Pass through the portal. This is not a parking pass, but a pass that allows for discounted travel on LA Metro’s bus and rail system in Los Angeles. Complete details about the program are available online here. USC BUS SERVICES USC Buses will continue operating on a limited Winter Recess schedule through Friday, January 6. The Winter Recess schedule is posted here. USC Buses will begin their Spring schedule on Monday, January 9. The Spring schedule includes expanded hours for the C-route at UPC and two additional Intercampus Shuttle departures (one from each campus). The complete printable Spring 2023 USC Bus Schedule is available here. USC LYFT PROGRAM CHANGES IN SPRING Starting Friday, January 6, the USC Lyft program will return to the Shared ride model used in the past by various operators (including our own former in-house Campus Cruisers program). Important program highlights appear below: – Students are allowed to bring a guest with them for added safety and security, if they wish. Lyft’s Share Location feature also allows you to invite friends to follow your trip in real-time. – A shared ride may pick up other program participants along the same route, if Lyft’s ride-pairing algorithm determines it makes sense based on pick-up location, destination, vehicle size, number of riders already in the vehicle, etc. – Invitations for the Spring Lyft program will be sent to all former program participants on January 6. If you are a current USC student, faculty, or staff member and need an invitation to join after January 6, please complete this form. Each invitation is unique, please do not share your invitation with others. Participation in the USC Lyft program is limited to opted-in USC current USC students, faculty, and staff members. – You must choose “USC Lyft Ride – Shared” as the service option for your ride in the Lyft app to be covered by the USC program. Additionally, the ride must begin and end within the same UPC or HSC campus geofence. USC does NOT cover tips, cancellation fees, Prime Time upcharges, rides created using the “schedule” feature of the app, or rides with additional stops. Complete USC Lyft program details, instructions, troubleshooting tips, etc. are available here. – The USC Lyft program hours are 6:00pm-2:00am, seven days/week at UPC and 5:00pm-12:00am, M-F at HSC. Hours may change due to special events. Announcements regarding service hour changes will be posted here. – We recommend participants wear masks for shared Lyft rides in accordance with the current guidance from the Los Angeles County Department of Public Health. – Once you have requested a ride through the Lyft app, you can view the driver’s photo, license plate number, and the make, model and color of the car in the app. When your ride arrives, make sure the information in the app matches the arriving vehicle. Never take a ride you did not request, or get into a car that doesn’t match the details provided by the Lyft app. Service Changes for December / Winter Recess (posted 12/5) Please make note of the following changes in USC Transportation service schedules for December/Winter Recess. ACTIVE SHOOTER EXERCISE On Thursday, Dec. 15, DPS/LAPD will be conducting a joint active shooter drill in Grace Ford Salvatori Hall (GFS), between the hours of 8:00am-3:00pm. To support this important joint exercise, USC Transportation will be completely closing Lot 2 (immediately south of and adjacent to GFS) during the hours listed above. In addition, the Watt Way Entrance from Exposition Blvd. will be closed between 8:00am-3:00pm. All other campus entrances/lots will not be affected. WINTER RECESS SERVICE ANNOUNCEMENTS OFFICE CLOSURES The Customer Service Centers in McCarthy Structure (UPC) and in KAM-120 (HSC) will be closed December 19 through January 2, 2023. Both locations will reopen on January 3, 2023, at 8:30am. USC BUS SERVICE SUSPENDED USC Buses will operate according to the Fall Schedule through December 16 and will not operate at UPC December 19 through January 2. The Winter Recess Schedule will run January 3-6, 2023. We will have limited service at HSC December 19-23, 2022 and December 27-30, 2022. The Spring USC Bus schedule will begin service on January 9, 2023. Please click here for complete details on the Winter Recess USC Bus schedule. CAMPUS ENTRANCES LIMITED Access to the University Park Campus will be limited to the locations/schedules detailed below. All campus entrances will reopen January 3, 2023, according to their normal schedules, available here. Winter Recess Entrance Hours: The McCarthy Way and McClintock Entrances will remain open 24 hours/day (staffed by Transportation 6:00am-9:00pm; staffed by DPS/CSC 9:00pm-6:00am) The Jefferson Entrance will be open at various times according to the following schedule: December 19-23, 2022 Monday, Tuesday, and Thursday 7:00am-4:30pm Wednesday and Friday 9:30am-4:30pm December 27-30, 2022 Monday Closed Tuesday through Friday 7:00am-1:00pm January 2-6, 2023 Monday Closed Tuesday and Thursday 7:00am-4:30pm Wednesday and Friday 9:30am-4:30pm ADDITIONAL LYFT PROGRAM HOURS / SPRING SEMESTER CHANGES The USC Lyft Program will have extended hours during Finals Week at UPC and revert to a normal schedule during Winter Recess, details below. NOTE: The schedule at HSC will not change. December 6-13 UPC Lyft will operate 6:00pm-6:00am, 7 days a week. HSC Lyft will operate 5:00pm-12:00am, Monday through Friday. December 14-January 5, 2023 UPC Lyft will operate 6:00pm-2:00am, 7 days a week. HSC Lyft will operate 5:00pm-12:00am, Monday through Friday In the Spring 2023 semester, the USC Lyft program will return to the Shared program model. In the Shared program model, students may bring one person with them on the ride, in addition to possibly sharing a vehicle with others. We recommend students wear masks for shared Lyft rides in accordance with current guidance from the Los Angeles County Department of Public Health. Much more about this change will be announced in January’s Spring 2023 Service Offerings email. Thanksgiving Week Service/Football Game Announcements (posted 11/17) Please make note of the following Thanksgiving week service/Game Day reminders: EARLY OFFICE CLOSURE On Wednesday, November 23, Customer Service Centers in the McCarthy Parking Structure (at UPC) and KAM-120 (at HSC) will close at 2:00pm. Both offices will be closed on Thursday and Friday",
    "due to the holiday, and will reopen at 8:30am on Monday, November 28. HOME FOOTBALL GAME DAY ANNOUNCEMENTS On Saturday, November 26, the USC Trojans take on the Notre Dame Fighting Irish at the Coliseum. Kickoff is scheduled for 4:30pm. We expect significant traffic around campus for the last regular-season game, which will increase congestion and impact USC Bus schedules; please read on for important details. GUEST PARKING ON CAMPUS USC Transportation is now cashless! The Downey and McCarthy Structures will be available for game day sales (credit card only) on a space-available basis, and four additional structures will use Text2Park and License Plate Recognition (LPR) technology – all you need is a cell phone, credit card, and your vehicle’s license plate. Complete details are available here. Please note that the parking rate for game days and events is $40. TAILGATING ON CAMPUS Campus will open for tailgating 6 HOURS before kickoff (even if you have a reservation). Tailgating on campus is handled through an online reservation process – please visit the USC Game Day website to register. For the safety of all campus guests, DPS will deploy vehicle barriers at 8:30am and interior campus access will be restricted to emergency vehicles only. The vehicle barricades will be removed upon approval of the LAFD Fire Marshall when campus pedestrian traffic subsides, which is estimated to be 5:30pm. USC BUS SCHEDULES/IMPACT USC Buses will not be in service on Thursday and Friday due to the Thanksgiving holiday. The weekend intercampus shuttle between UPC-HSC does not operate on home football game days. If you normally use this service, please plan to make alternate arrangements. The weekend intercampus shuttle will be in service as normal on Sunday. USG offering students free shuttles to LAX! (posted 11/9/2022) USC’s Undergraduate Student Government (USG) is offering students an opportunity to get to LAX for FREE this Thanksgiving! Click here to view USG’s promotional flyer/QR code, and contact Sara Steinecker, Chair of USG Committee on Sustainability and Campus Infrastructure, if you have any questions. Friday Night Football Game Announcements (posted 11/6/2022) HOME FOOTBALL GAME DAY ANNOUNCEMENTS On Friday, November 11, the USC Trojans take on the Colorado Buffaloes at the Coliseum. Kickoff is scheduled for 6:30pm. Although this is a non-instructional day (Veteran’s Day), we still expect significant traffic around campus, which will increase congestion and impact USC Bus schedules; please read on for important details. PARKING ON CAMPUS Campus will be open for guest/game day parking starting at 4:00pm. USC Transportation is now cashless! The Downey and McCarthy Structures will be available for game day sales (credit card only) on a space-available basis, and four additional structures will use Text2Park and License Plate Recognition (LPR) technology – all you need is a cell phone, credit card, and your vehicle’s license plate. Complete details are available here. Please note that the parking rate for game days and events is $40. TAILGATING Because this is a weekday game (a PAC-12 requirement of all schools), please note that NO tailgating will be permitted on the University Park Campus or at USC Village, including the set-up of tents, chairs, tables, and/or picnic blankets for the purpose of serving meals or drinks, unless it is an official university-sanctioned event. USC BUSES IMPACT There are no route changes due to the weekday football game, but we anticipate significant area congestion as game time approaches, which will cause delays. Senior Vice President Memorandum (posted 11/2/2022) Please click here to read the memorandum issued today from Senior Vice President David Wright regarding the multiple events in Exposition Park on Saturday, November 5. Game Day Reminders vs. Cal Golden Bears (posted 10/28/2022) HOME FOOTBALL GAME DAY ANNOUNCEMENTS On Saturday, November 5, the USC Trojans take on the California Golden Bears at the Coliseum. Kickoff is scheduled for 7:30pm. We expect significant traffic around campus (especially with a second major event happening the same day), which will increase congestion and impact USC Bus schedules; please read on for important details. PARKING ON CAMPUS USC Transportation is now cashless! The Downey and McCarthy Structures will be available for game day sales (credit card only) on a space-available basis, and four additional structures will use Text2Park and License Plate Recognition (LPR) technology – all you need is a cell phone, credit card, and your vehicle’s license plate. Complete details are available here. Please note that the parking rate for game days and events is $40. CAMPUS ACCESS / TAILGATING Campus will open for tailgating 6 HOURS before kickoff (even if you have a reservation). Tailgating on campus is handled through an online reservation process – please visit the USC Game Day website to register. For the safety of all campus guests, DPS will deploy vehicle barriers at 11:30am and interior campus access will be restricted to emergency vehicles only. The vehicle barricades will be removed upon approval of the LAFD Fire Marshall when campus pedestrian traffic subsides, which is estimated to be 8:30pm. WEEKEND INTERCAMPUS SHUTTLE IMPACT The weekend intercampus shuttle between UPC-HSC does not operate on home football game days. If you normally use this service, please plan to make alternate arrangements. ADDITIONAL AREA EVENT / TRAFFIC IMPACT LAFC will host this year’s MLS Cup Final in Banc of California Stadium on Saturday, November 5. Kickoff is scheduled for 1:00pm, but with the home team hosting the Final, we anticipate heavy traffic and area congestion all day. Traffic will be especially congested between 3:00pm-6:00pm, as this event concludes and people begin to arrive for the USC game. Please allow additional time as needed. Game Day Reminders vs. Washington State (posted 10/2/2022) HOME FOOTBALL GAME DAY ANNOUNCEMENTS On Saturday, October 8, the USC Trojans take on the Washington State Cougars at the Coliseum. Kickoff is scheduled for 4:30pm. We expect significant traffic around campus, which will increase congestion and impact USC Bus schedules and the USC Lyft program; please read on for important details. PARKING ON CAMPUS USC Transportation is now cashless! The Downey and McCarthy Structures will be available for game day sales (credit card only) on a space-available basis, and four additional structures will use Text2Park and License Plate Recognition (LPR) technology – all you need is a cell phone, credit card, and your vehicle’s license plate. Complete details are available here. Please note that the parking rate for game days and events is $40. CAMPUS ACCESS / TAILGATING Campus will open for tailgating 6 HOURS before kickoff (even if you have a reservation). Tailgating on campus is handled through an online reservation process – please visit the USC Game Day website to register. For the safety of all campus guests, DPS will deploy vehicle barriers around 8:30am and interior campus access will be restricted to emergency vehicles only. The vehicle barricades will be removed upon approval of the LAFD Fire Marshall when campus pedestrian traffic subsides, which is estimated to be 5:30pm. WEEKEND INTERCAMPUS SHUTTLE IMPACT The weekend intercampus shuttle between UPC-HSC does not operate on home football game days. If you normally use this service, please plan to make alternate arrangements. LYFT ON GAME DAY The USC Lyft program starts approximately 5 hours after kickoff for afternoon/evening home football games. For Saturday, Oct. 8, the USC Lyft program will begin at 9:00pm and end at 2:00am. Please make note of the change – the later start time is in effect whether or not you attend the game. USC Lyft Program Hours Reminder (posted 9/30/2022) OPERATIONAL HOURS REMINDER: On Saturday, October 1, the USC Lyft Program hours of operation will be from midnight-2:00am due to the USC home football game at the Coliseum. Please make note of the change! Game Day reminders vs. Arizona State (posted 9/24) HOME FOOTBALL GAME DAY ANNOUNCEMENTS On Saturday, October 1, the USC Trojans take on the Arizona State Sun Devils at the Coliseum. Kickoff is scheduled for 7:30pm. As always, we expect significant traffic and campus impacts, which will increase area congestion and impact USC Bus schedules; please read on for important details. PARKING ON CAMPUS USC Transportation is going cashless! The Downey and McCarthy Structures on campus will be available for game day sales (credit card only) on a space-available basis, and four additional structures will use Text2Park and License Plate Recognition (LPR) technology – all you need is a cell phone, your credit card, and your license plate! Read complete details on our website. Please note the rate for game day parking this year is $40. CAMPUS ACCESS / TAILGATING Reminder: campus will only be open to tailgating 6 HOURS before kickoff (even if you have a reservation). Tailgating on campus is again being handled through an online reservation process – please visit the USC Game Day website to get started. DPS advises that for the safety of all campus guests, vehicle barriers will be deployed around 11:00am, and interior campus access will be restricted for emergency vehicles only. The vehicle barricades will be removed upon approval of the LAFD Fire Marshall, when campus pedestrian traffic subsides, estimated to be 8:30pm. Weekend Traffic Impacts at UPC (posted 9/19) On Friday/Saturday, September 23/24, Rammstein returns to the Los Angeles Memorial Coliseum! The original concert date (September 19, 2020) was postponed due to the pandemic; all tickets for that original show are being honored on Friday night, and a second show has been added on Saturday. We expect significant area congestion and traffic impacts at UPC both days, especially in the early evening hours. Please click the link below for tickets and additional information from the Coliseum. RAMMSTEIN CONCERT AT THE COLISEUM (Parking lots open 4:00pm; Gates open 5:00pm; Concert starts at 7:00pm) On Sunday, September 25, the Bimbo® Global Race returns to Los Angeles! This 5K/10K race will be conducted on Figueroa Street between LA Live and 32nd Street; Figueroa will be closed to all vehicle traffic between 6:00-10:00am on Sunday. Please see this flyer for additional information. Game Day reminders vs. Fresno State (posted 9/12) HOME FOOTBALL GAME DAY ANNOUNCEMENTS This Saturday, Sept. 17, the USC Trojans take on the Fresno State Bulldogs at the Coliseum. Kickoff is scheduled for 7:30pm. As always, we expect significant traffic and campus impacts; please read on for important details. PARKING ON CAMPUS USC Transportation is going cashless! The Downey and McCarthy Structures on campus will be available for game day sales (credit card only) on a space-available basis, and four additional structures will use Text2Park and License Plate Recognition (LPR) technology – all you need is a cell phone, your credit card, and your license plate! Read complete details on our website. Please note the rate for game day and event parking this year is $40. CAMPUS ACCESS / TAILGATING Reminder: campus will only be open to tailgating/vehicle access 6 HOURS before kickoff (even if you have a reservation). Tailgating on campus is again being handled through an online reservation process – please visit the USC Game Day website to get started. DPS advises that for the safety of all campus guests, vehicle barriers will be deployed at approximately 11:00am, after which interior campus access will be restricted to emergency vehicles only. The vehicle barricades will be removed upon approval of the LAFD Fire Marshall, when campus pedestrian traffic subsides, estimated to be 8:30pm. Please let us know if you have any questions. FIGHT ON! USC Students Fall 2022 services announcement (posted 8/16/2022) USC Lyft Rides Program The USC Lyft Rides program will continue to cover Lyft Classic (i.e. single rider) rides at the beginning of the Fall semester. The program will return to “Shared” rides when CDC/LADPH guidelines allow an additional rider to accompany the requestor. We will announce any program changes in advance. All invitations to join the Lyft program for Fall will be emailed automatically beginning Thursday, August 18. Do not share your invitation with others, as doing so will deactivate your account. If you do not receive an invitation, please request one here. IMPORTANT REMINDERS: The program runs on credits that automatically renew every month; USC does not pay for cancellations fees, tips, or PrimeTime upcharges. If your ride starts and ends within the appropriate campus geofence, and in all other ways qualifies for the program, it will say “FREE” in the fare quote box. Per current LA County guidelines, masks are required on all rides. Please review additional program details here. Hours of operation: At UPC: 6:00pm – 2:00am, seven days a week (hours may change due to home football games and other special events) At HSC: 5:00pm – midnight, Monday – Friday Fall Parking Permits Available Online Students can purchase parking permits directly from the USC Transportation website. Start by clicking the “Access my Account” link under the “Parking” header, and then follow the prompts. NOTE: All interested students need to purchase a new permit. Please do not use the “Renew” option, click on “Get Permit” instead. If the location you want is not listed, that means it is sold out or otherwise unavailable; please select from the location options listed. Graduate Student U-Pass Program USC continues to partner with LA Metro to provide graduate students an opportunity to commute to internships easily or simply explore Los Angeles at a discounted rate. Please visit their page on our website for complete details about the Fall 2022 program. USC Bus Fall Schedule Posted The Fall USC Bus schedule is posted online. Please visit our “Bus Map & Schedules” page for details and a printable schedule. Per current LA County guidelines, you are required to wear a mask at all times when riding a USC Bus, regardless of your vaccination status. Football Parking Reminder for Permit Holders We anticipate a very exciting (and busy) football season ahead! As a reminder, you may use your USC parking permit on Game Days, but access to your usual facility is not guaranteed; you may be re-directed to an alternate location depending on structure availability at the time of your arrival. Please plan to arrive early on game days if driving, or even better, leave your car at home and take Metro! EVmo RideShare Rental USC Transportation is partnering with EVmo RideShare Rental to provide an opportunity for students without cars to rent a vehicle in order to make money as an off-campus gig driver (Lyft, DoorDash, etc.). Please visit their page on our website for more information/to sign up. Move-In Week Reminders (posted 8/12/2022) CONGESTION/TRAFFIC ALERT USC students are back! The on-campus move-in period for new undergraduates in USC Housing is Monday, August 15 through Wednesday, August 17 (move-in for USC Village starts Saturday, August 13th). To facilitate move-in traffic across those three days, USC Housing is requiring students to register for a window of time in advance, and will have staff and volunteers to assist our newest Trojans as they arrive on campus. We expect elevated levels of traffic and congestion at all entrances to campus next week, as well as in the structures. Please see this map detailing how undergraduates and their families are being directed to arrive/park. Please make special note that there will be vehicles traveling/parking in areas where they are not normally found (Childs Way, Hellman Way, the campus Bus entrance on 34th Street), and use extra caution in those areas. Please also consider using public transportation to get to campus – LA Metro has an online trip planner that may help – and in all cases, give yourself plenty of time and a bit of extra patience. BARRICADE NOTIFICATION Please note that vehicle barricades will be in place around campus for Fall New Student Convocation on Thursday, August 18th from 6:30am until approximately noon at the following locations (below). Approximately 12,000 people are expected to attend; please reduce electric cart traffic on campus during this time period. 35th & McCarthy 34th between Birnkrant and Leavy 34th West of Leavy Trousdale and 34th Bloom Walk Watt Way & Hellman Way McClintock and Childs Way Downey Way Entrance UPDATE (posted 8/10/2022) We are pleased to share that the Downey Way Entrance will reopen on Thursday, August 11, in order to facilitate student move-in activities. The exit side of Downey will remain closed due to ongoing construction – this reopening is of the entrance side from",
    "Vermont Avenue ONLY. 36th Street will remain a one-way street heading east (into campus) when the entrance reopens. Please note, the Downey Way Entrance will temporarily close again, from 6:00am Thursday August 25, through 6:00am, Monday August 29, due to a tower crane installation for Ginsburg Hall. The Downey pedestrian gates and sidewalks will remain open on their normal schedule. The Downey Structure itself will only be available for vehicle traffic from the McClintock Avenue entrance during this closure. The Downey Way Entrance will reopen again for the Fall semester hours/normal activity at 6:00am, on Monday, August 29. As above, the exit side of Downey will remain closed due to ongoing construction – this reopening is of the entrance side from Vermont Avenue ONLY. 36th Street will remain a one-way street heading east (into campus) when the entrance reopens. USC Employee Fall 2022 services announcement (posted 8/4/2022) As also posted on the USC employees Gateway Page on Monday, August 8, please note the following USC Transportation service announcements for Fall: Fall Parking Permits Available Online Employees can purchase parking permits directly from the USC Transportation website. Start by finding the “Access my Account” link under the “Parking” header, and then follow the prompts.) NOTE: All interested employees need to purchase a new permit – please do not use the “Renew” option. Click on “Get Permit” instead, even if you had a permit previously. Please also make sure your vehicle/license plate information is up to date – accurate vehicle information is required from all permit holders in order to avoid citations. Permit costs are always listed online for the entire time frame an employee permit is valid; if you continue through to the “View Cart” screen, there will be a dropdown menu of payment options, from which you can/should select “Payroll monthly pretax deduction.” The monthly charge will then come out of your paycheck automatically. You can cancel your permit anytime by returning it to USC Transportation if your unit plans/work schedule changes. Employee 2x/ and 3x/week permits are back, available on a semesterly basis. USC Bus Fall Schedule posted The Fall USC Bus schedule is posted online – please visit our “Bus Map & Schedules” page for complete details and a printable schedule. Per USC/LA County guidelines, masks are still required while taking the USC Bus at all times, regardless of your vaccination status. Transit Subsidy Reminder Still feeling pain at the pump? Even though gas prices have dropped a bit lately, they’re still some of the highest in the nation. Since 2019, Pres. Folt’s Transit Subsidy Program has been subsidizing 50% of all employee public transit costs – read all about it, and apply to join the program, on our website. Football Parking Reminder for Permit Holders We anticipate a very exciting (and busy) football season ahead! As a reminder, you may use your USC parking permit on Game Days, but access to your usual facility is not guaranteed; you may be re-directed to an alternate location depending on structure availability at the time of your arrival. Please plan to arrive early on game days if driving, or even better, leave your car at home and take Metro! Please contact auxtrans@usc.edu if you have any questions. DPS Reminder Regarding USC Village Access (posted 7/15/2022) Given the importance of creating a safe environment at the USC Village for our students, faculty, staff, and USC Village visitors, the USC Department of Public Safety developed the following rules concerning open access, vehicular traffic, and pedestrian right-of-way. We believe these rules will also help alleviate any congestion that may be created by cars, electric carts, bicycles, skateboards, URB-E’s, hover boards, delivery trucks, maintenance, and construction vehicles at this location. Please see the reminders below, in addition to this map of the USC Village dismount zone. Area A (central quad) No cars, electric carts, bicycles, skateboards, URB-E’s, hover boards, Uber or Lyft vehicles, delivery trucks, or construction vehicles will be allowed to drive or park in the central common area, or in front of any building as it faces the inner, central common area, except: Emergency vehicles FMS electric carts for groundskeepers, USC Mail and Material Management Services Vehicles delivering mail (no FedEx, UPS or other outside carriers) Human-powered pallet jacks and hand carts used for retail product delivery from commercial vehicle parking areas behind Buildings UVF/MHC and UVN/CRC. Any vehicle traffic in this area must stay on cement paved lanes and not travel over grass, paver planting, tree beds or grass and be mindful of pedestrian right of way. Area B (north of UVF/MHC, west of UVN/CRC) Delivery vehicle access will only be allowed at the McClintock and Hoover service gate entrances, and only between the hours of 7:00am and 9:00pm. Delivery vehicles on the service lanes north of UVF/MHC must park outside of the fire lane and be attended to at all times. Delivery vehicles must not park in the service lane running north / south adjacent to UVN/CRC. Delivery vehicles that park in fire lanes or are left unattended for extended lengths of time will be cited or towed. There will be a 30 minute time limit on all delivery vehicle parking, even in the appropriate areas. Contractor or Maintenance vendor vehicles are only allowed in the service lanes to facilitate deliveries. No construction contractor parking is allowed. Maintenance vendor vehicles may at times park on the service lane north of UVF/MHC and will be required to display vendor parking passes to be provided by the USC department managing their service (i.e. USC Housing, USC Hospitality, USC Real Estate, USC FMS). Pedestrian pickups and drop-offs may only stop outside the public sidewalk perimeter of the Village. Uber and Lyft vehicles should not pull into the underground garage entry ramp and then stop/perform U-turns, as this creates a hazard. Loading and unloading of party/event equipment rentals may only occur via the McClintock entrance behind UVF/MHC. USC Housing, USC Hospitality and USC Mailing Services vehicles must park in the designated spaces behind UVF/MHC. USC FMS and DPS Vehicles must park in the designated areas north of UVN/CRC and adjacent to UVO. All other USC vehicles and electric carts will be cited or towed. Visitors to the USC Village should be using appropriate parking in the underground retail parking garage. Overall No fire lanes may be blocked at any time. Rate Increase announcement (originally posted 5/9/2022) Beginning July 1, 2022, the university will introduce adjusted rates for parking permits. The adjustment follows a five-year period during which permit fees remained unchanged, as well as a period during the height of the pandemic, where fees were altogether suspended. The maintenance of the university’s parking facilities is supported by the revenue generated by parking permit fees, and the increases in operational expense have created the need to raise the price of permits. The new price for parking permits in the Gold parking tier, which accounts for a majority of permits, will be $115/month (from $111/month). Similar increases averaging 5% will be implemented for all parking permits; a full rate schedule can be found on the USC Transportation Parking Rates webpage. Fees for daily guest parking ($20/day), short-term hourly parking ($4/hr) are also being increased as of July 1; for full details about short-term parking options, please refer to our Daily and Hourly Parking webpage. These increases are necessary to support the ongoing operations of our department as we return our services to pre-COVID levels. The two- and three-day employee parking permits, which were introduced to support hybrid working schedules, will continue to be offered in FY23, providing a lower-cost permit option for people coming to campus on a part-time basis. Additional cost-effective parking alternatives include UPC’s Grand Avenue Parking Structure and HSC’s Lot 71 and Valley Lot, which will remain in our lower Cardinal pricing tier at $85/month (from $81/month), and various Pay-By-Plate locations available for short-term campus visits. Alternatives to campus parking include our public transit program, which is subsidized 50% by USC, and carpooling. These options can be explored using our online transit portal, Traveler. Thank you in advance for your support, and please let us know if you have any questions. Independence Day Service Hours (posted 6/24/2022) Monday, July 4, is Independence Day, an official USC Holiday. Please note the following changes to our services on that day: Customer Service Centers Our Customer Service Centers at both UPC (McCarthy Structure) and HSC (KAM-120) will be closed on Monday. Both will reopen at 8:30am on Tuesday, July 5. USC Buses USC Buses will not operate at all on Monday. USC Buses resume their normal schedules on Tuesday, July 5, following the summer schedule posted online here. Additional Downey Entrance/Structure Impacts (posted 6/3/2022) The Downey Entrance at UPC has been impacted by the construction of Ginsburg Hall in recent months; we were notified today that the project will be impacting the entrance from Vermont, and the north structure entrance, even further in the coming weeks. Please see below and this attachment for details. ENTRANCE IMPACT Beginning Tuesday, June 7, the Downey Entrance/Exit to campus will be COMPLETELY CLOSED until further notice. To enter the southwest quadrant of campus, please use either the Watt Way Entrance (open weekdays only from 6:00am-9:00pm), or the McClintock Entrance (24 hrs). Both those same points can be used for egress (please drive towards the Watt Way exit slowly if the vehicle gate is closed, it will automatically swing inwards). We expect the temporary loss of the Downey Entrance will create additional area traffic, especially in the morning and evening rush hours; please use caution and give yourself extra time if possible. STRUCTURE IMPACT From June 7 – July 17, the north exit from the Downey Structure will still be available, as an EXIT ONLY, and can be used to take Downey Way back to McClintock (one-way traffic only), from which either of the exit points above can be used. Between July 18 – August 5, this exit will no longer be available, and the ONLY exit from the Downey Structure will be the east exit onto McClintock Avenue. We anticipate this will create significant delays and congestion within the structure, especially during the evening rush hour; please be patient and cooperative with your fellow commuters during this time. Thank you in advance for your cooperation; please let us know if you have any questions. Downtown L.A. Street Closures, June 6-10 (posted 6/3/2022) The City of Los Angeles is privileged to host the Ninth Summit of the Americas from June 6-10, a gathering expected to include world leaders from throughout North, Central, and South America, as well as the Caribbean. Traffic will likely be impacted in the Downtown LA area and around Los Angeles International Airport (LAX) from 10 pm Monday, June 6 through noon Saturday, June 11. While none of these impact the UPC area directly, there are intermittent street/freeway exit closures in the area of downtown that we wanted to make the USC community aware of. Please visit the City’s press release page regarding this event for complete details. Memorial Day Service Hours (posted 5/20/2022) Monday, May 30, is Memorial Day, an official USC Holiday. Please note the following changes to our services on that day: Customer Service Centers Our Customer Service Centers at both UPC (McCarthy Structure) and HSC (KAM-120) will be closed on Monday. Both will reopen at 8:30am on Tuesday, May 31. USC Buses USC Buses will not operate at all on Monday. USC Buses resume their normal schedules on Tuesday, May 31, following the summer schedule posted online here. Rate Increase announcement (posted 5/9/2022) Beginning July 1, 2022, the university will introduce adjusted rates for parking permits. The adjustment follows a five-year period during which permit fees remained unchanged, as well as a period during the height of the pandemic, where fees were altogether suspended. The maintenance of the university’s parking facilities is supported by the revenue generated by parking permit fees, and the increases in operational expense have created the need to raise the price of permits. The new price for parking permits in the Gold parking tier, which accounts for a majority of permits, will be $115/month (from $111/month). Similar increases averaging 5% will be implemented for all parking permits; a full rate schedule can be found on the USC Transportation Parking Rates webpage. Fees for daily guest parking ($20/day), short-term hourly parking ($4/hr) are also being increased as of July 1; for full details about short-term parking options, please refer to our Daily and Hourly Parking webpage. These increases are necessary to support the ongoing operations of our department as we return our services to pre-COVID levels. The two- and three-day employee parking permits, which were introduced to support hybrid working schedules, will continue to be offered in FY23, providing a lower-cost permit option for people coming to campus on a part-time basis. Additional cost-effective parking alternatives include UPC’s Grand Avenue Parking Structure and HSC’s Lot 71 and Valley Lot, which will remain in our lower Cardinal pricing tier at $85/month (from $81/month), and various Pay-By-Plate locations available for short-term campus visits. Alternatives to campus parking include our public transit program, which is subsidized 50% by USC, and carpooling. These options can be explored using our online transit portal, Traveler. Thank you in advance for your support, and please let us know if you have any questions. Summer permit sales announcement (posted 4/26/2022) Summer 2022 permits will be available online through your parking portal starting Monday, May 2. You can purchase a permit from the available options through our website at www.usc.edu/transportation; start by finding the “Access my Account” link under the “Parking” header, and then follow the prompts. NOTE: All summer permits are available to be printed from home; please be prepared to print your permit once your transaction is completed. Hang-tags or stickers are NOT being issued during the summer 2022 semester. Please email us at auxtrans@usc.edu if you have any questions or cannot access your parking portal. Extreme Traffic Congestion Expected Saturday, April 23 (posted 4/15/2022) On Saturday, April 23, USC will host two major events at our UPC campus: the Los Angeles Times Festival of Books and the USC Football Spring game. The LATFOB is an annual two-day festival (April 23/24) attracting over 150,000 guests to campus who love everything book-related. The event consists of hundreds of booths and exhibitions, book signings, speakers, and many other special events. Full details about the event can be found here on their web page. Parking for this event will be available at Royal, USC Shrine, Jefferson and Figueroa structures. The USC Spring Football Game will be fans’ only chance to see new Head Coach Lincoln Riley in action before the season begins! The game starts at noon at the LA Memorial Coliseum, and Coliseum gates will open at 10:30am. Parking information for this event can be found here. USC Transportation expects very heavy congestion and traffic in the area of campus this Saturday due to these two major events, with the most impact anticipated between 10:00am-1:00pm. While we have not been advised of any LADOT street closures, the five major streets surrounding campus/the Coliseum (Martin Luther King Blvd., Exposition Blvd., Jefferson Blvd., Figueroa St. and Vermont Ave.) will be extremely congested on Saturday, with related congestion impacting smaller streets feeding towards campus, and both directions of the 110/10 freeways (especially the Vermont/Hoover exits off the 10, and Exposition/MLK exits off the 110). Please also note that due to area construction impacts, the Downey Entrance on Vermont Avenue adjacent to the Downey Structure (formerly PSA) will convert to an EXIT ONLY at 1:00pm. The USC weekend intercampus shuttle will still operate on Saturday, but we expect potentially significant delays due to the area traffic. If you are coming to campus this weekend (especially Saturday), please anticipate delays and plan accordingly, or consider taking Metro. Please let us know if you have any questions. Beat the pain at the gas pump (posted 3/28/2022) Rapidly rising gas prices are hitting all drivers hard here in Southern California. Here are some options provided through USC Transportation that may help you beat the pain at the pump. Did you know that USC has its own gas",
    "station? It’s located on West 35th Street, just south of the Grand Avenue Parking Structure. Full details (including hours of operation and daily prices) can be found here. You can even pay with your USCard! One of President Folt’s first initiatives was implementing a 50% transit subsidy for all USC faculty and staff who use public transit to get to work. If you take a bus or train, USC will pay half the cost of your fare. If the transit agency operating the bus or train is a partner of USC Transportation, you can benefit further by using pre-tax payroll deduction to purchase your pass. Details about the USC Transit Subsidy Program, including an application form, are available here. If public transportation isn’t an option for you, there may be a fellow USC faculty or staff member who lives nearby with whom you can carpool. USC’s Traveler platform is an online dashboard that combines all your mobility options into one easy-to-use platform. Check it out and get traveling! Weekend Metro closures in downtown LA (posted 3/2/2022) LA Metro has asked regional partners to distribute information regarding some weekend closures and service disruptions in downtown Los Angeles; please refer to their online announcement for complete details and maps of the affected lines/areas. Reminder about UPC Egress (posted 2/25/2022) As construction of Ginsburg Hall continues, egress from the southwest quadrant of the UPC campus continues to be constrained, especially for vehicles traveling north on McClintock to the McClintock exit. Please remember that the Watt Way exit onto Exposition Blvd remains available at all times via an automatic exit gate (approach slowly and it will open inwards), and the exit is manned and open from 6:00am-9:00pm weekdays. We encourage all Downey Way permit holders to exit via Watt Way if at all possible; please download the recommended egress map for complete details. LA Rams Victory Parade on Wednesday, February 16 (posted 2/15/2022) The Los Angeles Rams victory parade will start at the west parking lot of the Shrine and make its way east/south to Figueroa Street and the Exposition Park area. This event will cause major disruptions to the UPC campus, vehicles entrances, pedestrian access points, USC bus schedules, city streets, etc. Please refer to this handout for all the latest projected impacts. President’s Day Service Changes and LA Metro Service Changes are Coming (posted 2/10/2022) Monday, February 21 is President’s Day, a University Holiday. Please note the following USC Transportation service changes for that day: Customer Service Centers at UPC (in the McCarthy Structure) and HSC (in KAM-120) will both be closed on Monday. Both offices will reopen at 8:30am on Tuesday morning. All USC Bus services will be closed on Monday. Normal Spring semester service resumes on Tuesday morning. LA Metro is announcing service changes that will go into effect on February 20; please download this flyer to read all about them. USC Buses Reminder (posted 1/18/2022) Due to classes being held remotely to begin the semester, USC Buses will continue following the Winter Recess Schedule for one additional week (through Friday, January 21). The Spring Semester bus schedule will begin service on Monday, January 24. Please visit the bus schedules page on our website for the most recent information/posted schedules and routes. Spring Lyft Program Update (posted 1/14/2022) As a result of the continuing impact of the COVID pandemic and recent Omicron variant, the University is extending the Lyft program throughout the spring semester in single ride mode. Lyft’s previous shared ride model was the mode of transportation originally offered through USC Transportation’s supplemental ride program and, through that model, we’ve been able to offer more than 4 million free rides to date. In August 2020, Lyft was unable to continue the shared ride program, due to health and safety considerations, and transitioned to the current single ride mode. We have been supportive of this change and will continue to make programmatic decisions in the interest of the health and safety of our students. We thank you for your support and invite you to visit our website for updates, as well as the details and hours of the program: https://transnet.usc.edu/index.php/campus-cruiser-program/how-to-use-lyft/ Thank you and Fight On! Spring Semester service announcements (posted 1/6/22) Please make note of the following USC Transportation Spring Semester service announcements: USC Buses Due to classes being held remotely to begin the semester, USC Buses will continue following the Winter Recess Schedule for one additional week (through Friday, January 14). The Spring Semester bus schedule will begin service on Tuesday, January 18 (after the holiday, see below). Please visit the bus schedules page on our website for posted schedules and route information. Appointments for In-Person Services Our customer service centers at UPC (in the McCarthy Structure, 8:30am-5:00pm, M-F) and HSC (in KAM-120, 8:30am-4:00pm, M-F) remain open, but appointments are required, starting Monday, January 10. Please visit our appointment scheduling page on our website to find available times/schedule a visit. Martin Luther King, Jr. Closures Monday, January 17 is Martin Luther King, Jr. Day, a University Holiday. All customer service centers and bus routes will be closed in observance of the holiday. Winter Recess Service Schedules and Lyft Program Changes for Spring (posted 12/15/21) Please read the following announcements regarding important changes to the USC Lyft Rides program and USC Transportation schedules for the remainder of the Fall semester and Winter Recess. Winter Recess Schedules (December 16–January 2) Transportation offices are closed from December 20 to January 2. The USC Lyft Ride program at UPC will operate 6:00PM–12:00AM daily from December 15 to January 2. There is no change to the HSC program’s operating hours. The USC Bus system will suspend most services during Winter Recess. We will offer limited service between HSC and Union Station December 20–23 and 27–30; please refer to the schedules posted on our website. Normal services will resume January 3. Campus access will be limited between December 18 and January 2. During this time, vehicle entry and exit will be limited to the McCarthy and McClintock and Jefferson gates. The Jefferson entrance will be closed December 24–26 and December 31–January 2. Pedestrian access will be limited to the McClintock, McCarthy, Trousdale/Exposition, Trousdale/Jefferson and Downey gates. Lyft Program Dates & Changes for Spring 2022 The updated Spring USC Lyft Ride program will begin January 10, 2022. Please note that you will need to sign up for the new program, your enrollment in the previous Lyft program will not transfer over automatically. Email invitations to join the new program will be sent on January 7. We request that you please hold your questions about the program until you receive this email. If you have not received an invitation to join the program by January 10, please email us at auxtrans@usc.edu. There are USC Lyft Ride changes which will go into effect on January 10. Listed below are the new program guidelines: The new program optimizes rides by pairing up to two riders from the program going to similar locations. Riders will choose the USC Lyft Ride – SHARED option as their mode of travel in the app. All ride requests must be for single individuals only. Friends traveling together must make individual requests for rides using the app, even if they are going to/from the same location. Masks are required to be worn at all times, the front seat and middle seat must be kept empty, and eating and drinking are not allowed during rides. If anyone in the vehicle is not following these guidelines, BOTH riders and drivers have the ability to cancel the ride without penalty and report issues they experienced directly to Lyft. Spring Permits Available this Friday, Dec. 3 (posted 11/29/21) Parking permits for the Spring 2022 semester will go live on our website this Friday, Dec. 3, at noon. PLEASE NOTE: All Fall Student permits renew for Spring automatically; the only capacity created for Spring sales comes from returned permits due to permit cancellations, or from Fall graduates (if you’re graduating and no longer need your permit, please remember to return it to us, otherwise, we won’t know!) After noon on Friday, all currently available options for Spring will be listed in your account through our website at www.usc.edu/transportation; if the location you want is not listed, unfortunately, that means it is sold out or remains otherwise unavailable. If you are interested in seeing if new locations become available, we recommend checking your account periodically, that is where the availability will show up first. Thanksgiving Week Hours and Announcements (posted 11/18/21) Please note the following USC Transportation service hours during Thanksgiving week (November 22-27): Customer Service Centers Our Customer Service Centers at both UPC (McCarthy Structure) and HSC (KAM-120) will be open as normal on Monday and Tuesday, and closing at 2:00pm on Wednesday. Both offices will be completely closed on Thursday and Friday, resuming normal business hours on Monday, November 29. Appointments are no longer required for in-person service, but Trojan Check/vaccine requirements are now in place, and face masks are required at all times inside buildings. USC Buses USC Buses will follow their normal schedules Monday through Wednesday of Thanksgiving week; there will be no service at all on Thursday or Friday. USC Buses resume their normal schedules on Monday, November 29. Lyft The Lyft Safe Rides program will follow its normal schedule Monday through Wednesday of Thanksgiving week; there will be no service at all on Thursday or Friday. On Saturday, November 27, the Trojans will host BYU at the Coliseum; kickoff time is 7:30pm. On that day, Lyft services will not start until midnight due to the football game. (NOTE: the USC/UCLA game on Saturday, Nov. 20 kicks off at 1:00pm; there are no changes to the Lyft program that day.) Entrance Hours USC Entrances will follow their normal schedules Monday through Wednesday, and follow the posted holiday schedules on Thursday and Friday. For the USC football game vs. BYU on Saturday, the campus will open for tailgating activities six hours before kickoff at 7:30pm – advance tailgating reservations are required. All campus guests will be required to follow the Trojan Check/vaccine requirements that are now in place. Please let us know if you have any questions by emailing auxtrans@usc.edu. Thank you, and happy holidays! USC Football Game Day Letter from AD Mike Bohn (posted 8/31/21) Please click here to read the Game Day and Coliseum updates letter from USC Athletic Director Mike Bohn, with important details regarding the “NO TAILGATING” policy for USC’s first game vs. San Jose State on Sept. 4. Additional appointment blocks added! (posted 8/19/21) In response to growing demand for appointments at our University Park Campus office (located in the McCarthy Structure, enter from the quad side), we have made a new set of appointment blocks available online. Please visit our appointments web page here to book an appointment for in-person customer service. Same-day appointments are NOT available. We do not require an appointment, but they are strongly recommended. Walk-ins will be severely limited as the University continues to practice social distancing in the wake of COIVD and its variants; customers with appointments will be helped before walk-ins. Graduate Student U-Pass now Available! (posted 8/16/21) USC Transportation partners with the Los Angeles County Metropolitan Transportation Authority (Metro) to offer the Graduate Student U-Pass program; the reduced fare transit pass offers USC graduate students unlimited rides on Metro’s rail and bus lines for any given semester. If you need help or have any questions about the program, please contact USC Transportation Rideshare Coordinator Maira Sanchez via email at tsubsidy@usc.edu. The Graduate U-Pass will be available for purchase for the Fall 2021 semester starting on Monday, August 16. The program dates will be from August 16, 2021 through January 23, 2022 (23 weeks in total). The cost is $103 ($105 for new sign-ups, which adds the cost of a card). Please see the Fall 2021 U-Pass data sheet for complete details and answers to FAQs. Thank you. USC Students Fall services announcement (posted 8/13/21) USC Transportation would like to remind all students of the following service reminders for the Fall 2021 semester: Fall permit sales continue online; you can purchase a permit directly from the options available through our website at www.usc.edu/transportation; start by finding the “Access my Account” link under the “Parking” header, and then follow the prompts. You can cancel your permit anytime by returning it to us if the campus access plans/teaching schedules change. USC Buses are returning to expanded levels of service; the Fall schedule is currently posted on our “Bus Map & Schedules” page, here. Many of our bus routes have returned to their pre-COVID schedules, but some will continue to operate on a reduced basis as we re-hire and train additional drivers. Please continue to monitor our website for service updates. The Safe Rides Program will solely be operated by Lyft during the Fall semester; Campus Cruiser will not be available. The program will pay for Lyft SHARED rides ­only; Classic rides will still be available short-term, but only until the SHARED option is reinstated on the platform. Please be sure to wear your mask at all times, and follow all other Lyft Community Guidelines. All invitations to join the Lyft program for Fall will be emailed automatically beginning Monday, August 16; do NOT share your invitation with others, as doing so will deactivate your account. If you do not receive an invitation by August 20, please email garciaml@usc.edu to request one. IMPORTANT REMINDERS: The program runs on credits that automatically renew every month; USC does NOT pay for cancellations fees, tips or PrimeTime upcharges. If your ride starts and ends within the appropriate campus geofence, and in all other ways qualifies for the program, it will say “FREE” in the fare quote box; again, the program will only pay for Lyft SHARED rides once that offering returns. Hours of operation beginning August 16 are: At UPC: 6:00pm – 2:00am, seven days a week At HSC: 5:00pm – midnight, Monday-Friday Appointments for in-person office visits are still highly recommended; we are accepting walk-ins on a limited basis, but will give priority to those with appointments. You can make an appointment online here; please remember that per USC/LA County guidelines, masks are required inside buildings at all times, regardless of your vaccination status. Trojan Check will be reinstated for campus/selected building access on August 19; please complete your daily attestation before coming to campus and be prepared to have it scanned upon entry to campus. Please contact us at auxtrans@usc.edu if you have any questions. Thank you! Fall Bus Schedule now available! (posted 8/12/21) The new, printable bus schedule for Fall is now available on our main bus Map & Schedules page (here); Fall Semester 2021 bus routes will begin on Monday, August 23rd. We will continue to expand our service throughout the semester as we are able to increase staffing levels to meet our demand. Please continue to check the Map & Schedules page for updates on added service. USC Employee Fall services announcement (posted 8/10/21) As posted on the USC Employee Gateway page on Monday, August 9, please note the following service announcements for Fall: Fall permit sales continue online! Employees can purchase parking permits directly from the USC Transportation website. (Start by finding the “Access my Account” link under the “Parking” header, and then follow the prompts.) NOTE: All interested employees need to purchase a new permit – please do not use the “Renew” option. Click on “Get Permit” instead. Permit costs are listed for the entire two years an employee permit is valid; if you continue through to the “View Cart” screen, there will be a dropdown menu of payment options, from which you can/should select pretax monthly payroll deduction. The monthly charge will then come out of your paycheck automatically. You can cancel your permit anytime by returning it to USC Transportation if your unit plans/schedule changes. USC buses will continue to expand their services throughout the fall semester. An initial fall schedule will be posted the week of August 16 on the “Bus Map & Schedules” page, here, and stay tuned for updates! Per USC/LA County guidelines, masks are also required while taking",
    "the USC bus at all times, regardless of your vaccination status. If you need to make an appointment, in-person office visits are still highly recommended. Walk-ins are accepted on a limited basis but priority will be given to those with appointments. You can make an appointment online here. Trojan Check will be reinstated for campus access in August. Please complete your daily attestation before coming to campus and be prepared to have it scanned upon entry to campus. Please contact auxtrans@usc.edu if you have any questions. Metro Connector Project (posted 8/9/21) Please see the attached flyer from Metro regarding a Regional connector project that affects the Expo Line surrounding USC. Summer Graduate U-Pass Program offering (posted 6/17/2021) In response to a petition submitted by Ph.D. students, we notified the USC community today that we would be bringing back the Summer Graduate U-Pass program in 2021. The notice sent to Administration and the Graduate Student Government in response to the petition can be found here; the process for purchasing the summer U-Pass is detailed below. Please let us know if you have any questions. The Graduate Student U-Pass program is available for the remainder of the Summer Semester; the program dates are 6/21 – 8/15/2021, and the pass cost is $31.50, payable via credit card. The process to purchase it is as follows: Go to our website at usc.edu/transportation Under the “Parking” header, click on “Access My Account” Enter your ten-digit USC ID# and password, and click the “Log In” button. You can also create an account on this page if you do not yet have one. If you forget your password, please send us an email at auxtrans@usc.edu to have it reset On the Parking Portal page, select the drop-down arrow next to “Permits” at the top, and then click on “Get Permits.” Click the “Next” button on the following screen. On the following page, the top box is asking for your Subclassification. *IMPORTANT: for the Graduate U-Pass program, select “Student – BUS U-PASS GRAD STUDENT” from the drop-down menu. Complete/confirm all the other required fields, and click on the “Next” button at the bottom. On the “Select Pass…” page, choose either a new card (for an extra $2 charge), or just a renewal (if you have an existing card). Check the agreement box and click on the “Next” button to continue. Click the “Next” button on the following screen. On the “View Cart” page, select a payment method from the drop-down menu, enter/confirm your email address, and click “Pay Now” at the bottom of the page. You will be directed to another screen to enter your card details. If you chose to renew, your existing card will be loaded within 48 hours. If you purchased a new card, it will be mailed to you. Please let us know if you have any questions by contacting our RideShare Coordinator at tsubsidy@usc.edu. Fall 2021 Permit Process Update (posted 6/17/2021) The new permit purchasing process has been distributed via email, also appears here, and will appear on the USC Gateway on Monday, June 21. Please read the memo for complete details, the highlights of which appear below: ALL employee permits expire 6/30/2021; we are asking all employees to go online through our website to purchase a new one, effective July 1. You do not have to purchase a permit starting in July if you do not know what your unit/department plans are yet. If you do wait to purchase a permit until a later time, you will be subject to location availability at the time of purchase. Two new value permits have been created to assist employees who will be on campus a few days/week or less – please refer to the memo for complete details. As always, let us know if you have any questions. The best way to reach us is via email at auxtrans@usc.edu Updates for Summer/Fall 2021 (posted 5/15/2021) As the University continues moving forward with their plans to reopen, we wanted to post the following reminders for Summer/Fall 2021: Parking remains free of charge for all USC employees and students through June 30, 2021. PLEASE NOTE: while there is no fee for permits, you must still display a permit in your vehicle so we know you are an employee/student. Fall 2020/Spring 2021 permits that have expired are fine, and will be honored through 6/30 – there is no additional action you need to take. If you do not have a permit, and need one between now and June 30, please log into or create an account on the permits section of our website, and “purchase” a permit (at no cost) that you can print from home and display in your vehicle. New parking permits will be required for ALL campus constituents effective July 1, 2021. We will also begin charging for permits again on that date. We will be announcing the process for each campus both on this page and via direct email in the coming weeks; please check back frequently for updates. Contact Us USC Transportation 620 McCarthy Way (McCarthy Structure) Los Angeles, CA 90089 T: (213) 740-3575 For office hours or to contact our office at the Health Sciences Campus, click here Quick LinksUSC Auxiliary Services USC Bookstores USC Hospitality USC Housing USC Hotel Los Angeles Memorial Coliseum and Sports Arena Privacy Policy Digital Accessibility Connect With Us FacebookTwitterInstagramFeedback © Copyright 2024 University of Southern California. All rights reserved. Go to Top For the latest USC Transportation announcements, please click the button to the right. Announcements",
    "Visitor Registration – Office of Senior VP Operations Skip to content USC Website Toggle search interface Search Search Site Close search interface Menu Toggle extended navigation Visitor Registration Home More Menu Toggle extended navigation USC Visitor Registration Website USC strives to maintain a safe community. Access to the University Park Campus (UPC) is restricted to students, faculty, staff, registered visitors, and people who have a verifiable business interest on campus. The USC Village also is restricted from 10 p.m. until 6 a.m. each night. Only select entrances are open overnight, and security personnel are stationed at each one. USC community members (current students, faculty, and staff) are simply asked to scan or tap their USC identification. Visitors should be pre-registered by a USC student, faculty or staff member via the Trojan Visitor website. Once a USC student, staff or faculty registers a visitor, the information is immediately available in the registration system. Two new changes have been added to enhance the entry process: Pre-registered visitors will receive an email with a link to a QR code. Visitors must present the QR code and a valid photo ID at any of the open UPC or USC Village entry gates to enter campus. Visitors who would like to visit campus or attend an event without a QR code should stop by a customer service tent to be granted access using their government issued photo ID. For a map of customer service locations please click here. Please note that any USC student, faculty or staff member who registers a guest will be held responsible for ensuring that the guest is aware of and does not violate the university rules and policies designed to protect the normal functions of the university; the full accessibility of our campus; and the health, safety, and well-being of all members of our community. All guests are expected to understand and comply with these rules and policies. If you have any questions about these rules and policies, please visit this Free Expression Page for additional information. USC Alumni campus access registration is available here, and please visit the Alumni Association website for frequently asked questions and additional information. How to Enter Campus Campus Welcome Staff will ask to see your issued QR Code along with a valid Government ID for each registered visitor. A list of current campus entrance openings and hours is available here. Per USC’s Policy regarding Minors, visitors under the age of 18 are not required to provide a valid Government ID, but they must be accompanied by a registered adult at all times. PEDESTRIAN VISITORS: Pedestrians wishing to enter campus must be registered as a visitor, have their QR code, and a government-issued identification card available upon entry. VEHICLES: Cars with a USC parking permit may be admitted to campus parking structures. Registered visitors are allowed entry to parking structures after presenting their QR code and their government-issued identification card to entrance attendants. A parking pass will be issued for registered visitors; payment is required. Unregistered visitors driving vehicles will not be allowed entry to campus parking structures unless they have a verifiable business purpose; examples include commercial food delivery, commercial transportation, delivery vehicles or service calls. Drivers will be asked for identification and for their campus destination. SPECIAL EVENTS: University schools and departments hosting events with a large number of off-campus visitors must make advance arrangements. Visitor passes will be created and sent to attendees to be used for access. Student-organized events must be pre-approved by USC Student Life; visitor arrangements also need to be made through USC Student Life. For questions regarding campus access for large events, please email campusaccess@usc.edu. VENDORS: USC Transportation will issue special parking passes to vendors that need to access campus on a regular basis. For more information, please visit USC Transportation or call (213) 740-3575. USC Student, Faculty, and Staff Pre-Register your VISITOR USC Alumni Alumni register Here Would you like to provide some feedback or suggestions about the website? RELATED WEBSITES USC SafetyFire Safety and Emergency PlanningEnvironmental Health & SafetyParking Tickets (USC Transportation)Diversity at USCDPS EmploymentCampus Events Permit Digital Accessibility USC EMERGENCY INFORMATION Current Status EMERGENCY PHONE NUMBERS For 24 hour emergency assistance or to report a crime:UPC: 213-740-4321HSC: 323-442-1000 NON-EMERGENCY PHONE NUMBERS For 24 hour non-emergency assistance or information:UPC: 213-740-6000HSC: 323-442-1200 University of Southern California Privacy Notice Notice of Non-Discrimination Digital Accessibility Close Menu Search Search Site Home",
    "How to Access Campus - USC Skip to Content Open Site Navigation / Menu Search We Are USC Back to Main Menu The University Back to The University The University USC is a constellation of schools, centers and institutes where some of the brightest minds are leading the way to the future of education. Leadership Faculty Values Facts and Stats Traditions Our History We Are Southern California Back to We Are Southern California We Are Southern California USC, L.A. and California's southland are inextricably linked. Our passion as a great private research university serves the public good across the city and throughout SoCal — advancing society and improving lives. Our Communities We Are Trojans We Are Connectors We Are Advancing Health We Are Global Back to We Are Global We Are Global Magnify your worldview and craft solutions to today's most complex global problems. USC is your launchpad to gain international perspective and grow global networks — both essential for modern careers. Global Engagement Global Presence Educating Global Leaders Academics Back to Main Menu Schools & Academic Units Back to Schools & Academic Units Letters, Arts and Sciences Accounting Advanced Computing Architecture Art and Design Arts, Technology, Business of Innovation Business Cinematic Arts Communication and Journalism Dance Dentistry Dramatic Arts Education Engineering Gerontology Law Medicine Music Occupational Therapy Pharmacy Physical Therapy Professional Studies Public Policy Social Work Explore Our Programs Back to Explore Our Programs Explore Our Programs Discover the academic programs at USC that match your passion and interests. With 23 schools and academic divisions, we offer a range of undergraduate, graduate and professional majors. Majors & Minors Graduate & Professional Postdoctoral Programs Pre-College Programs Undergraduate Study Back to Undergraduate Study Undergraduate Study At USC, one of the best colleges in the U.S., you'll work with leading experts and supportive faculty to build your path to success. Tap into USC's dynamic, global community as you embark on your world-class undergraduate study. Your First-Year Experience Interdisciplinary Freedom Global Experiences Advising & Support Graduate & Professional Study USC International Academy USC Online High School Summer Programs Libraries Academic Calendar Schedule of Classes Life at USC Back to Main Menu Living in L.A. Campus Life Back to Campus Life Campus Life USC offers an endless variety of activities and events for students to get involved in. From student-run clubs and organizations to exclusive film screenings and outdoor yoga, there is something for everyone on campus. Housing & Dining Student Organizations and Clubs Community Service USC Village Campus Safety Health and Well-being Research & Creativity Back to Main Menu Research & Innovation Back to Research & Innovation Research & Innovation USC engages in forward-looking, collaborative research with industries around the world to find unprecedented and much-needed solutions for some of the most complex issues facing humanity today. Student Research Faculty Research Research Resources Innovation Office of Research & Innovation Creative Expression Our Impact Back to Our Impact Our Impact At USC, we are defining conversations, influencing policy and creating a healthier and more sustainable future for all. Our students, faculty and alumni are making an impact in Los Angeles and around the world. Inventing Solutions Exploring Medical Frontiers Creating New Knowledge Admission & Aid Back to Main Menu Undergraduate Admission Graduate Admission Financial Aid Visit USC USC Athletics USC Patient Care MyUSC News Events Visit Apply Giving Employees Students Faculty Alumni Families Directories What are you looking for? Search: Search Suggested Searches Majors & Minors How to Access Campus Welcome to the University Park Campus! All main gates are open around campus. To help speed up access to campus, all main gates are open. The McClintock* and McCarthy entrances will provide 24-hour access every day. All main pedestrian entrances are also open 24/7. The other vehicle entrances are open weekdays from 6 a.m.-8 p.m. Fast lanes available to all USC ID cardholders. To help speed up access, a “fast lane” available at most vehicle and pedestrian entrances for those with a USCard. These lanes allow you to quickly tap or swipe your USCard, speeding up the screening process for faster campus access. Plan ahead. Our goal is to make your USC campus experience as smooth as possible with the university’s modernized security measures. When arriving, please plan ahead and allow for extra time to enter campus and have the necessary information ready for guest services. *Please note vehicle access at McClintock Entrance is limited to those with staff, faculty or student USC ID (USCard) and approved external vendors. The pedestrian entrance at McClintock is accessible to all visitors. What You Should Know USC Students, Faculty and Staff At each entrance, USC faculty, students and staff will need to show their staff, faculty or student USC ID (USCard). To help speed up access, a “fast lane” will be available at most vehicle and pedestrian entrances for those with a USCard. These lanes allow you to quickly tap or swipe your USCard, speeding up the screening process for faster campus access. Multiple fast lanes will be available for convenience. Alumni USC welcomes Trojan alumni back to campus. If you’re planning a visit, there are three simple pre-registration options available to you: Visiting as a Guest: If you’re visiting campus as a guest of a current student, faculty, or staff member, your host can register you using the visitor registration form. This will also grant you access to pre-registered campus events. No additional forms are required. Campus Tours: If you’d like to enjoy a campus tour with friends or family, you can easily register through the admissions campus tours website. No additional forms are necessary. Independent Visit: If you’re visiting campus on your own, you can request a Visitor’s Pass through the USC Alumni Association. Questions? Visit the USC Alumni Campus Access page for more details. Campus Visitors (Guests) Campus guests must be registered online by their campus sponsor. Visitors should present a photo ID and the visitor QR code provided by their campus sponsor during registration. Our new welcome services tents at the busiest entrances are staffed and ready to assist, including additional support for individuals with disabilities or special needs. Registering guests online is quick and easy, and they will receive a QR code for faster entry. Walk-ups or unregistered guests will be asked to show their government-issued ID and the reason for their visit, and the customer service personnel will scan their ID. Please note that guest access is permitted at all access points except the McClintock Entrance. Vendors Vendors must provide confirmation of work. USC Transportation will issue special parking passes to regular vendors. For more information, please visit USC Transportation or call 213-740-3575. Move-In Day USC is looking forward to welcoming our residents for the upcoming academic year. For move-in information, please visit USC Housing’s Fall Check-In website. Expedited Parking Access All campus parking structures are open and ready to serve you. To help reduce congestion, vehicle access at the McClintock Entrance is limited to those with staff, faculty or student USC ID (USCard) and approved external vendors. The pedestrian entrance at McClintock remains accessible to everyone with a USCard or guest registration. To ensure a smooth experience for everyone, we allow entry for unregistered visitors driving vehicles only if they have a verifiable business purpose. This includes activities such as commercial food delivery, transportation services or service calls. Upon arrival, drivers will need to present identification and provide details about their destination. Helpful Links Helpful links for accessing University Park Campus. Vehicle and Pedestrian Access Map USC Visitor Registration Website USC Transportation and Parking, News and Announcements After-Hours Visitor Registration Frequently Asked Questions USC students, faculty, staff and all other visitors to the USC University Park Campus can easily and quickly access the campus this fall. Please see below for more information about this process. Questions can be directed to campusaccess@usc.edu or via phone: (213) 740-1027. PARKING AT THE UNIVERSITY PARK CAMPUS Where can I park? All of our parking structures on campus are open. Please note: The McClintock Entrance will be open only to drivers with USC IDs or approved vendors from Monday through Friday. Based on feedback from our community, we made this change to ease congestion there. Pedestrians, including guests, can check-in at the McClintock gate. On weekends, the McClintock entrance will be open to all visitors and the campus community. ENTERING CAMPUS How do I enter the University Park Campus? All of our pedestrian gates are open. Students, staff and faculty with USC ID cards can enter through fast lanes at any of our gates. All gates are open weekdays from 6 a.m. to 8 p.m. The McClintock and McCarthy gates will remain open 24 hours a day, seven days a week, for students, faculty or staff with ID. Will my bag be checked? We are not planning on bag checks currently, but we reserve the right to inspect bags upon request. STUDENTS, STAFF AND FACULTY What identification do I need to access campus? If you are a student, faculty member or staff member, you need your USC ID card. You can tap your card at any of the fast lanes for quick entry. For anyone who joined USC prior to June 2020, you will receive information from USCard Services on how to upgrade to a new card with tap technology. In the meantime, you can swipe your card at the fast lanes at the check-in gate. What if I don’t have my USC ID card? Staff at our campus welcome services tents near the gates will be able to assist you. If you’ve lost your USC ID, you can visit USCard Services online and submit information to obtain a new one. My USC ID card isn’t working — what do I do? Please visit the nearest campus welcome services tent for help. If there isn’t a clear reason why the card is not working when swiped or tapped, you will need to contact campusaccess@usc.edu. As long as your government-issued ID, such as a driver’s license or passport, matches your USC ID card, then the staff at the tents can assist you with entering campus. You may also follow one of these tips, depending on the issue you’re experiencing: In University Housing, please see the housing customer service center for your building. In non-Housing buildings, please see the building’s facility manager. At USC Fitness Centers, please see Recreational Sports. For all other card problems, please email uscard@usc.edu or call (213) 740-8709. After business hours, please call the Department of Public Safety at (213) 740-6000. If your card does not work anywhere, please check in with USCard Services to get a new card. I’m a student moving into a residence hall soon. What do I need to do to move into my residence hall? Before you arrive, you will need to schedule a Move-In appointment at the USC Housing portal: housingapp.usc.edu. USC Housing is sending emails to students with instructions for Move-In and entering campus. Students will receive a QR code to check into your contracted assignment space. On your move in day, you will need to check in at your housing customer service center. You will also need your USC ID or any government-issued identification document with photo to verify your identity along with the QR code. Please provide a copy of the QR code to any non-USC guests who will be assisting you on move-in day to ensure they can enter the campus perimeter checkpoints during move-in days. For additional information about move-in, please visit the USC Housing Check-In Guide. For general information and assistance with move-in, you may contact the Housing Services Office at 213-740-2546. GUESTS Can USC students, faculty or staff invite guests to campus? Yes. The process is fast and simple: Go to visitor.usc.edu, fill out the requested information and your guest will receive an email with a QR code for entry. I am not a USC student, staff or faculty member but I want to go to the USC Bookstore, Fisher Museum, etc. Can I still come to campus? Yes. If you do not have a guest registration QR code, you may check in with our campus welcome services staff at the tents near the entrances of campus. Please have a government-issued ID with your photo to show our staff. When you RSVP for an event on campus, you should receive a QR code from the event organizers that will enable you easy access to campus. If you are unsure if you have a QR code, please contact the event organizer directly. If you are unable to locate your QR code when trying to access, please visit the campus welcome services tent (this many delay your entrance to campus). Why do I need to show identification? Our new practices are intended to ensure that we provide a welcoming and safe environment. I graduated from USC and am a member of the USC Alumni Association. I would like to visit campus. Do I need to be a registered guest? Alumni are welcome to visit. Please follow the instructions at our alumni guest registration web page to obtain your QR code. APPOINTMENTS I’m going to a medical or dental appointment at UPC. How do I access campus? Please show our campus welcome services representatives your appointment confirmation. HOURS What time does campus open and when does it close? The McClintock and McCarthy entrances will provide 24-hour access every day. All pedestrian entrances also will be open 24/7. The other vehicle entrances will be open weekdays from 6 a.m.-8 p.m. What are the hours of the campus welcome services tents? The tents will be open weekdays from 6 a.m. to 8 p.m. Will this impact access to the USC Village? No, there are no changes in the USC Village’s entry process. These changes for check-in are only for entering the University Park Campus. Fast Lanes To help speed up access, a “fast lane” will be available at most vehicle and pedestrian entrances for those with a USC staff, faculty or student identification card (USCard). These lanes allow you to quickly tap or swipe your USCard, speeding up the screening process for faster campus access. Vehicle and Pedestrian Access Parking at these structures is available for vehicles with USC parking permits and registered guests who purchase a parking pass upon arrival. McClintock Avenue Entrance* (Royal and Downey Structures) Royal Structure 663 W. 34th St., Los Angeles, CA 90089 Downey Structure 3667 McClintock Ave., Los Angeles, CA 90089 This entrance is open 24/7 every day to visitors arriving by vehicle or pedestrians. *As of Aug. 15, 2024, vehicle access at the McClintock Entrance is limited to those with staff, faculty or student USC ID (USCard) and approved external vendors. The pedestrian entrance at McClintock is accessible to all visitors. McCarthy Way Entrance (McCarthy Structure) McCarthy Structure 620 USC McCarthy Way, Los Angeles, CA 90089 This entrance is open 24/7 every day to all visitors arriving by vehicle or pedestrians. Watt Way Entrance (Downey Structure) Downey Structure 3667 McClintock Ave., Los Angeles, CA 90089 Effective Aug. 15, 2024, this entrance is open weekdays 6 a.m.-8 p.m. to all visitors arriving by vehicle or pedestrians. (Please note 37th Street is closed due to construction.) Downey Way Entrance (Downey Structure) Downey Structure 3667 McClintock Ave., Los Angeles, CA 90089 Effective Aug. 15, 2024, this entrance is open weekdays 6 a.m.-8 p.m. to all visitors arriving by vehicle or pedestrians. Pedestrians Only Effective Aug. 15, 2024, these entrances are open weekdays 6 a.m.-8 p.m. to pedestrians only. Watt Way at Jefferson Watt Way and Jefferson Boulevard Trousdale at Jefferson Trousdale Parkway and Jefferson Boulevard Pardee Way Entrance (Pedestrians Only or Childs Way Reserved Parking) Exposition Boulevard and Pardee Way This entrance is also available to vehicles with reserved parking on Childs Way. Trousdale at Exposition Trousdale Parkway and Exposition Boulevard Vehicles Only Effective Aug. 15, 2024, these entrances are open weekdays 6 a.m.-8 p.m. to all visitors arriving by vehicle. Parking at these structures is available for vehicles with USC parking permits and registered guests who purchase a parking pass upon arrival. Jefferson Entrance (Jefferson Structure) Jefferson Structure 1031 W. 34th St., Los Angeles, CA 90089 Lot V (Behind Herman Ostrow School of Dentistry of USC) Lot V Enter from",
    "Jefferson Bouelvard between McClintock Avenue and Watt Way (see map). Royal Street Entrance (Royal Structure) Royal Structure 663 W. 34th St., Los Angeles, CA 90089 Off-Campus Parking (Public Access) Parking at the Figueroa Structure is available for vehicles with USC parking permits and registered guests who purchase a parking pass upon arrival. After parking, visitors may enter via the McCarthy Way Entrance. Figueroa Structure 3533 S. Flower St., Los Angeles, CA 90089 The Figueroa Structure is open with 24-hour access every day with USC ID access and self-serve “Text to Park” option, or a gate attendant is available for visitors weekdays 6 a.m.-7 p.m. All parking garages remain open to vehicles with USC parking permits and registered guests who purchase a parking pass upon arrival. VEHICLE AND PEDESTRIAN ACCESS MAP University Park Campus (Map) 213-740-2311 Health Sciences Campus (Map) 323-442-2000 Tommy Cam Hecuba Cam About USC Office of the President Office of the Provost Policies and Core Documents Sustainability Economic Impact Patient Care USC Student Health Keck Medicine of USC Request an Appointment Medical Services and Programs Find a Provider Hospital and Clinic Locations Quick Links Campus Events Campus Safety Careers at USC Commitment to Change How to Access Campus Pressroom Privacy Notice Notice of Non-Discrimination Digital Accessibility Smoke-Free Policy Copyright © 2024 University of Southern California",
    "USC Privacy Notice - USC Skip to Content Open Site Navigation / Menu Search We Are USC Back to Main Menu The University Back to The University The University USC is a constellation of schools, centers and institutes where some of the brightest minds are leading the way to the future of education. Leadership Faculty Values Facts and Stats Traditions Our History We Are Southern California Back to We Are Southern California We Are Southern California USC, L.A. and California's southland are inextricably linked. Our passion as a great private research university serves the public good across the city and throughout SoCal — advancing society and improving lives. Our Communities We Are Trojans We Are Connectors We Are Advancing Health We Are Global Back to We Are Global We Are Global Magnify your worldview and craft solutions to today's most complex global problems. USC is your launchpad to gain international perspective and grow global networks — both essential for modern careers. Global Engagement Global Presence Educating Global Leaders Academics Back to Main Menu Schools & Academic Units Back to Schools & Academic Units Letters, Arts and Sciences Accounting Advanced Computing Architecture Art and Design Arts, Technology, Business of Innovation Business Cinematic Arts Communication and Journalism Dance Dentistry Dramatic Arts Education Engineering Gerontology Law Medicine Music Occupational Therapy Pharmacy Physical Therapy Professional Studies Public Policy Social Work Explore Our Programs Back to Explore Our Programs Explore Our Programs Discover the academic programs at USC that match your passion and interests. With 23 schools and academic divisions, we offer a range of undergraduate, graduate and professional majors. Majors & Minors Graduate & Professional Postdoctoral Programs Pre-College Programs Undergraduate Study Back to Undergraduate Study Undergraduate Study At USC, one of the best colleges in the U.S., you'll work with leading experts and supportive faculty to build your path to success. Tap into USC's dynamic, global community as you embark on your world-class undergraduate study. Your First-Year Experience Interdisciplinary Freedom Global Experiences Advising & Support Graduate & Professional Study USC International Academy USC Online High School Summer Programs Libraries Academic Calendar Schedule of Classes Life at USC Back to Main Menu Living in L.A. Campus Life Back to Campus Life Campus Life USC offers an endless variety of activities and events for students to get involved in. From student-run clubs and organizations to exclusive film screenings and outdoor yoga, there is something for everyone on campus. Housing & Dining Student Organizations and Clubs Community Service USC Village Campus Safety Health and Well-being Research & Creativity Back to Main Menu Research & Innovation Back to Research & Innovation Research & Innovation USC engages in forward-looking, collaborative research with industries around the world to find unprecedented and much-needed solutions for some of the most complex issues facing humanity today. Student Research Faculty Research Research Resources Innovation Office of Research & Innovation Creative Expression Our Impact Back to Our Impact Our Impact At USC, we are defining conversations, influencing policy and creating a healthier and more sustainable future for all. Our students, faculty and alumni are making an impact in Los Angeles and around the world. Inventing Solutions Exploring Medical Frontiers Creating New Knowledge Admission & Aid Back to Main Menu Undergraduate Admission Graduate Admission Financial Aid Visit USC USC Athletics USC Patient Care MyUSC News Events Visit Apply Giving Employees Students Faculty Alumni Families Directories What are you looking for? Search: Search Suggested Searches Majors & Minors USC Privacy Notice Updated: April 21, 2023 University of Southern California (“USC”) is committed to delivering information services that recognize and respect users’ privacy concerns. This Privacy Notice is intended to inform you of our general policies and practices regarding our collection, use, and disclosure of the information that you submit to us and that we collect from you during your use of the www.usc.edu website and other USC hosted websites. The types of information we collect may vary depending on the specific USC site you visit or application you use. Accordingly, this Privacy Notice is intended to be a general statement and may be supplemented by more specific privacy notices that pertain to personal information exclusively associated with a specific department, unit or function. On This Page Jump to a Section Our Information Collection and Use Practices Cookies and Website Analytics Access and Choice GDPR Information Updates to Privacy Notice Contact Us Our Information Collection and Use Practices Information you submit voluntarily through our websites, such as your name, email, or other contact information, may be collected by USC to respond to your inquiries, as well as for internal marketing and development purposes. USC websites may use online data entry forms to collect personally identifiable information, including your name and contact information (email, address, telephone number) and other identifiers in order to allow you to provide website feedback, register for events, or use USC’s online applications and services. We may reveal personally identifiable information about you to unaffiliated third parties: if you request or authorize it; if the information is provided to help complete a transaction for you; if the information is provided to comply with the law, applicable regulations, governmental and quasi-governmental requests, court orders or subpoenas, to enforce our Terms of Use or other agreements, or to protect our rights, property or safety or the rights, property or safety of our users or others (e.g., to a consumer reporting agency for fraud protection etc.); if the information is provided to our agents, outside vendors or service providers to perform functions on our behalf (e.g., analyzing data, providing marketing assistance, providing customer service, processing orders, etc.); or as otherwise described in this Privacy Notice or in a more specific privacy notice associated with a particular department, unit or function. We may share information that does not personally identify you without restriction. Back to Top Cookies and Website Analytics We (and our authorized third parties) use cookies and similar technologies, such as pixels, web beacons, tags, and session replay tools to collect information about you, your device, and how you interact with our websites. Cookies are a type of technology that install a small amount of information on a user’s computer or other device when they visit a website. Some cookies are erased when you close your browser window and some persist over multiple sessions for a period of time. Pixels, web beacons and tags are types of code or transparent graphics that contain a unique identifier, and which provide analytical information about the user experience and help us customize our marketing activities. In contrast to cookies, which are stored on a user’s computer hard drive, pixels, web beacons, and tags are embedded invisibly on web pages. Session replay tools record your interactions with our websites, such as how you move throughout our websites and engage with our webforms, and help us improve our websites and identify and fix technical issues visitors may be having with our websites. In addition to the uses identified above, we use these technologies to analyze website usage by all of our visitors; to help us remember you and your preferences when you revisit the websites; and to remember you the next time you log in. We may disclose information to or allow selected third parties, such as social media companies, advertising networks, and companies that provide analytics including ad tracking and reporting, to place cookies and other tracking technologies through the website to provide us with better insights into the use of the website or user demographics or to provide relevant advertising to you. These third parties may collect information about a user’s online activities over time and across different websites when he or she uses our website. Many USC.edu websites use Google Analytics (or other similar web analytics tools) to collect information about visitor traffic and behavior. This allows us to identify usage trends and to improve the performance and content of our websites. You can use the Google Analytics Opt-Out Browser Add-on to disable tracking by Google Analytics. Further general information about cookies and how they work is available at www.allaboutcookies.org. You can decline cookies by adjusting your browser settings but some features of the websites may not function. If you change computers, devices, or browsers; use multiple computers, devices, or browsers; or delete your cookies, you may need to repeat this process for each computer, device, or browser. We currently do not use technology that responds to do-not-track signals from your browser. Back to Top Access and Choice USC students can manage privacy settings for their directory information by following the instructions in the Request to Restrict Directory Information form. Faculty and staff can manage their directory information in Workday. You can choose not to receive certain emails from us by “unsubscribing” using the instructions in any email you receive from us. This will not stop us from sending emails about your account or education with us. Back to Top GDPR Information In most cases, the lawful grounds for collecting and using your personal information is for USC’s legitimate interests in carrying out its business functions, provided that our interests do not outweigh your rights, interests, and freedom. We may also collect and use your personal information based on your prior consent, to carry out a contractual obligation, or to fulfill legal obligations. When the collection and use is based on your consent, you have the right to withdraw that consent at any time, without such withdrawal affecting the legitimacy of the use that has occurred so far. If you are located in the European Union, you may also have additional rights with respect to your Information, such as: (i) data access and portability; (ii) data correction (including the ability to update your personal data); (iii) data deletion (including the right to have USC delete your personal information, except information we are required to retain, by contacting us); and (iv) withdrawal of consent or objection to processing (including, in limited circumstances, the right to ask USC to stop processing your personal data, with some exceptions, by contacting us). You may also be able to file a complaint with the appropriate supervisory authority in the European Union. Back to Top Updates to Privacy Notice USC reserves the right to modify this privacy notice at any time. We encourage visitors to frequently check this page for any changes to this Privacy Notice. If we make changes, we will post an updated effective date at the top of the Privacy Notice. Your continued use of this site after any change in this Privacy Notice will constitute your acceptance of such change. Back to Top Contact Us If you have any questions or concerns about this Privacy Notice, please contact us at compliance@usc.edu. Back to Top University Park Campus (Map) 213-740-2311 Health Sciences Campus (Map) 323-442-2000 Tommy Cam Hecuba Cam About USC Office of the President Office of the Provost Policies and Core Documents Sustainability Economic Impact Patient Care USC Student Health Keck Medicine of USC Request an Appointment Medical Services and Programs Find a Provider Hospital and Clinic Locations Quick Links Campus Events Campus Safety Careers at USC Commitment to Change How to Access Campus Pressroom Privacy Notice Notice of Non-Discrimination Digital Accessibility Smoke-Free Policy Copyright © 2024 University of Southern California",
    "Campus update - Office of the President Skip to main content Go to usc.edu homepage USC Monogram Office of the President MenuAn icon that consists of three parallel horizontal lines suggestive of a list. Home Biography From the PresidentShow submenu for From the President Community Messages Speeches Conversations Contact Presidential Working GroupsShow submenu for Presidential Working Groups Racial Equity, Diversity, and Inclusion (REDI) Presidential Working Group on Sustainability in Education, Research, and Operations Student-Athlete Experience Task Force Department of Public Safety Community Advisory Board (CAB) Interfraternity Council Culture, Prevention, and Accountability More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Campus update April 30, 2024 To the Trojan Community: I’m writing to give you an update. The recent events at USC have been hard on all of us – I know you’re seeing it, hearing it, and that you have many questions about how we’re maintaining safety, honoring free speech, and ensuring we can host our 141st commencement to give our graduates the celebration they have earned. We’re working hard to maintain a peaceful campus. The situation is fluid – like at other universities across the nation – and we will adapt when necessary. We’re also seeing a lot on social media that’s distorted and, in many cases, is outright misinformation. I want to share what our university is doing right now: We’re getting ready for 47 commencement ceremonies and celebrations. When you walk across campus, you’ll see stages, tents, and chairs going up – cardinal and gold banners and flowers everywhere. USC traditions are holding strong. I walked by Tommy Trojan today and witnessed graduates and their families lining up at our campus icons, taking photos and commemorating this important event. I encourage you to click on Tommy Cam to see that the Trojan Spirit is in full swing. We’re also deep into Quiet Week with final exams approaching – students are filling our libraries, meeting in study groups, and even taking an occasional break for coffee with friends. They’re focused on academic achievement, and it’s our job to support them in every way possible, including academic accommodations if needed. We’re maintaining our unshakeable commitment to free speech, with a designated Free Speech Area for peaceful protests and USC’s balanced, robust, and independent student-run media reporting on campus every day. This is part of our commitment to allow all students to access and move around our campuses free from obstruction, harassment, threats, or discrimination. And we will continue to ensure the physical safety and well-being of every Trojan on our campuses. I’m talking directly with our students, including two lengthy sessions with representatives from Divest from Death USC, the group that established the encampment in Alumni Park. In addition, we’re holding informational sessions with our faculty and staff. And I will continue the important outreach to all members of our community – including our Jewish and Israeli communities, our Palestinian and Muslim communities, as well as others. I have faith in our ability to unite and seek common ground. My call to action is to ask for your help: de-escalate tension, keep our campuses peaceful, respect our 47,000 students – and, whenever you can, remember to congratulate the members of the Class of 2024 on their outstanding accomplishments. Sincerely, Carol L. FoltPresident USC Office of the President Los Angeles, CA 90089-0012 (213) 740-2111 president@usc.edu University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility InstagramInstagramThe logo for the social media platform Instagram. XXThe logo for the social media platform X.",
    "University of Southern California Statement on Academic Boycotts – Commitment to Change Skip to content USC Website Toggle search interface Search Search Site Close search interface Menu Toggle extended navigation Commitment to Change News USC Culture JourneyToggle \"USC Culture Journey\" dropdown Upcoming Events TransformationToggle \"Transformation\" dropdown OCR 2020 Findings and Resolution Agreement Human Resources Design for the Future Continuous Efforts to Enhance University Responses Department of Public Safety Community Advisory Board Addressing Sexual Assault Rossier Rankings Report Tyndall IssuesToggle \"Tyndall Issues\" dropdown California State Court Global Settlement Federal Class Action Settlement Background about the Tyndall Issues Admissions Reporting and Support Resources More Menu Toggle extended navigation Home2023July18University of Southern California Statement on Academic Boycotts University of Southern California Statement on Academic Boycotts Publication date July 18, 2023 Universities are often asked to participate in academic and cultural boycotts and sanctions that represent the interests of our diverse communities, such as the Boycott, Divestment, and Sanctions campaign (BDS). The University of Southern California believes in the core principle of academic freedom, and has a longstanding position against such boycotts on the grounds that a robust intellectual environment requires the free and civil exchange of ideas. As a pluralistic university whose students, faculty, and alumni come from more than a hundred countries, we are deeply committed to fostering and reflecting the profound diversity of political, cultural, and religious beliefs and perspectives among our community. Related Websites Board of TrusteesOffice of the PresidentOffice of the ProvostOffice of Human Resources, Equity & ComplianceOffice of Ethics, Culture and ComplianceOffice of Equity, Equal Opportunity, and Title IXOffice of Professionalism and Ethics Send Your Comments: botchair@usc.edu University of Southern California Privacy Notice Notice of Non-Discrimination Digital Accessibility Close Menu Search Search Site News USC Culture JourneyToggle \"USC Culture Journey\" submenu Upcoming Events TransformationToggle \"Transformation\" submenu OCR 2020 Findings and Resolution Agreement Human Resources Design for the Future Continuous Efforts to Enhance University Responses Department of Public Safety Community Advisory Board Addressing Sexual Assault Rossier Rankings Report Tyndall IssuesToggle \"Tyndall Issues\" submenu California State Court Global Settlement Federal Class Action Settlement Background about the Tyndall Issues Admissions Reporting and Support Resources",
    "Campus Update - Office of the President Skip to main content Go to usc.edu homepage USC Monogram Office of the President MenuAn icon that consists of three parallel horizontal lines suggestive of a list. Home Biography From the PresidentShow submenu for From the President Community Messages Speeches Conversations Contact Presidential Working GroupsShow submenu for Presidential Working Groups Racial Equity, Diversity, and Inclusion (REDI) Presidential Working Group on Sustainability in Education, Research, and Operations Student-Athlete Experience Task Force Department of Public Safety Community Advisory Board (CAB) Interfraternity Council Culture, Prevention, and Accountability More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Campus Update May 3, 2024 Dear Trojan Family, I’m writing to let you know the steps we’re taking now to ensure students finish their finals in a quiet, safe academic environment – and that our graduating students can enjoy peaceful and joyous commencement ceremonies worthy of their accomplishments. Freedom of expression is one of our foundational values, and throughout the year, faculty, staff, and students have held lawful marches, vigils, and peaceful demonstrations. But let me be absolutely clear: free speech and assembly do not include the right to obstruct equal access to campus, damage property, or foment harassment, violence, and threats. Nor is anyone entitled to obstruct the normal functions of our university, including commencement. The university is legally obligated to ensure that students, faculty, and staff can move freely throughout our campus while pursuing their studies, work, and research. Every part of our campuses, including Alumni Park, must be fully accessible and free from vandalism and harassment. When laws and policies that apply to everyone are repeatedly and flagrantly violated – there must be consequences. This is an intense and highly charged time for the country and for many here at USC – I’m asking everyone to help, abide by all our security measures, and treat each other with empathy and respect. The university has initiated disciplinary review processes for individuals who have violated both our policies and the law. We will take any further actions required to maintain campus safety and security, consistent with our legal obligations. Finals conclude on Wednesday and our commencement ceremonies begin that same day. We’re quickly approaching the time when our graduates, their families, and loved ones will come together at USC. I’m grateful to everyone who is working so tirelessly to bring USC’s commencement celebrations to life. With gratitude, Carol L. FoltPresident USC Office of the President Los Angeles, CA 90089-0012 (213) 740-2111 president@usc.edu University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility InstagramInstagramThe logo for the social media platform Instagram. XXThe logo for the social media platform X.",
    "Home - ACIR Skip to main content Go to usc.edu homepage USC Monogram ACIR Advisory Committee on Investment Responsibility MenuAn icon that consists of three parallel horizontal lines suggestive of a list. Home Background Fossil Fuels FAQs Meetings Submissions Membership News More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Advisory Committee on Investment Responsibility About The Advisory Committee on Investment Responsibility (ACIR) was formed to advise the Investment Committee of the Board of Trustees on matters relating to environmental, social, and corporate governance (ESG) as expressed by the broader USC community. Topics considered by the ACIR include, but are not limited to, environmental sustainability, diversity equity and inclusion, corporate governance, and human rights issues that are relevant to investing. The ACIR provides advice about responsible investment practices to the Investment Committee, but it does not manage USC’s Endowment Fund or its investments in any way. The Investment Committee ultimately determines whether to accept or reject the ACIR’s proposed recommendations. The ACIR was endorsed by the Investment Committee of the Board of Trustees on November 22, 2021 and formally established by the Board of Trustees on July 19, 2022. It operates under the oversight of the Office of the President, the President approves all members and selects the committee chairperson. The ACIR Charter governs the role and responsibilities of the ACIR. Mission The central mission of the University of Southern California is the development of human beings and society as a whole through the cultivation and enrichment of the human mind and spirit. The principal means by which our mission is accomplished are teaching, research, artistic creation, professional practice and selected forms of public service. USC’s Endowment Fund provides vital financial support to the University to ensure our academic and research missions may endure in perpetuity for current and future students. The primary investment objective for the Endowment Fund is to maximize long-term returns on investment assets that are compatible with the University’s risk tolerance and time horizon, and consistent with prudent investment practices. The Board of Trustees recognizes the importance of stewardship criteria in safeguarding and promoting the endowment’s long-term economic interests. ESG factors may impact future economic growth and the underlying fabric of a society. While specific issues will vary by asset class and investment strategy, USC recognizes that ESG factors can meaningfully influence the outcome of the USC’s investment portfolio. In addition to the Investment Policy Statement, the USC Investment Office also operates under the guidance of its Investment Stewardship Policy. The consideration of these factors in the investment process is consistent with USC’s mission and unifying values. Read our Statement of Investment Responsibility Members of the ACIR Staff Stacy Giwa (Chair) Monica Dean Faculty Marlon Boarnet Richard Sloan Students Leo Arney (undergrad) Francisca Martinez (graduate) Alumni Howard Kern Kathleen Burns Campos ACIR Advisor Hannah Findling Email: acir@usc.edu University of Southern CaliforniaPrivacy Notice Notice of Non-Discrimination Digital Accessibility",
    "Home | USC Visions & Voices Events Event Calendar V&V ON YOUTUBE Theme Guides Season Brochures Attendance Policies USC AMPLIFIED Past Events Visit Get Involved Arts In Action About Overview Who We Are Arts At Usc Support Email List Home Blurring the boundaries between the classroom and the social world through free interdisciplinary arts and humanities experiences that connect communities, expand perspectives, and create a better and more just future. Upcoming Events View All Events Past HighLights Find an Event Plan Your Visit Get Involved Sign up Sign up for the latest news and event updates from USC Visions and Voices! Subscribe Quick Links About Visions and Voices Arts in Action USC Arts Contact 837 Downey Way, Stonier Hall B1 Los Angeles, CA 90089-1142 (213) 740-0483 visionsandvoices@usc.edu Follow Us USC Visions and Voices: The Arts and Humanities Initiative Sign up Sign up for the latest news and eventupdates from USC Visions and Voices! Subscribe ×",
    "Home - Department of Public Safety Skip to main content Go to usc.edu homepage USC Monogram Department of Public Safety MenuAn icon that consists of three parallel horizontal lines suggestive of a list. AboutShow submenu for About Chief’s Message Executive Staff Types of Officers Frequently Asked Questions ServicesShow submenu for Services After Hours Visitor Registration LAX Airport Shuttle Reservation Alarms Bicycle, Scooter, and Skateboard Registration CCTV Video Request Automated License Plate Recognition System (ALPR) Emergency Blue Light Phones Health & Wellness Resources Lost and Found LiveSafe Mobile Safety App Patrol Areas Property Identification Engraving Request Report Copy Safety Training Secure Parking During Semester Breaks TrojansAlert USC Events Permit Application Security Assessment Self-defense Classes Safety TipsShow submenu for Safety Tips Be Aware of Scams Getting Around Campus Safely Hosting Social Events Jogging Safety Moving Out and Traveling Sexual Assault and Violence Suspicious Activity & ConfrontationsShow submenu for Suspicious Activity & Confrontations What to Do During a Robbery Panhandling Theft PreventionShow submenu for Theft Prevention Laptop Theft Prevention and Recovery Clery & Crime AlertsShow submenu for Clery & Crime Alerts Campus Security Authorities Clery RequirementsShow submenu for Clery Requirements Clery On-Campus Map Clery Crimes and Definitions Alerts Daily Crime & Fire Log Annual Security Report Community OutreachShow submenu for Community Outreach Cadet Program Safety Presentations ContactShow submenu for Contact Give Feedback Report a Crime Join DPS Get Connected More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Welcome to USC DPS We are one of the largest university public safety agencies in the nation. DPS has more than 300 full-time members. Under the leadership of Chief Lauretta Hill, DPS is responsible for providing public safety services to the university community. Our patrol area is the University Park Campus and two and one-half square miles surrounding the campus, and the Health Sciences Campus, and about one square mile surrounding that campus. DPS operates 24 hours a day, 365 days a year and is committed to maintaining a safe and secure environment conducive to learning. DPS Mission & Values We serve the USC community by providing a safe, secure, and welcoming environment through community engagement, technology, collaborative partnerships, and commitment in support of USC’s mission for all students, faculty, staff, and campus visitors to realize their full potential intellectually, educationally, spiritually, and through their social pursuits. DPS has embraced the university’s Unifying Values as our department’s values. They are: DPS Safety Tips Video Chief’s Message Chief Lauretta Hill, DPS is responsible for providing public safety services to the campus community which stretches more than 2.2 square miles. Types of Officers Learn about the different types of officers here at USC DPS Services We Provide Discover the services we provide Safety Tips In order to take full advantage of your stay at USC and to make it as safe as possible, the USC Department of Public Safety would like you to consider the following safety tips. Clery & Crime Alerts Transparency is one of the Department of Public Safety’s top priorities. We believe citizens are best able to ensure their safety when they’re informed. Community Outreach The Community Relations Office (CRO) provides the USC campus community with various resources that include security assessments, safety presentations, and community relations officers Alerts Sexual Battery/FondlingSeptember 4, 2024Incident Description: The two victims were walking on the sidewalk of West 37th Place. The suspect approached from behind them and grabbed the buttocks of both victims. The suspect then ran away eastbound on 37th Place. The victims lost sight of him in the area of 37th Place and Catalina Street. Content warning: this warning addresses… More Alerts News & Announcements Reminder: updates to how TrojansAlerts will be distributedSeptember 10, 2024Dear USC community, We wanted to remind you that USC is upgrading the TrojansAlert system, and the way we manage recipient lists for some user groups will change significantly beginning on September 17. TrojansAlert is an emergency notification system that allows university officials to contact you during an emergency by sending updates via text message and email. All alert… More News & Announcements RELATED WEBSITES USC SafetyFire Safety and Emergency PlanningEnvironmental Health & SafetyParking Tickets (USC Transportation)Diversity at USCDPS EmploymentCampus Events Permit USC EMERGENCY INFORMATION Current Status EMERGENCY PHONE NUMBERS For 24 hour emergency assistance or to report a crime:UPC: 213-740-4321HSC: 323-442-1000 NON-EMERGENCY PHONE NUMBERS For 24 hour non-emergency assistance or information:UPC: 213-740-6000HSC: 323-442-1200 University of Southern CaliforniaContent managed by Department of Public SafetyPrivacy Notice Notice of Non-Discrimination Digital Accessibility X (Formerly Twitter)XThe logo for the social media platform X. FacebookFacebookThe logo for the social media platform Facebook. InstagramInstagramThe logo for the social media platform Instagram.",
    "Update on Campus Hate Speech and New Government Actions Regarding Antisemitism and Islamophobia - We Are SC Skip to main content Go to usc.edu homepage USC Monogram We Are SC MenuAn icon that consists of three parallel horizontal lines suggestive of a list. We Are SC Stories Happening NowShow submenu for Happening Now Trojan Welcome Experience Heritage Months at USC ONE USC Safety USC Frontiers of Computing Campus ResourcesShow submenu for Campus Resources Student Resources Faculty and Staff Resources Care for our Community Alumni Health and SafetyShow submenu for Health and Safety Campus Safety COVID-19 Daily Digest COVID-19 Resource Center Emergency Safety Mobile App Student Health Commitment to ChangeShow submenu for Commitment to Change USC Culture Journey Human Resources Design for the Future Public Safety Community Advisory Board Addressing AntisemitismShow submenu for Addressing Antisemitism Messages Frequently Asked Questions Advisory Committee on Jewish Life at USC Advisory Committee on Muslim Life at USC University Messages More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. Update on Campus Hate Speech and New Government Actions Regarding Antisemitism and Islamophobia October 31, 2023 Dear Students, Faculty and Staff: Over the past three weeks, we’ve been in conversation with many faculty, students, staff, alumni, and parents who have been personally and profoundly impacted by the violence in Israel and Gaza. Yesterday, the federal government announced new actions to address antisemitism and Islamophobia on college campuses. The White House, the Department of Education (DOE), the Department of Justice (DOJ), and the Department of Homeland Security (DHS) will be issuing formal guidelines. Here is what we know so far: The Office of Civil Rights (OCR) will be updating its discrimination complaint form to include language stating that Title VI of the Civil Rights Act prohibits antisemitism and Islamophobia and will expedite investigations of these complaints. DOE is also planning to hold technical assistance webinars to provide students with information on how to file an OCR complaint. The DOJ and DHS are dedicating 125 protective security advisers and 100 cybersecurity advisers to proactively work with schools and universities to address their needs for cyber threats and online harassment. The Justice Department’s Community Relations Service is also expanding support for Jewish, Muslim, Arab and other impacted communities on campuses across the nation. US Senate unanimously passed a bipartisan resolution denouncing antisemitism at institutions of higher education and encourages college and university leaders, administrators to voice their opposition to antisemitism on campus. At a time when antisemitism has accelerated across the country and around the world, our Jewish and Israeli communities have expressed concerns about protest and poster policies on campus, and about the rhetoric they encounter online and in the classroom. Many are afraid for their safety. And as reports of Islamophobia are increasing, our Muslim, Palestinian, and Arab communities have expressed fear about being doxed, targeted, and harassed online, and about being censored and canceled for their advocacy on campus. USC publicly and unequivocally denounces antisemitism, Islamophobia, racism, and xenophobia. Hate speech is antithetical to our values and any threats of violence are unacceptable. Anyone who incites violence will be referred immediately to law enforcement for investigation and prosecution. We have a dedicated page that outlines in detail USC’s policies on campus safety including specific rules, procedures, support resources and our values. We update this frequently and urge you to use it and refers others to it as needed. During this time of immense pain and intense polarization, it is more important than ever for us to model what civil disagreement and respectful debate looks like on campuses, in our classrooms, and online. Indeed, our university community can and should be a sanctuary for critical thinking and civic engagement so that we can all be part of the solution to the world’s most challenging problems. And so, we ask all members of our community to continue to see the humanity in each other, to recognize and respect each other’s value and dignity, and to treat each other as cherished members of a global Trojan Family. Sincerely, Carol L. FoltPresident Andrew GuzmanProvost and Senior Vice President for Academic Affairs Steve ShapiroSenior Vice President for Health Affairs EmployeesFacultyHealthKeckLatestPresidentProvostStudents University of Southern CaliforniaContent managed by USC CommunicationsPrivacy Notice Notice of Non-Discrimination Digital Accessibility",
    "Types of Officers - Department of Public Safety Skip to main contentSkip to secondary content Go to usc.edu homepage USC Monogram Department of Public Safety MenuAn icon that consists of three parallel horizontal lines suggestive of a list. AboutShow submenu for About Chief’s Message Executive Staff Types of Officers Frequently Asked Questions ServicesShow submenu for Services After Hours Visitor Registration LAX Airport Shuttle Reservation Alarms Bicycle, Scooter, and Skateboard Registration CCTV Video Request Automated License Plate Recognition System (ALPR) Emergency Blue Light Phones Health & Wellness Resources Lost and Found LiveSafe Mobile Safety App Patrol Areas Property Identification Engraving Request Report Copy Safety Training Secure Parking During Semester Breaks TrojansAlert USC Events Permit Application Security Assessment Self-defense Classes Safety TipsShow submenu for Safety Tips Be Aware of Scams Getting Around Campus Safely Hosting Social Events Jogging Safety Moving Out and Traveling Sexual Assault and Violence Suspicious Activity & ConfrontationsShow submenu for Suspicious Activity & Confrontations What to Do During a Robbery Panhandling Theft PreventionShow submenu for Theft Prevention Laptop Theft Prevention and Recovery Clery & Crime AlertsShow submenu for Clery & Crime Alerts Campus Security Authorities Clery RequirementsShow submenu for Clery Requirements Clery On-Campus Map Clery Crimes and Definitions Alerts Daily Crime & Fire Log Annual Security Report Community OutreachShow submenu for Community Outreach Cadet Program Safety Presentations ContactShow submenu for Contact Give Feedback Report a Crime Join DPS Get Connected More…Show More Menu SearchAn icon of a magnifying glass. Search for: CloseAn icon of a letter X. HomeAbout DPSTypes of Officers Types of Officers Department of Public Safety Officers Public Safety Officers (PSOs) PSOs wear a navy blue uniform shirt with navy blue uniform pants and a distinctive USC Department of Public Safety shoulder patch. PSOs are armed, trained at a California Commission on Peace Officer Standards and Training (CA P.O.S.T.)-accredited academy, and have peace officer powers of arrest while on-duty per California Penal Code § 830.7(b). Community Service Officers (CSOs) CSOs wear a French blue uniform shirt with navy blue uniform pants and a distinctive USC Department of Public Safety shoulder patch. CSOs are unarmed, receive the security guard-level training required by the California Bureau of Security and Investigative Services (CA BSIS) and exceed it through in-service training on topics such as de-escalation, defensive driving, first aid/CPR, and more, and have security guard-level authority. Department of Public Safety Uniformed Civilian Personnel/Volunteers Public Safety Dispatchers (PSDs) PSDs wear a gray polo shirt with USC Department of Public Safety · Communications Division embroidered on the left chest, as well as black uniform pants. PSDs are civilian employees. Surveillance Operations Monitors (SOMs) SOMs wear a gray polo shirt with USC Department of Public Safety · Surveillance Operations embroidered on the left chest, as well as black uniform pants. SOMs are civilian employees. Law Enforcement Cadets Cadets are youth volunteers who wear a black polo with cadet written on the back. Cadets are youth volunteers. Contracted Uniformed Security Allied Universal Security (AUS) – “Yellow Jackets” Allied Ambassadors wear a red and yellow jacket with USC AMBASSADOR embroidered on the back, as well as black uniform pants. Allied Ambassadors are not USC DPS employees; they are contracted employees who work for Allied Universal Security (AUS). Their duty is to observe and report any incidents to USC DPS. Chief’s Message Executive Staff Types of Officers Statement: Bias-based Community Policing is Unacceptable Frequently Asked Questions RELATED WEBSITES USC SafetyFire Safety and Emergency PlanningEnvironmental Health & SafetyParking Tickets (USC Transportation)Diversity at USCDPS EmploymentCampus Events Permit USC EMERGENCY INFORMATION Current Status EMERGENCY PHONE NUMBERS For 24 hour emergency assistance or to report a crime:UPC: 213-740-4321HSC: 323-442-1000 NON-EMERGENCY PHONE NUMBERS For 24 hour non-emergency assistance or information:UPC: 213-740-6000HSC: 323-442-1200 University of Southern CaliforniaContent managed by Department of Public SafetyPrivacy Notice Notice of Non-Discrimination Digital Accessibility X (Formerly Twitter)XThe logo for the social media platform X. FacebookFacebookThe logo for the social media platform Facebook. InstagramInstagramThe logo for the social media platform Instagram."
]